[{"Hacker_News_User":"JoeAltmaier","favorite_comments":"So now I do the legwork for articles, instead of the author?  Great!  \"All Minnesotans are stupider than Iowans!  Look it up!\" Apps may not really be relevant to market grows, but they would be relevant to the article subject, \"Welcome back, Nokia\". Are they back? Is anybody writing apps for their phone?  Why would I want one?  All reasonable questions, revolving around apps.","fav_salty_score":"0.735"},{"Hacker_News_User":"pessimizer","favorite_comments":"Even more clarification: never talk to police. Give your name, ask for a lawyer. I'm sure there's a few lawyers out there who think that even giving your name is too much of a risk.","fav_salty_score":"2.594"},{"Hacker_News_User":"pessimizer","favorite_comments":"SSRIs are also like  placebos in that they have no more of an effect than placebo.","fav_salty_score":"0.581"},{"Hacker_News_User":"ivankirigin","favorite_comments":"He's saying it has been done.","fav_salty_score":"0.997"},{"Hacker_News_User":"__david__","favorite_comments":" It looks like you would have to implement USB on top of PCIe in the monitor, though. Isn't that basically UHCI?","fav_salty_score":"-1.9729999999999999"},{"Hacker_News_User":"arethuza","favorite_comments":"I don't think there is much of a market for a \"Wish you a quick painless death in the forthcoming nuclear war\" card. :-|","fav_salty_score":"0.182"},{"Hacker_News_User":"x0x0","favorite_comments":"hmm; if you're such an ai company, i'd love to hear from you so please post =P","fav_salty_score":"0.93"},{"Hacker_News_User":"danieldk","favorite_comments":"Then you need an algebraic data type having nil is one of its constructors, and that function returning that type. AFAIK, Rust doesn't have nil. So, the closest thing is using the option type.","fav_salty_score":"1.015"},{"Hacker_News_User":"benatkin","favorite_comments":"Link.","fav_salty_score":"0.9570000000000001"},{"Hacker_News_User":"rdl","favorite_comments":"I believe they use ultradns (a nice, but very expensive, dns service).","fav_salty_score":"0.976"},{"Hacker_News_User":"krapp","favorite_comments":"I really wish this thread would've gotten more attention... But anyway, I wonder if this bias could be managed not making karma scores or vote counts public. The cumulative effect of votes could still be used to sort the list and everything, but I think seeing the actual number there is what leads to users, consciously or not, turning it into a points game. Really what should matter is judging a post on its own merit and whether its been marked down or not.","fav_salty_score":"-2.284"},{"Hacker_News_User":"pbhjpbhj","favorite_comments":"There's a general principle of prior use as an absolute defence in trademark law - though it wouldn't surprise me to much to find that USA had violated that principle. Candy is too generic in both the software field and the game field to be a distinctive mark and so shouldn't be granted as a word mark; trademark examiner fail. I mean come on. Link. from 2011. Link. from 2008. Link. from 2011; almost an exact match for Candy Crush from King.com Limited. \"Candy\" thus would confuse people as to the origin because of this lack of distinctiveness and widespread prior use in games and in apps. The dates for these prior uses are from Google and hence can't be relied on but better dates could be acquired. This search took 5 minutes at most.","fav_salty_score":"-1.367"},{"Hacker_News_User":"rayiner","favorite_comments":"Auditors would be a lot cheaper than opening prosecutors to civil liability. The basic problem is that you'd be putting a powerful retaliatory tool in the hands of a group of people (convicts) who are: 1) very likely guilty; 2) have all the time in the world; and 3) can't effectively be sanctioned for filing meritless litigation. People justify opening prosecutors to civil liability by saying that \"they need to be held accountable.\" But prosecutors are already accountable. Their actions take place on public record. They have to justify themselves to defense counsel, a judge, and possibly a jury and an appellate panel. On top of all that, their immunity does not protect them from suits alleging bad faith.","fav_salty_score":"0.665"},{"Hacker_News_User":"_delirium","favorite_comments":"In particular, my impression is that outside of technical majors (CS, math, sciences, and engineering) the classic liberal-arts degrees can often be more valuable than one tied to the particular job. I've heard lots of places hiring for nominally \"business\" type jobs actually skeptical of people with BAs in Business, for example.","fav_salty_score":"1.816"},{"Hacker_News_User":"pnathan","favorite_comments":"Imagine the surveillance endemic to the system.","fav_salty_score":"0.72"},{"Hacker_News_User":"michaelochurch","favorite_comments":"It depends what the person's using the language for. I'd say \"no\" for C. C is still the leading language for a lot of purposes: operating systems, runtimes for higher-level languages, device drivers, and applications where tight control of memory use is important. In these domains, C hasn't been supplanted yet-- not even close. I don't know that C++ and Java have substantial domains in which they're superior to other choices. C++ is a badly-conceived cross between C and high-level languages and Java is the worst of the JVM languages.","fav_salty_score":"-0.068"},{"Hacker_News_User":"derleth","favorite_comments":"And if wishes were horses beggars would finally have some meat. How likely is any of that?","fav_salty_score":"0.002"},{"Hacker_News_User":"nkassis","favorite_comments":"Depends it's useful to know exactly how much it will be, sometimes it's not a big deal but it can make a big difference when there are large swings in exchange rates. I personally much prefer knowing exactly what I will pay.","fav_salty_score":"1.272"},{"Hacker_News_User":"RyanZAG","favorite_comments":"While South Africa does have broadband access, most people sit on sub 3GB caps. The actual broadband penetration is also low - 2% for fixed line, and 11% for mobile access. The mobile broadband (3g) is metered per mb and frequently drops down to edge. It is improving, but as with the rest of the developing world, if you want to actually target most users you need to use SMS or very basic html sites that can work on older S40 Nokia phones and blackberries. Obviously a fancy desktop sized page that relies on java script is just completely out.","fav_salty_score":"-0.632"},{"Hacker_News_User":"keithpeter","favorite_comments":" \"Now both of those barriers have been removed\" ...in some places in the world, but not others. Will MS change their defaults by territory does anyone know?","fav_salty_score":"0.023"},{"Hacker_News_User":"Kiro","favorite_comments":"The only rewrite rule you need is one to direct all requests to index.php. Then you just parse the URL in PHP to achieve /blog/title-of-the-article. What is the problem with this approach?","fav_salty_score":"-0.873"},{"Hacker_News_User":"jessaustin","favorite_comments":"Zaxxon! That's a blast from the past, and the only reason I ever knew for someone to be jealous of a ColecoVision.","fav_salty_score":"0.149"},{"Hacker_News_User":"nollidge","favorite_comments":"It's got nothing to do with grammar. \"I could care less\" is a perfectly grammatical sentence - it follows all the rules of English sentence construction. Similarly, \"colorless green ideas sleep furiously\" is also perfectly grammatical, it just doesn't make any semantic sense.","fav_salty_score":"0.643"},{"Hacker_News_User":"rhizome","favorite_comments":"Sorry, I conflated your comment with the GP's. However, you two would appear to be agreeing.","fav_salty_score":"0.464"},{"Hacker_News_User":"dllthomas","favorite_comments":"As much as I approve of your sentiment, the way you phrased it forces me to respond: \"tell that to a kidnapping victim.\"  Anyone can, in principle, pose a threat to your freedom.","fav_salty_score":"-0.066"},{"Hacker_News_User":"stcredzero","favorite_comments":"...or the cafe, or the coworking space, or at your friend's house.  Since the call comes first, it's a fortuitous enhancement you sometimes add to an ordinary call.  Your way, you are either already sitting and working, or you had to plan ahead.  Big diffence.","fav_salty_score":"1.904"},{"Hacker_News_User":"joezydeco","favorite_comments":"I think the Google IPO was a bit unique where they kind of gave Wall Street the finger and said \"we'll do it  our way, thanks\".  They pissed off a lot of bankers but I don't think Sergey and Larry really cared. Haven't seen a situation or company like that since.","fav_salty_score":"2.456"},{"Hacker_News_User":"jgrahamc","favorite_comments":"Or when you are doing this use Safari's Private Browsing so that whatever cookies are added get removed automatically.","fav_salty_score":"-0.997"},{"Hacker_News_User":"Nursie","favorite_comments":"Awesome, between /b/, money launderers, the Silk Road, and its arms-dealing offshoot, bitcoin may have attracted the attention of all the scumbags on the internet!","fav_salty_score":"-0.995"},{"Hacker_News_User":"nandemo","favorite_comments":"The pace is a bit too fast but the talk is interesting. Makes me want to read his (upcoming) book.","fav_salty_score":"1.987"},{"Hacker_News_User":"GHFigs","favorite_comments":"You merely read a blog post about the study. The study itself is linked in the second paragraph.  Here:Link.","fav_salty_score":"2.8280000000000003"},{"Hacker_News_User":"rbanffy","favorite_comments":"I know all that, but you have to agree UEFI makes everybody put a lot of trust on a series of black boxes we cannot inspect. Even if we assume getting a set of signing keys requires more computing power than physically available, we cannot rely on it not being available through less compute-intensive ways.","fav_salty_score":"-1.932"},{"Hacker_News_User":"mechanical_fish","favorite_comments":"Do you think that PG  invented Lisp, or the software startup, or angel investing? Do you think that Linus Torvalds  invented Unix? Yes, Rails is the instantiation of a bunch of XP and Agile concepts. But here's the thing: concepts don't serve Web pages. Code serves Web pages. And even Martin Fowler doesn't take the time to write all his own code from scratch. I don't respect DHH because his ideas are original. I respect him because he can convince thousands of programmers around the world to  work together. That is not an easy trick - there's a  reason why it has been compared to herding cats.","fav_salty_score":"1.816"},{"Hacker_News_User":"ohashi","favorite_comments":"Considering you're asking them to build the whole product 8k seems fairly cheap.  Run some of the numbers: Let's say it takes 1 month to build an MVP with 2 people at a small firm. Programmer + (Programmer OR Designer) = 2 people 40hrs/week working on this to get it out the door. 2 (people) * 40 hrs * 4 (weeks)* X (hourly rate) = 8k 320 work hours * X = 8k X = $25/hr That's a pretty cheap rate in my mind.  Of course you can play with the numbers and expectations. You could always try a startup weekend or something to build an MVP with a team.","fav_salty_score":"1.7269999999999999"},{"Hacker_News_User":"tedunangst","favorite_comments":"When asked to say the letters of the English alphabet, I have never heard someone include é.","fav_salty_score":"0.999"},{"Hacker_News_User":"greenyoda","favorite_comments":"Earlier discussion: Link.","fav_salty_score":"0.9480000000000001"},{"Hacker_News_User":"danso","favorite_comments":"As someone who's teaching data-analysis-oriented classes, I peruse a lot of open syllabi...and this was one of the most well-organized and easy to read that I've found. I'm strongly hesitant to teach R...preferring Python because it's closer to languages that I'm used to, and for its general-purpose utility...but reading through these lessons, it's hard not to be awed by what R can do, particularly in visualization. This demonstration of using R to geocode (via the ggmap extension of ggplot2) was particularly cool (and also, as an example of the OP's organized notes, includes a copy of the data since the original link went dead): Link.","fav_salty_score":"1.237"},{"Hacker_News_User":"_delirium","favorite_comments":"For P/NP examples, I find SAT the easiest to explain to people not in CS. It's just: there are some things that can be true or false, and some statements about them using  and,  or, and  not. You want to find a set of T/F assignments that makes all those statements true. And it's intuitively obvious to people that it's much easier to check if an assignment is right than to find one.","fav_salty_score":"0.178"},{"Hacker_News_User":"Zigurd","favorite_comments":"What process takes place in your cranium that does not take place in a petri dish containing some of your brain cells?","fav_salty_score":"-0.999"},{"Hacker_News_User":"davidw","favorite_comments":"According to the ancient, unspoken rules of the Silicon Valley elders, this means that Bill will have to pass the Sacred Dagger of Evil to Steve in a secret ceremony with the sacrifice of a virgin.  Apple fans are already lining up by the hundreds, hoping to be the \"chosen one\".  Said one \"well, yeah, stabbed to death, but...hey, it's Apple!  The iDagger is so cool!\"","fav_salty_score":"0.402"},{"Hacker_News_User":"dredmorbius","favorite_comments":"Ah, I wasn't aware of that. Thanks.","fav_salty_score":"1.85"},{"Hacker_News_User":"derleth","favorite_comments":" but are too dumb to connect a USB cable and run adb. Or that would break the rules regarding  forensic data retrieval, and make the information gleaned in that fashion inadmissible as evidence.","fav_salty_score":"-1.9969999999999999"},{"Hacker_News_User":"pcwalton","favorite_comments":"This change improves consistency between implementations and modules. `impl MyType { … }` is now just like `mod my_module { … }`, except that you can define methods inside `impl` declarations by including a self parameter. For example: <pre><code>    struct MyType { … }    impl MyType { pub fn foo() { … } }    mod my_module { pub fn foo() { … } }    fn main() {        MyType::foo(); // works        my_module::foo(); // works too    }</code></pre>","fav_salty_score":"1.2730000000000001"},{"Hacker_News_User":"angersock","favorite_comments":" \"Sure, but that doesn't mean it works all the time, everywhere.\" ...which is a rather unsettling property in the foundation of your pyramid. I agree with your theory--I'm just sad to see that there isn't always a lot of that in practice. Hell, they almost killed off SPARC support on Debian a month ago because of developer ADD.","fav_salty_score":"-1.3860000000000001"},{"Hacker_News_User":"rbanffy","favorite_comments":"If you are the one building a product, then it makes sense using the PrimeSense thingie instead of a fully assembled Kinect. Asus should embrace the free drivers, BTW, and make whatever they build compatible with them. But that would, probably, have a very negative impact on their Windows OEM pricing...","fav_salty_score":"1.209"},{"Hacker_News_User":"skrebbel","favorite_comments":"It was just an example. You're completely doing the double standard thing the OP is going on about. PHP and C++ are very comparable in how much they nearly  encourage programmer mistakes, yet somehow in PHP it's the language's fault, and in C++ the programmer's just an idiot.","fav_salty_score":"0.8310000000000001"},{"Hacker_News_User":"dasil003","favorite_comments":"This attitude is why so few companies even come close to replicating the Apple experience.  It's not about \"what the device can do\", it's about elegance and design from end to end.  No one will ever make a Win tablet that can compare to the iPad because the applications will not target that specific device, they will always have a watered down UX.","fav_salty_score":"-0.626"},{"Hacker_News_User":"malandrew","favorite_comments":"Have you considered looking at what is available on Freecycle? A lot of people don't know about free cycle and some of the things available there may be useful for your goal.","fav_salty_score":"0.097"},{"Hacker_News_User":"downandout","favorite_comments":"If the software is automatically set to report that the provider has not received a warrant, then when it receives an order, it must undertake an action to tell the software  not to post that it hasn't received an order.  A judge would likely rule that this action is a violation of any confidentiality provisions, since the intent of the system is clearly laid out in advance.  It's no different than working out a specific hand signal in advance to notify someone of trouble - flashing that signal is a violation.","fav_salty_score":"-2.404"},{"Hacker_News_User":"girvo","favorite_comments":"Hy is neat. I love Lisps that \"compile\" or are embedable within host scripting languages. My favourite one to hack on (owing to my PHP ability) is Pharen[0]. Very neat little Lisp that compiles down to PHP, which is very fun to play with. I highly suggest giving Hy a go if you're a Pythonista, as you can learn a lot about programming in general by seeing how these sorts of languages map to the host. Very fun to hack on, too! [0]: Link.","fav_salty_score":"5.095"},{"Hacker_News_User":"tedunangst","favorite_comments":"I'm not sure what you're referring to. PowerPC? IBM wouldn't sell apple what they wanted, so apple bought from intel. If you don't like what apple is selling, you have the same choice: buy from some somebody else. Feel free to tell the world how much happier you are, too, if that's your thing.","fav_salty_score":"-0.856"},{"Hacker_News_User":"IgorPartola","favorite_comments":"Eek. Sorry, I disagree. IMHO, templating engines should not allow you to do much more than simple substitution, loops and escaping. I think Django strikes a very nice balance and learning to use it takes minutes. This is like saying that you should be allowed to use ASM in your Python code, as long as you promise never to actually do it.","fav_salty_score":"-0.915"},{"Hacker_News_User":"AnthonyMouse","favorite_comments":"I kind of doubt it. Most street thugs are not about to call up a lawyer and inquire about the penalties imposed on the crimes they intend to commit -- or about anything at all for that matter, because street thugs don't generally have \"hiring a lawyer ahead of time\" money. Potentially the ones in gangs will know from personal experience or the experience of their compatriots, but then you're right back into not expecting to be caught territory -- or else how can you explain the lack of deterrent effectiveness in reality? I mean just look at the evidence: Has increasing the penalties on drug crimes to insane levels deterred the bulk of the drug dealers from continuing to deal drugs? Obviously not.","fav_salty_score":"0.985"},{"Hacker_News_User":"bryanlarsen","favorite_comments":"You may complain about quarterly capitalism, but studies show that investors with a short time horizon do better than investors with a longer one. Link.","fav_salty_score":"0.338"},{"Hacker_News_User":"DanBC","favorite_comments":"Entomophagy - eating insects - provides cheap protien.  Would you be happy if you were forced to eat insects? I don't think you understand how ingrained some of these \"voluntary\" diets are; how strong taboo is. EDIT: also, forcing people to eat a certain diet is disproportionately punishng them.  Do we give those prisoners reductions in their sentence just because they were life-long vegans before they went to prison?","fav_salty_score":"-1.131"},{"Hacker_News_User":"corresation","favorite_comments":"I'm not sure what you think those links demonstrate: Do you suppose that someone makes a choice between a  cup of sugar syrup etc, or a cup of prepared rice (ergo, 75% water)? White rice is 90%+ very simple carbohydrates. It has a glycemic impact on your body extremely similar to straight sugar, from a gram to gram (of carbs) perspective. Now as the other poster mentioned there's the matter of fructose, though that is an area that has a little too much pseudo-science right now (it has become the new boogyman).","fav_salty_score":"1.83"},{"Hacker_News_User":"rbanffy","favorite_comments":"Cool. If I manage to find this Lisp, I have a couple real Apple IIs to play with it. I can even provide screenshots (either from an emulator or pictures from a CRT).","fav_salty_score":"-0.9500000000000001"},{"Hacker_News_User":"collyw","favorite_comments":"Distro packages are often a bit behind the official releases. I prefer to develop in the most recent version of a framework   library, as it generally makes things a bit more future proof.","fav_salty_score":"1.928"},{"Hacker_News_User":"icey","favorite_comments":"Part of their \"operation\" is that they are flagging tons of popular videos that have nothing wrong with them.","fav_salty_score":"0.686"},{"Hacker_News_User":"revelation","favorite_comments":"Your scenario isn't exactly what happened here. Rather, how would you feel if your friend asked you to link 10 Justin Bieber songs in your Python tutorial?","fav_salty_score":"-0.007"},{"Hacker_News_User":"acqq","favorite_comments":"I just had too look up the Greek words: hubris [ὕβρις] ‘outrage’; the opposite of dikē [δίκη] dikē [δίκη], plural dikai [δίκαι] ‘judgment (short-range); justice (long-range)’; dikaios[δίκαιος] ‘just’ atē [ἄτη], plural atai [ἆται] ‘aberration, derangement, veering off-course; disaster; punishment for disaster’ nemesis [νέμεσις] indicates the process whereby everyone gets what he or she deserves","fav_salty_score":"-0.9520000000000001"},{"Hacker_News_User":"corin_","favorite_comments":" \"One is that a flat tax is regressive meaning that it penalizes lower income earners by taxing them at the same rate as higher earners. But I think we are all coming to realize that the current system may be even more regressive since most wealthy people find ways to pay lower tax rates.\" So change the current system to prevent wealthy people from paying lower rates, don't just move the goalposts and call it a goal. The fact that more money often means you can pay lower tax rates doesn't mean those people shouldn't be paying higher tax rates, just that the current laws aren't doing a good enough job at getting them to pay higher rates.","fav_salty_score":"0.135"},{"Hacker_News_User":"taligent","favorite_comments":"I know what you mean. I only realised AFTER I had put in the all the effort to deploy my apps. Actually one of the best ways to go is to find dedicated hosting providers in the same data center. For example Server Beach is faster at accessing Amazon SQS than Amazon EC2 is.","fav_salty_score":"1.875"},{"Hacker_News_User":"ColinWright","favorite_comments":"Please change the title to give at least  some information as to what this is - thanks. ADDED IN EDIT: OK, you've changed it, but it still tells me  nothing about WTF this is.  Do you choose your variable names like this in your code? So unhelpful. &#60;/rant","fav_salty_score":"-0.991"},{"Hacker_News_User":"nailer","favorite_comments":"Faster and more automated than PXE: access the firmware directly over the network via SMASH / SSH and send commands to load an image which starts the OS. No manually accessing firmware to kick of PXE, so you can build a few hundred physical boxes in a second without too much effort. SMASH is vendor neutral, so it works across HP, Dell, IBM, and other vendors. If you're a decent frontend django programmer, and think we could make a business of this, get in touch. My contact details are in my profile.","fav_salty_score":"-0.706"},{"Hacker_News_User":"cbsmith","favorite_comments":"I think the three reasons entrepreneurs so often give the advise to just \"go do it\" is that a) the biggest barrier they faced to their own success was the psychological barrier to actually committing to taking the plunge and b) the key to their success was in taking an unconventional approach to at least some aspect of their business and c) they no doubt set off in a bunch wrong directions that had to be corrected, and the only way to learn that was to make those mistakes. The catch is that while by nature we are risk-averse, there is a degree of reflection that would definitely improve your chances of success. While big wins tend to require unconventional approaches, you can't just break rules at random: you need to understand the rules and the reasons behind them better than everyone else. Finally, mistakes are a key part of entrepreneurship, but learning from them is essential, and that second part is harder than successful  entrepreneurs appreciate (because to be successful, you've had to put together a pretty impressive track record of learning from mistakes). Experience is key to interpreting events to learn the  right lesson.","fav_salty_score":"0.643"},{"Hacker_News_User":"patio11","favorite_comments":"All creditors of Mt. Gox, including depositors, should file claims.  Gox will likely arrange a mass process for depositors and \"strongly encourage\" the use of it.  If you're not a depositor or you have a complex situation you should find a lawyer in Tokyo to walk you through the process, as I expect wheels failing to squeak may not get as greased as they'd like.","fav_salty_score":"-2.491"},{"Hacker_News_User":"angersock","favorite_comments":"Some entertaining bits from the article: \"How many Mac applications still support OS X 10.2? 10.3? 10.4?\" \"Then why should we be so conservative when it comes to C++, the very core of what we work with?\" \"C++11 is a much more productive language than C++98. We as an industry can, however, only reap that productivity gain if we stop throwing C++ productivity out of the window by the bucket-load in the hopeless pursuit of compatibility with non-standard implementations.\" I'm as much for iconoclasm as the next person, but this whole C++ madness is starting to make me worry. While the rest of us have been off in the trenches of maintenance and production, some cabal of academics and chuckleheads has been cooking up this monstrosity of a language, and now it is finally coming to a head. Folks, conservatism in software design is appreciated--in language design, essential. Python 3 is still not support by many useful libraries. Perl 5, over ten years later, is still in production and use. ECMA/Javascript is only now really taking off, after 15 years. And on the darker, even more depressing side of things, you've still F77 codes in \"production\" and  active maintenance--a friend of mine who is a graduate student is dealing with this right now. These are souls being fed to the gaping maw of legacy code. I'm sure C++ has some interesting features. I understand, for example, why the \"auto\" keyword is being given new meaning (because the syntax of the STL, classes, and templates is so mindnumbingly awful!). I understand why explicit defaulting and deleting of function might lead to cleaner code (regardless of, say, an explicit that already exists). I understand why I might want 3 different declensions of 'u' in front of a string to support various forms of Unicode (where is your liberalism about forcing everyone to using UTF-8 and being done with it?). I also understand that D probably has a better execution on these ideas than C++. And that Javascript and C# have a better implementation of lambdas and closures. And that for raw power and readability, C with embedded assembly (still!) can probably eat the lunch of any C++.(for an example of rational language evolution, see C1X: Link. ) And that C++ still doesn't have anything other than a crackheaded set of half-idioms for exporting classes for dynamic linking in a crossplatform way, or even for binding to another language! Go ask the poor bastard who wrote SWIG's comments on the same--he quit programming for several years to stop dealing with C++'s increasing garbage. I feel reasonable in saying this: C++ is not going away soon. One day (even sooner if you are in academic circles and dealing with libraries) we maintenance programmers are going to have to start dealing with code written to take advantage of the new features in C++11. And on that day, all of us will be wondering why the hell we are still using that katamari of language features, instead of something less baroque--perhaps Perl.","fav_salty_score":"-10.046"},{"Hacker_News_User":"tokenadult","favorite_comments":"I was fascinated by what they reported. I liked the comparison between my height and other measurements the site gives, including movement of tectonic plates. But I was disappointed that the site didn't report anything about longevity trends in our lifetimes, because those have been some of the most striking and unexpected trends of all. Many people posting here on Hacker News seem to think that health in general is declining around the world, but exactly the opposite is happening. Girls born since 2000 in the developed world are more likely than not to reach the age of 100, with boys likely to enjoy lifespans almost as long. The article \"The Biodemography of Human Ageing\" by James Vaupel,[1] originally published in the journal Nature in 2010, is a good current reference on the subject. Vaupel is one of the leading scholars on the demography of aging and how to adjust for time trends in life expectancy. His striking finding is \"Humans are living longer than ever before. In fact, newborn children in high-income countries can expect to live to more than 100 years. Starting in the mid-1800s, human longevity has increased dramatically and life expectancy is increasing by an average of six hours a day.\"[2] If I remember correctly, there was a previous Hacker News submission of an article in a series on Slate, \"Why Are You Not Dead Yet? Life expectancy doubled in past 150 years. Here’s why\"[3] That article gives a lot of background information about why mortality and morbidity are going down, and thus life expectancy is increasing at all ages. Life expectancy at age 40, at age 60, and at even higher ages is still rising throughout the both developed countries and the still developing countries of the world.[4] It's not just newborns and young children who have better life expectancies than ever before, but everyone in most countries. [1] Link. [2] Link. [3] Link. [4] Link.","fav_salty_score":"11.666"},{"Hacker_News_User":"rbanffy","favorite_comments":"Do you have numbers for other markets? I gather in some of them Symbian is still going strong.","fav_salty_score":"-0.485"},{"Hacker_News_User":"pjmlp","favorite_comments":"Try a games developer event instead, even some Macs will be running Windows.","fav_salty_score":"-0.803"},{"Hacker_News_User":"PeterisP","favorite_comments":"If you want a very bad car fire, then half of your current tank is plenty enough and even overkill.  Lots of gas can do much more - say, if a gas lorry spills under a concrete bridge, then the fire can do structural damage to that.","fav_salty_score":"-1.982"},{"Hacker_News_User":"pedalpete","favorite_comments":"I don't have any iOS devices, so I can't download it, but apparently at least one person has downloaded it, as their is a review on the apple store that says the app crashed and never worked on his iOS6 iPhone 4. As far as getting users, why are you coming to HN looking for users? You clearly read HN, you read about how to do PR and pitch, did you miss everything on how to find product market fit? Did you miss everything on research before building, or building MVP and getting friends to try your app? I don't think you app is a bad idea, but it isn't something I'm going to jump on until I know other people are using it. If nobody is using it, their are no anon 'broadcasts' to be shared. You have a classic chicken-egg problem. Nobody is using your app, so their (likely) isn't any content their which is making people interested in viewing that content. This is part of the problem with anon apps, where people can't try before installing. There is no point in me telling a friend, hey download this app because I'm in it, because... if I'm anonymous, they aren't going to see who I am anyway. What is your pitch to your friends as to why they should use this app? What do they say. Get 5 people you know to install and use it, then adjust based on feedback.","fav_salty_score":"-0.003"},{"Hacker_News_User":"anigbrowl","favorite_comments":"By the way here is the cartoon I mentioned above. I mis-remembered; it wasn't Greeley's funeral exactly, but suggesting he was near death. Greeley had run as a quixotic Democratic candidate in the 1872 election against President Ulysses S. Grant and his continued occupation of the South during the reconstruction period following the civil war. Greeley did poorly in the election, and this cartoon in  Harper's Weekly, a strongly Republican magazine at that time, mocked his crusading style and suggested his campaign had no life left in it. Link. This is considered an especially cruel editorial cartoon, because Greeley's wife died immediately after the election; Greeley then went mad, and died a few weeks later at the end of November. He had suffered terrible financial losses by being caught in an investment scam earlier that year, and had lost control of his newspaper to another New York publisher, Whitelaw Reid, who fired him. I happened to be reading about these events just before the News International scandal blew up. Technology has changed a lot, human nature not so much.","fav_salty_score":"2.296"},{"Hacker_News_User":"IgorPartola","favorite_comments":"Exactly. BSD/MIT/Apache != Public Domain.","fav_salty_score":"0.245"},{"Hacker_News_User":"billswift","favorite_comments":"I have a two and a half year old AthlonX2 with only 256 MB RAM and have no problems with it.  Plus I am on dial-up, and this loads  much faster than Flash.","fav_salty_score":"0.304"},{"Hacker_News_User":"EGreg","favorite_comments":"Everything except shorting their stock. If you wrote a hard-hitting exposé or a John Stossel-type broadcast you aren't likely to be branded a terrorist. Make sure you don't reveal how it's actually done, but the fact that it can be. In short - media showing the potential results (and dramatizing them) puts heat on the company to fix it.","fav_salty_score":"0.323"},{"Hacker_News_User":"ZeroGravitas","favorite_comments":"That's one of the mental traps of the term \"Intellectual Property\", it doesn't protect what you own, it only allows you to stop other people from doing things (and therefor charge them in order to get your permision). But other people can use the same mechanism to stop you doing things with your own \"property\". That's why the asymmetric warfare of patent trolls works so well, they don't actually do anything you can interfere with via your IP.","fav_salty_score":"0.356"},{"Hacker_News_User":"sillysaurus3","favorite_comments":" It's like those commenting \"that skyscraper is garbage\" by someone who doesn't even know what you'd need to build a skyscraper, let alone actually tried to build one. It's nothing like that at all.  A piece of code's popularity is no evidence of its quality.  Otherwise we'd never have advanced beyond BASIC. Implementing an entire spec is nothing to be proud of.  Specs are often over-engineered.  This is almost certainly the case for TLS.  It's 103 pages long: Link. We should be questioning the foundations we've been relying on until now when a single vulnerability was able to compromise most of the internet, possibly since 2011.","fav_salty_score":"3.842"},{"Hacker_News_User":"mturmon","favorite_comments":"...who defines what... Exactly.  That's the whole problem with the sweeping statements here.  It's good we have different cities with different styles and sensibilities.  And it's usually silly to say one is \"best.\"","fav_salty_score":"1.185"},{"Hacker_News_User":"danielweber","favorite_comments":" I'd like to see something like parity for wages doing the same work anywhere on the planet I'd like a pony. Saying, in the year 2015, that wages should be the same anywhere on the planet is telling poor countries with no infrastructure \"fuck you, got mine.\"  Because the only reason someone opens a factory in Cambodia or China instead of South Carolina is  because of the low wages.  That is those countries' competitive advantage. If a worker in Cambodia costs $10 an hour and a worker in America costs $10 an hour, there is  no reason to build a factory in Cambodia.  They have poorer infrastructure, little to no respect for IP, and the stuff is now a world away from its customers.","fav_salty_score":"-1.562"},{"Hacker_News_User":"loewenskind","favorite_comments":"All first world countries (and probably most developing countries) have a minimum wage, yet all the \"homeless person found dead from ...\" are from the US.  In Western Europe most of the the \"homeless\" I see are actually bussed in from eastern Europe to pan handle.","fav_salty_score":"1.393"},{"Hacker_News_User":"gojomo","favorite_comments":"The article devotes just 3 sentences, in a short aside, to the idea that kidney sales could be encouraged, in an orderly and fair manner, rather than prohibited. (It's the prohibition which creates black market profits and kills thousands waiting for kidneys.) For more on this possibility: Link. Link. Virginia Postrel, a former editor of  Reason who actually donated one of her kidneys to a friend, has also written about donor chains and compensation: Link.","fav_salty_score":"0.981"},{"Hacker_News_User":"pyre","favorite_comments":"Blockbuster still had profitable locations, IIRC. It was the company as a whole that was collapsing. I assume that those locations are probably still profitable now, though maybe not as much as at its apex.","fav_salty_score":"2.133"},{"Hacker_News_User":"dkarl","favorite_comments":"Sounds like common sense to me, but believe it or not, some people disagree.   Check out some dissenting opinions from the article: \"A class I took in 2007 taught how to create a website with tables. I found out this year that they are finally teaching table free websites. Being a few years behind is definitely not smart, especially when you're paying so much to learn this information.\"  (If you think the point of paying tens of thousands of dollars per year for college is to acquire knowledge whose shelf life is shorter than the time you spend there, then it's no wonder you think it's a bad idea.) \"[Students] don't know, yet, that they need to be constantly monitoring blogs and twitter for the latest information on the industry.\"  (Methinks this person is confused about what \"web development\" is, thinking it means self-promotion and getting blog traffic rather than developing good web sites.) \"I think I learned more on my co-op at the time on web development then I learned in the class room. Only the concepts were relevant in the classroom - the languages and the techniques weren't.\"  (Silly colleges teaching concepts instead of specific technologies!) It's funny how so many web developers think that having the latest technology is absolutely required, instead of thinking about the costs and benefits of staying up to date.  The only aspect of web development where fashion is a driver is UI design.  Cutting-edge UI design sometimes (not always) requires cutting-edge UI implementation technologies.  For the rest, hell, every site has its own needs, and your site's needs might have been technologically solved years ago.  I think these kids could benefit from taking a calculus class and realizing that the concepts and the notation are older than their parents (hah, didn't know there  was anything that old, did ya?)","fav_salty_score":"4.547"},{"Hacker_News_User":"logn","favorite_comments":"I think that given the revelations of parallel reconstruction in general, the burden should be on the prosecution to prove that the NSA et al. were not involved. An illegal search seizure could very well have been what gave the FBI the idea to find the IP address in this way. Given that the NSA is able to collect most internet traffic, and they've been sharing info with other agencies, I would think that most evidence against any defendant could be thrown out. Yes, that would be ludicrous, and that's exactly why the NSA needs to be reformed.","fav_salty_score":"0.218"},{"Hacker_News_User":"dfc","favorite_comments":"I think you meant less than half? War is horrible. There is plenty of horror to go around, from every war. But I do not think that an abundance of horror means that we should do away with the desire for accuracy.","fav_salty_score":"-0.04"},{"Hacker_News_User":"pohl","favorite_comments":"Happy 15th birthday from user #872.  Back when Rob Malda started you, it was such a thrill to read the posts of far-flung techies whose interests went beyond what the real \"tech news\" press was covering.  It's almost painful to go back now and read what has become of you.  There are only so many racist trolls one can encounter before it ruins the whole experience.","fav_salty_score":"3.739"},{"Hacker_News_User":"gwern","favorite_comments":"This was heavily criticized back when it came out, and the criticisms struck me as valid and the paper not useful.","fav_salty_score":"0.985"},{"Hacker_News_User":"ars","favorite_comments":"I read the full quote and it's wrong. Period. If \"interchangeable code\" was the standard then why apply it only to prior art? Why not apply it to future art as well? (Samsungs implementation.) It looks like this jury just made stuff up. And I really hope the judgment gets completely tossed for this. The judge has yet to rule on that (although it's rare to toss a jury verdict since they actually are allowed to make stuff up to some degree - lookup Jury nullification, so I'm not really expecting it to be tossed).","fav_salty_score":"-1.557"},{"Hacker_News_User":"ivankirigin","favorite_comments":"Like Paris Hilton, Aaron does seem to spawn lots of useless, uninteresting discussion in other people. That probably is less his fault and more the fault of people like qwertyy.","fav_salty_score":"-1.528"},{"Hacker_News_User":"gaius","favorite_comments":" They can tax stuff to discourage it, or adjust interest rates. Or borrow and spend, which ought to drive up inflation, but require the BoE to keep inflation low, by artificially holding interest rates low making money too cheap and risk impossible to assess. I say it again: if you are bank A and you won't lend at a low rate and banks B, C and D do then A goes out of business when its customers desert it for doing the \"right thing\" and the situation is unchanged. The alternative is for A, B, C and D to get together and fix interest rates (prices) themselves, at which point their CEOs are looking at jail time. The banks are merely scapegoats for the politicians. And you've fallen for it hook, line and sinker. What would I like the government to do instead? It can start by paying off the deficit...","fav_salty_score":"-3.6189999999999998"},{"Hacker_News_User":"marshray","favorite_comments":"Why should Intel accept a patch that's only ever going to be useful for one distro? Wouldn't it be better for everyone if the distro would just manage those patches itself?","fav_salty_score":"-1.9969999999999999"},{"Hacker_News_User":"pcwalton","favorite_comments":"Yammer definitely does have traction. It may well be that the author didn't use Yammer at the two companies he worked at, but Microsoft wouldn't have paid a billion dollars for a company without traction.","fav_salty_score":"1.97"},{"Hacker_News_User":"pjc50","favorite_comments":"All sorts of parts can be surprisingly hard to find. I've been working on a radio product where the 16-way channel selector switch had to be specially ordered from China, while everything else came from Digikey.","fav_salty_score":"-0.357"},{"Hacker_News_User":"melling","favorite_comments":"Can someone discuss the pros of Fedora?  I'm mainly a Mac user these days but my Fedora 9 box is still running in the corner on a very old box.  I promised myself I'd get a beefy 8-core Intel Ivy bridge system next year.  I assume all my \"build notes\" with all my yum installs still work.  All I ever hear about is Ubuntu.","fav_salty_score":"0.792"},{"Hacker_News_User":"jacquesm","favorite_comments":"I'm sorry, I don't see your point. Could you elaborate?","fav_salty_score":"1.611"},{"Hacker_News_User":"marknutter","favorite_comments":"The vast majority of these apps are brochureware that wouldn't function properly without an internet connection.","fav_salty_score":"0.9580000000000001"},{"Hacker_News_User":"ahoyhere","favorite_comments":"Palm has never been as cool as Apple. Palm hardware has always been \"organization pr0n,\" which only appeals to a small subset. The iPhone is seen as cool; it is the most desirable phone. People are bending over backwards to afford one (the most iPhone growth over the past 2 quarters has been in low-middle and low class income groups). Apple paved the way with iPods. I think Palm will have a very hard time selling the Pre to people outside the geeky / careering groups where orgpr0n still appeals. Even if the user experience is better, the market hasn't been conditioned fr it.","fav_salty_score":"3.147"},{"Hacker_News_User":"tlrobinson","favorite_comments":"My brain  knows it's the middle of December, but I had to check to make sure it wasn't April 1st. This is  exactly the type of headline we see every year on April 1st. Crazy that it's real.","fav_salty_score":"1.283"},{"Hacker_News_User":"rayiner","favorite_comments":"So a Chapter 15 is an ancillary proceeding to facilitate the bankruptcy of a foreign corporation that is happening in another jurisdiction (in this case, Japan). Venue in a Chapter 15 is appropriate either where the company its principal U.S. assets, or where it is getting sued in the U.S. See: Link.. I believe the only lawsuit right now is in Chicago (NDIL), so presumably they filed in Dallas because they had some assets there (servers, etc)?","fav_salty_score":"-2.8200000000000003"}]