[{"Hacker_News_User":"JoeAltmaier","favorite_comments":"So now I do the legwork for articles, instead of the author?  Great!  \"All Minnesotans are stupider than Iowans!  Look it up!\" Apps may not really be relevant to market grows, but they would be relevant to the article subject, \"Welcome back, Nokia\". Are they back? Is anybody writing apps for their phone?  Why would I want one?  All reasonable questions, revolving around apps.","fav_salty_score":"0.735"},{"Hacker_News_User":"pessimizer","favorite_comments":"Even more clarification: never talk to police. Give your name, ask for a lawyer. I'm sure there's a few lawyers out there who think that even giving your name is too much of a risk.","fav_salty_score":"2.594"},{"Hacker_News_User":"pessimizer","favorite_comments":"SSRIs are also like  placebos in that they have no more of an effect than placebo.","fav_salty_score":"0.581"},{"Hacker_News_User":"ivankirigin","favorite_comments":"He's saying it has been done.","fav_salty_score":"0.997"},{"Hacker_News_User":"__david__","favorite_comments":" It looks like you would have to implement USB on top of PCIe in the monitor, though. Isn't that basically UHCI?","fav_salty_score":"-1.9729999999999999"},{"Hacker_News_User":"arethuza","favorite_comments":"I don't think there is much of a market for a \"Wish you a quick painless death in the forthcoming nuclear war\" card. :-|","fav_salty_score":"0.182"},{"Hacker_News_User":"x0x0","favorite_comments":"hmm; if you're such an ai company, i'd love to hear from you so please post =P","fav_salty_score":"0.93"},{"Hacker_News_User":"danieldk","favorite_comments":"Then you need an algebraic data type having nil is one of its constructors, and that function returning that type. AFAIK, Rust doesn't have nil. So, the closest thing is using the option type.","fav_salty_score":"1.015"},{"Hacker_News_User":"benatkin","favorite_comments":"Link.","fav_salty_score":"0.9570000000000001"},{"Hacker_News_User":"rdl","favorite_comments":"I believe they use ultradns (a nice, but very expensive, dns service).","fav_salty_score":"0.976"},{"Hacker_News_User":"krapp","favorite_comments":"I really wish this thread would've gotten more attention... But anyway, I wonder if this bias could be managed not making karma scores or vote counts public. The cumulative effect of votes could still be used to sort the list and everything, but I think seeing the actual number there is what leads to users, consciously or not, turning it into a points game. Really what should matter is judging a post on its own merit and whether its been marked down or not.","fav_salty_score":"-2.284"},{"Hacker_News_User":"pbhjpbhj","favorite_comments":"There's a general principle of prior use as an absolute defence in trademark law - though it wouldn't surprise me to much to find that USA had violated that principle. Candy is too generic in both the software field and the game field to be a distinctive mark and so shouldn't be granted as a word mark; trademark examiner fail. I mean come on. Link. from 2011. Link. from 2008. Link. from 2011; almost an exact match for Candy Crush from King.com Limited. \"Candy\" thus would confuse people as to the origin because of this lack of distinctiveness and widespread prior use in games and in apps. The dates for these prior uses are from Google and hence can't be relied on but better dates could be acquired. This search took 5 minutes at most.","fav_salty_score":"-1.367"},{"Hacker_News_User":"rayiner","favorite_comments":"Auditors would be a lot cheaper than opening prosecutors to civil liability. The basic problem is that you'd be putting a powerful retaliatory tool in the hands of a group of people (convicts) who are: 1) very likely guilty; 2) have all the time in the world; and 3) can't effectively be sanctioned for filing meritless litigation. People justify opening prosecutors to civil liability by saying that \"they need to be held accountable.\" But prosecutors are already accountable. Their actions take place on public record. They have to justify themselves to defense counsel, a judge, and possibly a jury and an appellate panel. On top of all that, their immunity does not protect them from suits alleging bad faith.","fav_salty_score":"0.665"},{"Hacker_News_User":"_delirium","favorite_comments":"In particular, my impression is that outside of technical majors (CS, math, sciences, and engineering) the classic liberal-arts degrees can often be more valuable than one tied to the particular job. I've heard lots of places hiring for nominally \"business\" type jobs actually skeptical of people with BAs in Business, for example.","fav_salty_score":"1.816"},{"Hacker_News_User":"pnathan","favorite_comments":"Imagine the surveillance endemic to the system.","fav_salty_score":"0.72"},{"Hacker_News_User":"michaelochurch","favorite_comments":"It depends what the person's using the language for. I'd say \"no\" for C. C is still the leading language for a lot of purposes: operating systems, runtimes for higher-level languages, device drivers, and applications where tight control of memory use is important. In these domains, C hasn't been supplanted yet-- not even close. I don't know that C++ and Java have substantial domains in which they're superior to other choices. C++ is a badly-conceived cross between C and high-level languages and Java is the worst of the JVM languages.","fav_salty_score":"-0.068"},{"Hacker_News_User":"derleth","favorite_comments":"And if wishes were horses beggars would finally have some meat. How likely is any of that?","fav_salty_score":"0.002"},{"Hacker_News_User":"nkassis","favorite_comments":"Depends it's useful to know exactly how much it will be, sometimes it's not a big deal but it can make a big difference when there are large swings in exchange rates. I personally much prefer knowing exactly what I will pay.","fav_salty_score":"1.272"},{"Hacker_News_User":"RyanZAG","favorite_comments":"While South Africa does have broadband access, most people sit on sub 3GB caps. The actual broadband penetration is also low - 2% for fixed line, and 11% for mobile access. The mobile broadband (3g) is metered per mb and frequently drops down to edge. It is improving, but as with the rest of the developing world, if you want to actually target most users you need to use SMS or very basic html sites that can work on older S40 Nokia phones and blackberries. Obviously a fancy desktop sized page that relies on java script is just completely out.","fav_salty_score":"-0.632"},{"Hacker_News_User":"keithpeter","favorite_comments":" \"Now both of those barriers have been removed\" ...in some places in the world, but not others. Will MS change their defaults by territory does anyone know?","fav_salty_score":"0.023"},{"Hacker_News_User":"Kiro","favorite_comments":"The only rewrite rule you need is one to direct all requests to index.php. Then you just parse the URL in PHP to achieve /blog/title-of-the-article. What is the problem with this approach?","fav_salty_score":"-0.873"},{"Hacker_News_User":"jessaustin","favorite_comments":"Zaxxon! That's a blast from the past, and the only reason I ever knew for someone to be jealous of a ColecoVision.","fav_salty_score":"0.149"},{"Hacker_News_User":"nollidge","favorite_comments":"It's got nothing to do with grammar. \"I could care less\" is a perfectly grammatical sentence - it follows all the rules of English sentence construction. Similarly, \"colorless green ideas sleep furiously\" is also perfectly grammatical, it just doesn't make any semantic sense.","fav_salty_score":"0.643"},{"Hacker_News_User":"rhizome","favorite_comments":"Sorry, I conflated your comment with the GP's. However, you two would appear to be agreeing.","fav_salty_score":"0.464"},{"Hacker_News_User":"dllthomas","favorite_comments":"As much as I approve of your sentiment, the way you phrased it forces me to respond: \"tell that to a kidnapping victim.\"  Anyone can, in principle, pose a threat to your freedom.","fav_salty_score":"-0.066"},{"Hacker_News_User":"stcredzero","favorite_comments":"...or the cafe, or the coworking space, or at your friend's house.  Since the call comes first, it's a fortuitous enhancement you sometimes add to an ordinary call.  Your way, you are either already sitting and working, or you had to plan ahead.  Big diffence.","fav_salty_score":"1.904"},{"Hacker_News_User":"joezydeco","favorite_comments":"I think the Google IPO was a bit unique where they kind of gave Wall Street the finger and said \"we'll do it  our way, thanks\".  They pissed off a lot of bankers but I don't think Sergey and Larry really cared. Haven't seen a situation or company like that since.","fav_salty_score":"2.456"},{"Hacker_News_User":"jgrahamc","favorite_comments":"Or when you are doing this use Safari's Private Browsing so that whatever cookies are added get removed automatically.","fav_salty_score":"-0.997"},{"Hacker_News_User":"Nursie","favorite_comments":"Awesome, between /b/, money launderers, the Silk Road, and its arms-dealing offshoot, bitcoin may have attracted the attention of all the scumbags on the internet!","fav_salty_score":"-0.995"},{"Hacker_News_User":"nandemo","favorite_comments":"The pace is a bit too fast but the talk is interesting. Makes me want to read his (upcoming) book.","fav_salty_score":"1.987"},{"Hacker_News_User":"GHFigs","favorite_comments":"You merely read a blog post about the study. The study itself is linked in the second paragraph.  Here:Link.","fav_salty_score":"2.8280000000000003"},{"Hacker_News_User":"rbanffy","favorite_comments":"I know all that, but you have to agree UEFI makes everybody put a lot of trust on a series of black boxes we cannot inspect. Even if we assume getting a set of signing keys requires more computing power than physically available, we cannot rely on it not being available through less compute-intensive ways.","fav_salty_score":"-1.932"},{"Hacker_News_User":"mechanical_fish","favorite_comments":"Do you think that PG  invented Lisp, or the software startup, or angel investing? Do you think that Linus Torvalds  invented Unix? Yes, Rails is the instantiation of a bunch of XP and Agile concepts. But here's the thing: concepts don't serve Web pages. Code serves Web pages. And even Martin Fowler doesn't take the time to write all his own code from scratch. I don't respect DHH because his ideas are original. I respect him because he can convince thousands of programmers around the world to  work together. That is not an easy trick - there's a  reason why it has been compared to herding cats.","fav_salty_score":"1.816"},{"Hacker_News_User":"ohashi","favorite_comments":"Considering you're asking them to build the whole product 8k seems fairly cheap.  Run some of the numbers: Let's say it takes 1 month to build an MVP with 2 people at a small firm. Programmer + (Programmer OR Designer) = 2 people 40hrs/week working on this to get it out the door. 2 (people) * 40 hrs * 4 (weeks)* X (hourly rate) = 8k 320 work hours * X = 8k X = $25/hr That's a pretty cheap rate in my mind.  Of course you can play with the numbers and expectations. You could always try a startup weekend or something to build an MVP with a team.","fav_salty_score":"1.7269999999999999"},{"Hacker_News_User":"tedunangst","favorite_comments":"When asked to say the letters of the English alphabet, I have never heard someone include é.","fav_salty_score":"0.999"},{"Hacker_News_User":"greenyoda","favorite_comments":"Earlier discussion: Link.","fav_salty_score":"0.9480000000000001"},{"Hacker_News_User":"danso","favorite_comments":"As someone who's teaching data-analysis-oriented classes, I peruse a lot of open syllabi...and this was one of the most well-organized and easy to read that I've found. I'm strongly hesitant to teach R...preferring Python because it's closer to languages that I'm used to, and for its general-purpose utility...but reading through these lessons, it's hard not to be awed by what R can do, particularly in visualization. This demonstration of using R to geocode (via the ggmap extension of ggplot2) was particularly cool (and also, as an example of the OP's organized notes, includes a copy of the data since the original link went dead): Link.","fav_salty_score":"1.237"},{"Hacker_News_User":"_delirium","favorite_comments":"For P/NP examples, I find SAT the easiest to explain to people not in CS. It's just: there are some things that can be true or false, and some statements about them using  and,  or, and  not. You want to find a set of T/F assignments that makes all those statements true. And it's intuitively obvious to people that it's much easier to check if an assignment is right than to find one.","fav_salty_score":"0.178"},{"Hacker_News_User":"Zigurd","favorite_comments":"What process takes place in your cranium that does not take place in a petri dish containing some of your brain cells?","fav_salty_score":"-0.999"},{"Hacker_News_User":"davidw","favorite_comments":"According to the ancient, unspoken rules of the Silicon Valley elders, this means that Bill will have to pass the Sacred Dagger of Evil to Steve in a secret ceremony with the sacrifice of a virgin.  Apple fans are already lining up by the hundreds, hoping to be the \"chosen one\".  Said one \"well, yeah, stabbed to death, but...hey, it's Apple!  The iDagger is so cool!\"","fav_salty_score":"0.402"},{"Hacker_News_User":"dredmorbius","favorite_comments":"Ah, I wasn't aware of that. Thanks.","fav_salty_score":"1.85"},{"Hacker_News_User":"derleth","favorite_comments":" but are too dumb to connect a USB cable and run adb. Or that would break the rules regarding  forensic data retrieval, and make the information gleaned in that fashion inadmissible as evidence.","fav_salty_score":"-1.9969999999999999"},{"Hacker_News_User":"pcwalton","favorite_comments":"This change improves consistency between implementations and modules. `impl MyType { … }` is now just like `mod my_module { … }`, except that you can define methods inside `impl` declarations by including a self parameter. For example: <pre><code>    struct MyType { … }    impl MyType { pub fn foo() { … } }    mod my_module { pub fn foo() { … } }    fn main() {        MyType::foo(); // works        my_module::foo(); // works too    }</code></pre>","fav_salty_score":"1.2730000000000001"},{"Hacker_News_User":"angersock","favorite_comments":" \"Sure, but that doesn't mean it works all the time, everywhere.\" ...which is a rather unsettling property in the foundation of your pyramid. I agree with your theory--I'm just sad to see that there isn't always a lot of that in practice. Hell, they almost killed off SPARC support on Debian a month ago because of developer ADD.","fav_salty_score":"-1.3860000000000001"},{"Hacker_News_User":"rbanffy","favorite_comments":"If you are the one building a product, then it makes sense using the PrimeSense thingie instead of a fully assembled Kinect. Asus should embrace the free drivers, BTW, and make whatever they build compatible with them. But that would, probably, have a very negative impact on their Windows OEM pricing...","fav_salty_score":"1.209"},{"Hacker_News_User":"skrebbel","favorite_comments":"It was just an example. You're completely doing the double standard thing the OP is going on about. PHP and C++ are very comparable in how much they nearly  encourage programmer mistakes, yet somehow in PHP it's the language's fault, and in C++ the programmer's just an idiot.","fav_salty_score":"0.8310000000000001"},{"Hacker_News_User":"dasil003","favorite_comments":"This attitude is why so few companies even come close to replicating the Apple experience.  It's not about \"what the device can do\", it's about elegance and design from end to end.  No one will ever make a Win tablet that can compare to the iPad because the applications will not target that specific device, they will always have a watered down UX.","fav_salty_score":"-0.626"},{"Hacker_News_User":"malandrew","favorite_comments":"Have you considered looking at what is available on Freecycle? A lot of people don't know about free cycle and some of the things available there may be useful for your goal.","fav_salty_score":"0.097"},{"Hacker_News_User":"downandout","favorite_comments":"If the software is automatically set to report that the provider has not received a warrant, then when it receives an order, it must undertake an action to tell the software  not to post that it hasn't received an order.  A judge would likely rule that this action is a violation of any confidentiality provisions, since the intent of the system is clearly laid out in advance.  It's no different than working out a specific hand signal in advance to notify someone of trouble - flashing that signal is a violation.","fav_salty_score":"-2.404"},{"Hacker_News_User":"girvo","favorite_comments":"Hy is neat. I love Lisps that \"compile\" or are embedable within host scripting languages. My favourite one to hack on (owing to my PHP ability) is Pharen[0]. Very neat little Lisp that compiles down to PHP, which is very fun to play with. I highly suggest giving Hy a go if you're a Pythonista, as you can learn a lot about programming in general by seeing how these sorts of languages map to the host. Very fun to hack on, too! [0]: Link.","fav_salty_score":"5.095"},{"Hacker_News_User":"tedunangst","favorite_comments":"I'm not sure what you're referring to. PowerPC? IBM wouldn't sell apple what they wanted, so apple bought from intel. If you don't like what apple is selling, you have the same choice: buy from some somebody else. Feel free to tell the world how much happier you are, too, if that's your thing.","fav_salty_score":"-0.856"},{"Hacker_News_User":"IgorPartola","favorite_comments":"Eek. Sorry, I disagree. IMHO, templating engines should not allow you to do much more than simple substitution, loops and escaping. I think Django strikes a very nice balance and learning to use it takes minutes. This is like saying that you should be allowed to use ASM in your Python code, as long as you promise never to actually do it.","fav_salty_score":"-0.915"},{"Hacker_News_User":"AnthonyMouse","favorite_comments":"I kind of doubt it. Most street thugs are not about to call up a lawyer and inquire about the penalties imposed on the crimes they intend to commit -- or about anything at all for that matter, because street thugs don't generally have \"hiring a lawyer ahead of time\" money. Potentially the ones in gangs will know from personal experience or the experience of their compatriots, but then you're right back into not expecting to be caught territory -- or else how can you explain the lack of deterrent effectiveness in reality? I mean just look at the evidence: Has increasing the penalties on drug crimes to insane levels deterred the bulk of the drug dealers from continuing to deal drugs? Obviously not.","fav_salty_score":"0.985"},{"Hacker_News_User":"bryanlarsen","favorite_comments":"You may complain about quarterly capitalism, but studies show that investors with a short time horizon do better than investors with a longer one. Link.","fav_salty_score":"0.338"},{"Hacker_News_User":"DanBC","favorite_comments":"Entomophagy - eating insects - provides cheap protien.  Would you be happy if you were forced to eat insects? I don't think you understand how ingrained some of these \"voluntary\" diets are; how strong taboo is. EDIT: also, forcing people to eat a certain diet is disproportionately punishng them.  Do we give those prisoners reductions in their sentence just because they were life-long vegans before they went to prison?","fav_salty_score":"-1.131"},{"Hacker_News_User":"corresation","favorite_comments":"I'm not sure what you think those links demonstrate: Do you suppose that someone makes a choice between a  cup of sugar syrup etc, or a cup of prepared rice (ergo, 75% water)? White rice is 90%+ very simple carbohydrates. It has a glycemic impact on your body extremely similar to straight sugar, from a gram to gram (of carbs) perspective. Now as the other poster mentioned there's the matter of fructose, though that is an area that has a little too much pseudo-science right now (it has become the new boogyman).","fav_salty_score":"1.83"},{"Hacker_News_User":"rbanffy","favorite_comments":"Cool. If I manage to find this Lisp, I have a couple real Apple IIs to play with it. I can even provide screenshots (either from an emulator or pictures from a CRT).","fav_salty_score":"-0.9500000000000001"},{"Hacker_News_User":"collyw","favorite_comments":"Distro packages are often a bit behind the official releases. I prefer to develop in the most recent version of a framework   library, as it generally makes things a bit more future proof.","fav_salty_score":"1.928"},{"Hacker_News_User":"icey","favorite_comments":"Part of their \"operation\" is that they are flagging tons of popular videos that have nothing wrong with them.","fav_salty_score":"0.686"},{"Hacker_News_User":"revelation","favorite_comments":"Your scenario isn't exactly what happened here. Rather, how would you feel if your friend asked you to link 10 Justin Bieber songs in your Python tutorial?","fav_salty_score":"-0.007"},{"Hacker_News_User":"acqq","favorite_comments":"I just had too look up the Greek words: hubris [ὕβρις] ‘outrage’; the opposite of dikē [δίκη] dikē [δίκη], plural dikai [δίκαι] ‘judgment (short-range); justice (long-range)’; dikaios[δίκαιος] ‘just’ atē [ἄτη], plural atai [ἆται] ‘aberration, derangement, veering off-course; disaster; punishment for disaster’ nemesis [νέμεσις] indicates the process whereby everyone gets what he or she deserves","fav_salty_score":"-0.9520000000000001"},{"Hacker_News_User":"corin_","favorite_comments":" \"One is that a flat tax is regressive meaning that it penalizes lower income earners by taxing them at the same rate as higher earners. But I think we are all coming to realize that the current system may be even more regressive since most wealthy people find ways to pay lower tax rates.\" So change the current system to prevent wealthy people from paying lower rates, don't just move the goalposts and call it a goal. The fact that more money often means you can pay lower tax rates doesn't mean those people shouldn't be paying higher tax rates, just that the current laws aren't doing a good enough job at getting them to pay higher rates.","fav_salty_score":"0.135"},{"Hacker_News_User":"taligent","favorite_comments":"I know what you mean. I only realised AFTER I had put in the all the effort to deploy my apps. Actually one of the best ways to go is to find dedicated hosting providers in the same data center. For example Server Beach is faster at accessing Amazon SQS than Amazon EC2 is.","fav_salty_score":"1.875"},{"Hacker_News_User":"ColinWright","favorite_comments":"Please change the title to give at least  some information as to what this is - thanks. ADDED IN EDIT: OK, you've changed it, but it still tells me  nothing about WTF this is.  Do you choose your variable names like this in your code? So unhelpful. &#60;/rant","fav_salty_score":"-0.991"},{"Hacker_News_User":"nailer","favorite_comments":"Faster and more automated than PXE: access the firmware directly over the network via SMASH / SSH and send commands to load an image which starts the OS. No manually accessing firmware to kick of PXE, so you can build a few hundred physical boxes in a second without too much effort. SMASH is vendor neutral, so it works across HP, Dell, IBM, and other vendors. If you're a decent frontend django programmer, and think we could make a business of this, get in touch. My contact details are in my profile.","fav_salty_score":"-0.706"},{"Hacker_News_User":"cbsmith","favorite_comments":"I think the three reasons entrepreneurs so often give the advise to just \"go do it\" is that a) the biggest barrier they faced to their own success was the psychological barrier to actually committing to taking the plunge and b) the key to their success was in taking an unconventional approach to at least some aspect of their business and c) they no doubt set off in a bunch wrong directions that had to be corrected, and the only way to learn that was to make those mistakes. The catch is that while by nature we are risk-averse, there is a degree of reflection that would definitely improve your chances of success. While big wins tend to require unconventional approaches, you can't just break rules at random: you need to understand the rules and the reasons behind them better than everyone else. Finally, mistakes are a key part of entrepreneurship, but learning from them is essential, and that second part is harder than successful  entrepreneurs appreciate (because to be successful, you've had to put together a pretty impressive track record of learning from mistakes). Experience is key to interpreting events to learn the  right lesson.","fav_salty_score":"0.643"},{"Hacker_News_User":"patio11","favorite_comments":"All creditors of Mt. Gox, including depositors, should file claims.  Gox will likely arrange a mass process for depositors and \"strongly encourage\" the use of it.  If you're not a depositor or you have a complex situation you should find a lawyer in Tokyo to walk you through the process, as I expect wheels failing to squeak may not get as greased as they'd like.","fav_salty_score":"-2.491"},{"Hacker_News_User":"angersock","favorite_comments":"Some entertaining bits from the article: \"How many Mac applications still support OS X 10.2? 10.3? 10.4?\" \"Then why should we be so conservative when it comes to C++, the very core of what we work with?\" \"C++11 is a much more productive language than C++98. We as an industry can, however, only reap that productivity gain if we stop throwing C++ productivity out of the window by the bucket-load in the hopeless pursuit of compatibility with non-standard implementations.\" I'm as much for iconoclasm as the next person, but this whole C++ madness is starting to make me worry. While the rest of us have been off in the trenches of maintenance and production, some cabal of academics and chuckleheads has been cooking up this monstrosity of a language, and now it is finally coming to a head. Folks, conservatism in software design is appreciated--in language design, essential. Python 3 is still not support by many useful libraries. Perl 5, over ten years later, is still in production and use. ECMA/Javascript is only now really taking off, after 15 years. And on the darker, even more depressing side of things, you've still F77 codes in \"production\" and  active maintenance--a friend of mine who is a graduate student is dealing with this right now. These are souls being fed to the gaping maw of legacy code. I'm sure C++ has some interesting features. I understand, for example, why the \"auto\" keyword is being given new meaning (because the syntax of the STL, classes, and templates is so mindnumbingly awful!). I understand why explicit defaulting and deleting of function might lead to cleaner code (regardless of, say, an explicit that already exists). I understand why I might want 3 different declensions of 'u' in front of a string to support various forms of Unicode (where is your liberalism about forcing everyone to using UTF-8 and being done with it?). I also understand that D probably has a better execution on these ideas than C++. And that Javascript and C# have a better implementation of lambdas and closures. And that for raw power and readability, C with embedded assembly (still!) can probably eat the lunch of any C++.(for an example of rational language evolution, see C1X: Link. ) And that C++ still doesn't have anything other than a crackheaded set of half-idioms for exporting classes for dynamic linking in a crossplatform way, or even for binding to another language! Go ask the poor bastard who wrote SWIG's comments on the same--he quit programming for several years to stop dealing with C++'s increasing garbage. I feel reasonable in saying this: C++ is not going away soon. One day (even sooner if you are in academic circles and dealing with libraries) we maintenance programmers are going to have to start dealing with code written to take advantage of the new features in C++11. And on that day, all of us will be wondering why the hell we are still using that katamari of language features, instead of something less baroque--perhaps Perl.","fav_salty_score":"-10.046"},{"Hacker_News_User":"tokenadult","favorite_comments":"I was fascinated by what they reported. I liked the comparison between my height and other measurements the site gives, including movement of tectonic plates. But I was disappointed that the site didn't report anything about longevity trends in our lifetimes, because those have been some of the most striking and unexpected trends of all. Many people posting here on Hacker News seem to think that health in general is declining around the world, but exactly the opposite is happening. Girls born since 2000 in the developed world are more likely than not to reach the age of 100, with boys likely to enjoy lifespans almost as long. The article \"The Biodemography of Human Ageing\" by James Vaupel,[1] originally published in the journal Nature in 2010, is a good current reference on the subject. Vaupel is one of the leading scholars on the demography of aging and how to adjust for time trends in life expectancy. His striking finding is \"Humans are living longer than ever before. In fact, newborn children in high-income countries can expect to live to more than 100 years. Starting in the mid-1800s, human longevity has increased dramatically and life expectancy is increasing by an average of six hours a day.\"[2] If I remember correctly, there was a previous Hacker News submission of an article in a series on Slate, \"Why Are You Not Dead Yet? Life expectancy doubled in past 150 years. Here’s why\"[3] That article gives a lot of background information about why mortality and morbidity are going down, and thus life expectancy is increasing at all ages. Life expectancy at age 40, at age 60, and at even higher ages is still rising throughout the both developed countries and the still developing countries of the world.[4] It's not just newborns and young children who have better life expectancies than ever before, but everyone in most countries. [1] Link. [2] Link. [3] Link. [4] Link.","fav_salty_score":"11.666"},{"Hacker_News_User":"rbanffy","favorite_comments":"Do you have numbers for other markets? I gather in some of them Symbian is still going strong.","fav_salty_score":"-0.485"},{"Hacker_News_User":"pjmlp","favorite_comments":"Try a games developer event instead, even some Macs will be running Windows.","fav_salty_score":"-0.803"},{"Hacker_News_User":"PeterisP","favorite_comments":"If you want a very bad car fire, then half of your current tank is plenty enough and even overkill.  Lots of gas can do much more - say, if a gas lorry spills under a concrete bridge, then the fire can do structural damage to that.","fav_salty_score":"-1.982"},{"Hacker_News_User":"pedalpete","favorite_comments":"I don't have any iOS devices, so I can't download it, but apparently at least one person has downloaded it, as their is a review on the apple store that says the app crashed and never worked on his iOS6 iPhone 4. As far as getting users, why are you coming to HN looking for users? You clearly read HN, you read about how to do PR and pitch, did you miss everything on how to find product market fit? Did you miss everything on research before building, or building MVP and getting friends to try your app? I don't think you app is a bad idea, but it isn't something I'm going to jump on until I know other people are using it. If nobody is using it, their are no anon 'broadcasts' to be shared. You have a classic chicken-egg problem. Nobody is using your app, so their (likely) isn't any content their which is making people interested in viewing that content. This is part of the problem with anon apps, where people can't try before installing. There is no point in me telling a friend, hey download this app because I'm in it, because... if I'm anonymous, they aren't going to see who I am anyway. What is your pitch to your friends as to why they should use this app? What do they say. Get 5 people you know to install and use it, then adjust based on feedback.","fav_salty_score":"-0.003"},{"Hacker_News_User":"anigbrowl","favorite_comments":"By the way here is the cartoon I mentioned above. I mis-remembered; it wasn't Greeley's funeral exactly, but suggesting he was near death. Greeley had run as a quixotic Democratic candidate in the 1872 election against President Ulysses S. Grant and his continued occupation of the South during the reconstruction period following the civil war. Greeley did poorly in the election, and this cartoon in  Harper's Weekly, a strongly Republican magazine at that time, mocked his crusading style and suggested his campaign had no life left in it. Link. This is considered an especially cruel editorial cartoon, because Greeley's wife died immediately after the election; Greeley then went mad, and died a few weeks later at the end of November. He had suffered terrible financial losses by being caught in an investment scam earlier that year, and had lost control of his newspaper to another New York publisher, Whitelaw Reid, who fired him. I happened to be reading about these events just before the News International scandal blew up. Technology has changed a lot, human nature not so much.","fav_salty_score":"2.296"},{"Hacker_News_User":"IgorPartola","favorite_comments":"Exactly. BSD/MIT/Apache != Public Domain.","fav_salty_score":"0.245"},{"Hacker_News_User":"billswift","favorite_comments":"I have a two and a half year old AthlonX2 with only 256 MB RAM and have no problems with it.  Plus I am on dial-up, and this loads  much faster than Flash.","fav_salty_score":"0.304"},{"Hacker_News_User":"EGreg","favorite_comments":"Everything except shorting their stock. If you wrote a hard-hitting exposé or a John Stossel-type broadcast you aren't likely to be branded a terrorist. Make sure you don't reveal how it's actually done, but the fact that it can be. In short - media showing the potential results (and dramatizing them) puts heat on the company to fix it.","fav_salty_score":"0.323"},{"Hacker_News_User":"ZeroGravitas","favorite_comments":"That's one of the mental traps of the term \"Intellectual Property\", it doesn't protect what you own, it only allows you to stop other people from doing things (and therefor charge them in order to get your permision). But other people can use the same mechanism to stop you doing things with your own \"property\". That's why the asymmetric warfare of patent trolls works so well, they don't actually do anything you can interfere with via your IP.","fav_salty_score":"0.356"},{"Hacker_News_User":"sillysaurus3","favorite_comments":" It's like those commenting \"that skyscraper is garbage\" by someone who doesn't even know what you'd need to build a skyscraper, let alone actually tried to build one. It's nothing like that at all.  A piece of code's popularity is no evidence of its quality.  Otherwise we'd never have advanced beyond BASIC. Implementing an entire spec is nothing to be proud of.  Specs are often over-engineered.  This is almost certainly the case for TLS.  It's 103 pages long: Link. We should be questioning the foundations we've been relying on until now when a single vulnerability was able to compromise most of the internet, possibly since 2011.","fav_salty_score":"3.842"},{"Hacker_News_User":"mturmon","favorite_comments":"...who defines what... Exactly.  That's the whole problem with the sweeping statements here.  It's good we have different cities with different styles and sensibilities.  And it's usually silly to say one is \"best.\"","fav_salty_score":"1.185"},{"Hacker_News_User":"danielweber","favorite_comments":" I'd like to see something like parity for wages doing the same work anywhere on the planet I'd like a pony. Saying, in the year 2015, that wages should be the same anywhere on the planet is telling poor countries with no infrastructure \"fuck you, got mine.\"  Because the only reason someone opens a factory in Cambodia or China instead of South Carolina is  because of the low wages.  That is those countries' competitive advantage. If a worker in Cambodia costs $10 an hour and a worker in America costs $10 an hour, there is  no reason to build a factory in Cambodia.  They have poorer infrastructure, little to no respect for IP, and the stuff is now a world away from its customers.","fav_salty_score":"-1.562"},{"Hacker_News_User":"loewenskind","favorite_comments":"All first world countries (and probably most developing countries) have a minimum wage, yet all the \"homeless person found dead from ...\" are from the US.  In Western Europe most of the the \"homeless\" I see are actually bussed in from eastern Europe to pan handle.","fav_salty_score":"1.393"},{"Hacker_News_User":"gojomo","favorite_comments":"The article devotes just 3 sentences, in a short aside, to the idea that kidney sales could be encouraged, in an orderly and fair manner, rather than prohibited. (It's the prohibition which creates black market profits and kills thousands waiting for kidneys.) For more on this possibility: Link. Link. Virginia Postrel, a former editor of  Reason who actually donated one of her kidneys to a friend, has also written about donor chains and compensation: Link.","fav_salty_score":"0.981"},{"Hacker_News_User":"pyre","favorite_comments":"Blockbuster still had profitable locations, IIRC. It was the company as a whole that was collapsing. I assume that those locations are probably still profitable now, though maybe not as much as at its apex.","fav_salty_score":"2.133"},{"Hacker_News_User":"dkarl","favorite_comments":"Sounds like common sense to me, but believe it or not, some people disagree.   Check out some dissenting opinions from the article: \"A class I took in 2007 taught how to create a website with tables. I found out this year that they are finally teaching table free websites. Being a few years behind is definitely not smart, especially when you're paying so much to learn this information.\"  (If you think the point of paying tens of thousands of dollars per year for college is to acquire knowledge whose shelf life is shorter than the time you spend there, then it's no wonder you think it's a bad idea.) \"[Students] don't know, yet, that they need to be constantly monitoring blogs and twitter for the latest information on the industry.\"  (Methinks this person is confused about what \"web development\" is, thinking it means self-promotion and getting blog traffic rather than developing good web sites.) \"I think I learned more on my co-op at the time on web development then I learned in the class room. Only the concepts were relevant in the classroom - the languages and the techniques weren't.\"  (Silly colleges teaching concepts instead of specific technologies!) It's funny how so many web developers think that having the latest technology is absolutely required, instead of thinking about the costs and benefits of staying up to date.  The only aspect of web development where fashion is a driver is UI design.  Cutting-edge UI design sometimes (not always) requires cutting-edge UI implementation technologies.  For the rest, hell, every site has its own needs, and your site's needs might have been technologically solved years ago.  I think these kids could benefit from taking a calculus class and realizing that the concepts and the notation are older than their parents (hah, didn't know there  was anything that old, did ya?)","fav_salty_score":"4.547"},{"Hacker_News_User":"logn","favorite_comments":"I think that given the revelations of parallel reconstruction in general, the burden should be on the prosecution to prove that the NSA et al. were not involved. An illegal search seizure could very well have been what gave the FBI the idea to find the IP address in this way. Given that the NSA is able to collect most internet traffic, and they've been sharing info with other agencies, I would think that most evidence against any defendant could be thrown out. Yes, that would be ludicrous, and that's exactly why the NSA needs to be reformed.","fav_salty_score":"0.218"},{"Hacker_News_User":"dfc","favorite_comments":"I think you meant less than half? War is horrible. There is plenty of horror to go around, from every war. But I do not think that an abundance of horror means that we should do away with the desire for accuracy.","fav_salty_score":"-0.04"},{"Hacker_News_User":"pohl","favorite_comments":"Happy 15th birthday from user #872.  Back when Rob Malda started you, it was such a thrill to read the posts of far-flung techies whose interests went beyond what the real \"tech news\" press was covering.  It's almost painful to go back now and read what has become of you.  There are only so many racist trolls one can encounter before it ruins the whole experience.","fav_salty_score":"3.739"},{"Hacker_News_User":"gwern","favorite_comments":"This was heavily criticized back when it came out, and the criticisms struck me as valid and the paper not useful.","fav_salty_score":"0.985"},{"Hacker_News_User":"ars","favorite_comments":"I read the full quote and it's wrong. Period. If \"interchangeable code\" was the standard then why apply it only to prior art? Why not apply it to future art as well? (Samsungs implementation.) It looks like this jury just made stuff up. And I really hope the judgment gets completely tossed for this. The judge has yet to rule on that (although it's rare to toss a jury verdict since they actually are allowed to make stuff up to some degree - lookup Jury nullification, so I'm not really expecting it to be tossed).","fav_salty_score":"-1.557"},{"Hacker_News_User":"ivankirigin","favorite_comments":"Like Paris Hilton, Aaron does seem to spawn lots of useless, uninteresting discussion in other people. That probably is less his fault and more the fault of people like qwertyy.","fav_salty_score":"-1.528"},{"Hacker_News_User":"gaius","favorite_comments":" They can tax stuff to discourage it, or adjust interest rates. Or borrow and spend, which ought to drive up inflation, but require the BoE to keep inflation low, by artificially holding interest rates low making money too cheap and risk impossible to assess. I say it again: if you are bank A and you won't lend at a low rate and banks B, C and D do then A goes out of business when its customers desert it for doing the \"right thing\" and the situation is unchanged. The alternative is for A, B, C and D to get together and fix interest rates (prices) themselves, at which point their CEOs are looking at jail time. The banks are merely scapegoats for the politicians. And you've fallen for it hook, line and sinker. What would I like the government to do instead? It can start by paying off the deficit...","fav_salty_score":"-3.6189999999999998"},{"Hacker_News_User":"marshray","favorite_comments":"Why should Intel accept a patch that's only ever going to be useful for one distro? Wouldn't it be better for everyone if the distro would just manage those patches itself?","fav_salty_score":"-1.9969999999999999"},{"Hacker_News_User":"pcwalton","favorite_comments":"Yammer definitely does have traction. It may well be that the author didn't use Yammer at the two companies he worked at, but Microsoft wouldn't have paid a billion dollars for a company without traction.","fav_salty_score":"1.97"},{"Hacker_News_User":"pjc50","favorite_comments":"All sorts of parts can be surprisingly hard to find. I've been working on a radio product where the 16-way channel selector switch had to be specially ordered from China, while everything else came from Digikey.","fav_salty_score":"-0.357"},{"Hacker_News_User":"melling","favorite_comments":"Can someone discuss the pros of Fedora?  I'm mainly a Mac user these days but my Fedora 9 box is still running in the corner on a very old box.  I promised myself I'd get a beefy 8-core Intel Ivy bridge system next year.  I assume all my \"build notes\" with all my yum installs still work.  All I ever hear about is Ubuntu.","fav_salty_score":"0.792"},{"Hacker_News_User":"jacquesm","favorite_comments":"I'm sorry, I don't see your point. Could you elaborate?","fav_salty_score":"1.611"},{"Hacker_News_User":"marknutter","favorite_comments":"The vast majority of these apps are brochureware that wouldn't function properly without an internet connection.","fav_salty_score":"0.9580000000000001"},{"Hacker_News_User":"ahoyhere","favorite_comments":"Palm has never been as cool as Apple. Palm hardware has always been \"organization pr0n,\" which only appeals to a small subset. The iPhone is seen as cool; it is the most desirable phone. People are bending over backwards to afford one (the most iPhone growth over the past 2 quarters has been in low-middle and low class income groups). Apple paved the way with iPods. I think Palm will have a very hard time selling the Pre to people outside the geeky / careering groups where orgpr0n still appeals. Even if the user experience is better, the market hasn't been conditioned fr it.","fav_salty_score":"3.147"},{"Hacker_News_User":"tlrobinson","favorite_comments":"My brain  knows it's the middle of December, but I had to check to make sure it wasn't April 1st. This is  exactly the type of headline we see every year on April 1st. Crazy that it's real.","fav_salty_score":"1.283"},{"Hacker_News_User":"rayiner","favorite_comments":"So a Chapter 15 is an ancillary proceeding to facilitate the bankruptcy of a foreign corporation that is happening in another jurisdiction (in this case, Japan). Venue in a Chapter 15 is appropriate either where the company its principal U.S. assets, or where it is getting sued in the U.S. See: Link.. I believe the only lawsuit right now is in Chicago (NDIL), so presumably they filed in Dallas because they had some assets there (servers, etc)?","fav_salty_score":"-2.8200000000000003"},{"Hacker_News_User":"astine","favorite_comments":"I like it I feel that this is one instance where skeumorphism goes well. I can look at my actual card and visually match what info goes where without having to be told. One thing, I think it would be simpler for a user if the card showed both sides at once, rather than requiring the user to flip it to fill out the other side.","fav_salty_score":"-0.614"},{"Hacker_News_User":"SilasX","favorite_comments":"I tend to agree in general.  And expecting advice over an internet forum is ridiculous in the best of all worlds. But frankly, you don't need a high school diploma + a Bachelor's + med school + residency in order capture a huge fraction of a Real Doctor's value as a classifier.  Machine-learning-derived classifiers can do even better.   This is where there are huge gains to be made. Every time where cutting out the BS actually matters (pun intended), TPTB \"discover\" that you can churn out functionally-equivalent doctors with significantly less training.  See: military training of doctors, WWII.  If you suggested turning away people from doctor training back then because they didn't have a 4-year degree already, they'd laugh or have you committed.","fav_salty_score":"4.961"},{"Hacker_News_User":"jacquesm","favorite_comments":"Yes, absolutely.","fav_salty_score":"0.888"},{"Hacker_News_User":"Karunamon","favorite_comments":"Probably because smartphones are now less about \"phone\" and more about \"communicator\". A phone that can only make calls is rightly seen as a huge anachronism. I daresay that I use my smart\"phone\" more for the applications I can run on it than making calls nowadays.","fav_salty_score":"-0.546"},{"Hacker_News_User":"pcwalton","favorite_comments":"And &lt;audio, and Web Audio, and WebRTC. :)","fav_salty_score":"1.98"},{"Hacker_News_User":"zaidf","favorite_comments":"Actually, I'm not sure you can call this \"suffering.\" Having a healthy dose of confirmation bias can be the difference between trusting your instincts and giving in to naysayers(much of the world). Opposite extreme of confirmation bias is going by research and the written laws. And we know very well the limits of research.  Obviously confirmation bias is no excuse to ignoring apparent problems and flaws. That is just denial--especially in later stages of a startup.","fav_salty_score":"2.441"},{"Hacker_News_User":"dredmorbius","favorite_comments":" Since SAS is a relatively simple language SAS isn't a language.  It's a suite of (semi-integrated) products featuring numerous languages.  Key among these are the SAS DATA step (analogous to awk), the SAS Macro language (which shares terms but is in fact distinct), a number of other global languages, a number of domain-specific languages (TABULATE, LOGISTIC, GRAPH, etc.), and some proprietary implementations of general standards (SAS SQL). The best model for mapping from SAS to R is  not to try to support all of SAS's functionality within R, but to use multiple tools.  When UNIX was first created, with the awk and S languages ('R' is iterated 'S', Splus is the proprietary extension of S), awk was seen as the data pre-processor for S.  Today you'd likely use R (statistical analyses, graphics, matrix language), awk, Perl, Python, Ruby, or C (general programming   data manipulation), a database tool such as sqlite or Postgresql (both of which have their own considerable analysis capabilities), and other tools as appropriate. Trying to do everything in a single tool is a domain application mismatch.","fav_salty_score":"-0.97"},{"Hacker_News_User":"troels","favorite_comments":"That's not actually incompatible with parent's statement.","fav_salty_score":"-0.972"},{"Hacker_News_User":"Pxtl","favorite_comments":"Nobody will ever beat C C++ for raw soft-real-time speed.  Even a language like Rust that may have the linguistic features to be blazingly fast will never close that massive gap in historical optimization.  Rust will never have an Intel-compiler. That said, Rust will get  close to C C++ in ways that GC-based languages never will.  GC languages mean memory bloat and soft-realtime problems related to GC cleaning.  It will likely hit the sweet spot for a lot of embedded or gaming uses.  Obviously you  can do those tasks in other languages (great stuff is done on phones with GC-based languages, obviously), but you have to work around some challenges that would not exist in Rust.","fav_salty_score":"-1.169"},{"Hacker_News_User":"jcromartie","favorite_comments":"There are subtleties to nutrition and weight loss, of course. But let's say you stopped eating, and you didn't just die: do you think it's somehow possible to NOT lose body mass?","fav_salty_score":"1.8639999999999999"},{"Hacker_News_User":"gress","favorite_comments":"Why do you need a straw man to justify your point?","fav_salty_score":"-1.0"},{"Hacker_News_User":"losethos","favorite_comments":"Somehow, I don't think Apple is in the sights of the liberals who hate corporations.","fav_salty_score":"0.606"},{"Hacker_News_User":"pjmlp","favorite_comments":"They just got big enough to stop caring about what geeks think.","fav_salty_score":"-0.515"},{"Hacker_News_User":"sp332","favorite_comments":"Sets in spreadsheets still works for me. Edit: When the feature was \"retired\", there was a note that it would be replaced with a better version. Link.","fav_salty_score":"2.83"},{"Hacker_News_User":"btilly","favorite_comments":"But can such evidence be used to establish the grounds for a warrant? That is a common trick in the USA.  Data obtained in ways that would not be admissible in court can be used to get a warrant, and then data collected under the warrant can be used in court.","fav_salty_score":"0.54"},{"Hacker_News_User":"tptacek","favorite_comments":"If you're a developer, and someone asks for your credit score, refuse. Inform them that it's none of their business. If they demand it as part of their hiring process, get up and walk out of the interview. Whatever credit scores may signal about a candidate's future performance, the request for a credit score signals far more about the quality of an employer. You are not going to like working for any company that credit checks employees. (You may get asked to authorize a credit check as part of a background check process; background checks can be reasonable, for instance if you're going to work for an exchange. But a background check happens  after an offer is made; it's not part of the decision process.) As always on threads like these, I like to plug our recruitment process, which we've been tuning for 4 years or so: Link. There's more to it than what's on the page, but, long story short, we do two interview phases separated by a battery of \"challenges\", calibrated to take about as much time as a serious on-site tech-out interview would take, but designed to be done in a candidate's spare time in bits and pieces if necessary.","fav_salty_score":"-4.2780000000000005"},{"Hacker_News_User":"bayesianhorse","favorite_comments":"Key points here are that this brain to computer interface is using electrodes implanted under the skull, for the express purpose of interacting with the outer world, and that the F-35 simulator probably took control input like \"left, right, level\" etc.","fav_salty_score":"-0.999"},{"Hacker_News_User":"javert","favorite_comments":"I'm not sure I get your point. He doesn't need to speak for all anarchists. He just needs to speak clearly. If he advocated \"collectivism fully devolved to the local level\" (which I think is what he advocates, right?) it would be much more clear, and he would not be peddling a contradiction. \"Anarchism\" contradicts with the thing I just described, which is still a government and or power structure.","fav_salty_score":"1.706"},{"Hacker_News_User":"ohashi","favorite_comments":"In theory there are only two options for this. A.  Something that is better than Twitter comes along and people like it more. B. People no longer find Twitter useful/interesting/whatever makes them use it in the first place. So basically, irrelevancy by competition or by societal shift.","fav_salty_score":"1.301"},{"Hacker_News_User":"jakejake","favorite_comments":"Earlier today there was an article on the front page about a Postgres data corruption bug. I thought it was unusual to see a negative Postgres story here. I came back looking for it and it seems to have vanished and been replaced with this article.","fav_salty_score":"-2.697"},{"Hacker_News_User":"nailer","favorite_comments":"If it's using HTTP and XML but uses query strings and GETs for DELETE, then it ain't ReST and few people would describe it as doing do.","fav_salty_score":"0.974"},{"Hacker_News_User":"jarek","favorite_comments":"I would expect robots in Japan in 2011 to be able to withstand a bit more than robots in the USSR in 1986.","fav_salty_score":"0.8130000000000001"},{"Hacker_News_User":"scott_karana","favorite_comments":"I suspect it's simply out of date. Nagios  does have a large surface area, but from what I've seen in the past, monitoring systems are very difficult for sysadmins to want to upgrade. :)","fav_salty_score":"2.943"},{"Hacker_News_User":"JoshTriplett","favorite_comments":"Does your hand-written parser handle all the corner cases getopt does?  Ending option processing with \"--\"?  Interleaving options in any order (ls foo -l)?  Stacking short options (ls -la) or writing them separately (ls -l -a)?","fav_salty_score":"-3.387"},{"Hacker_News_User":"guard-of-terra","favorite_comments":"Looking at the latest news, it seems that Dutch court would do anything that american corporations would ask it to, event against its local people. What makes them do so?","fav_salty_score":"1.978"},{"Hacker_News_User":"roel_v","favorite_comments":"I don't know what area you're from, but calling (supposedly yearly) salary raises of (just) under 10% to 'hardly make up for inflation' seems like, to put it mildly, a stretch.","fav_salty_score":"-0.992"},{"Hacker_News_User":"barrkel","favorite_comments":"It's counterfeiting if the consumer is getting fooled. It's something else if the consumer is aware they're not getting the real deal.","fav_salty_score":"0.244"},{"Hacker_News_User":"eli","favorite_comments":" My point is that, had the hacker sent this to a real news agency rather than TC, they would have published docs too. And my point is, I'm not so sure you're right. Unless there's actually something  newsworthy contained in the documents, I think only the sleaziest news outlets would publish any details at all beyond perhaps the fact that there had been a break-in. For example, Link.","fav_salty_score":"-0.381"},{"Hacker_News_User":"DennisP","favorite_comments":"I like this idea, but I don't know how it would handle multiple conflicting goals. Hansen gives a sample goal of improving the economy, but what if you also want to protect the environment, take care of your old and sick, maintain a strong defense, educate your children, etc? I suppose you could weight them by importance (based on score voting maybe), have people bet on each policy's effect on every goal, and apply an optimization algorithm to the whole thing to get policy decisions, but not many people would understand and trust the system.","fav_salty_score":"-0.542"},{"Hacker_News_User":"wvenable","favorite_comments":"The reason why Microsoft wins consistently is they take things like \"printing\" pretty seriously.","fav_salty_score":"0.9440000000000001"},{"Hacker_News_User":"_delirium","favorite_comments":"They handle large-dimensional spaces fairly well, which is one of their strengths. They are not all that interpretable, though.","fav_salty_score":"0.442"},{"Hacker_News_User":"weaksauce","favorite_comments":"OK. Sous Vide looks more interesting to me that overly salting a piece of meat. tptacek care to weigh in? I am about 23 hours away from buying a rice cooker + pid controller to make this happen. I do the pid part at work so it is interesting to me from a work point of view too. Edit: If you have not seen sous vide cooking: Link. It looks amazing to me.","fav_salty_score":"0.927"},{"Hacker_News_User":"ChuckMcM","favorite_comments":" [2] I can remember enough of this paragraph from the '80s to google it in one go, but I can't remember my wife's cell phone number. I should have words with this brain. I would gladly give up my catalog of lyrics to songs from the 1970's in exchange for additional memory capacity! :-) I just wish someone had told me in my youth \"Don't memorize that stuff, you'll need those neurons later, trust me.\"","fav_salty_score":"-1.311"},{"Hacker_News_User":"bluedino","favorite_comments":"It's built into my TV  (along with Netflix, Hulu, etc) already.","fav_salty_score":"0.999"},{"Hacker_News_User":"maxerickson","favorite_comments":"The frantic addition of mining hardware (observable in the hash rate) contradicts this.","fav_salty_score":"-0.794"},{"Hacker_News_User":"justincormack","favorite_comments":"As far as I can see I would still need to run ipv4 NAT in order to get ipv4 addresses for NAT64, so it doesnt really seem worth it.","fav_salty_score":"-0.868"},{"Hacker_News_User":"ilaksh","favorite_comments":"Wow, this page looks incredibly bad and loads amazingly slow on my Chromebook.  Either google is trolling M$ or M$ is trolling themselves.","fav_salty_score":"-0.181"},{"Hacker_News_User":"marcamillion","favorite_comments":"Congrats on the wonderful job. So I guess my first question about Slim is how does it work? For instance, I am trying to figure out how on your home page, you have the following copy:  Upload, organise, and share your photographs alongside others, like Robert May did with this superb image. Where 'Robert May' and 'superb image' are dynamic links - that correspond to the image below it (although maybe you may want to change the copy to \"the superb image below\" or something of the sort, because it took me a while to realize that image showing on the page is the same image you were talking about and linked. I thought they were 2 different images). So, I guess just to start off...where is the actual copy of \"Upload, organise, and share your photographs....\" actually stored. I don't see that copy in the .slim file at all. It seems to be abstracted to 'home.blurb' - Link. But I have no idea where that is. Sorry if this changes the topic a bit, but I am curious.","fav_salty_score":"0.485"},{"Hacker_News_User":"joezydeco","favorite_comments":"I've gotta wonder if he meant 1.4 months.  In this economy, nobody would keep 14 months of product in inventory and hope that there's a buyer for it down the road. The bananas I buy here in the US are flown in from South America in under 48 hours.  I can get tulips from Holland in less than that.  The apples number makes no sense.","fav_salty_score":"3.278"},{"Hacker_News_User":"Nursie","favorite_comments":"I understand some folks like to recieve fb message notifications as if they were email I guess. Don't feel the need myself. I guess I'm just questioning the need for an app for all things, when many of the things are just as well served by a decent page in a browser.","fav_salty_score":"0.49"},{"Hacker_News_User":"damoncali","favorite_comments":"I think the better question is \"Are they really selling any of those high-end plans\". I would guess very few people/companies actually buy those, but I don't know. Anyone have any info on this?","fav_salty_score":"0.6940000000000001"},{"Hacker_News_User":"hugh3","favorite_comments":" Of course you can turn while falling. Hell, you can turn without air. It's a rocket Ah, but then you're no longer falling. You're not even \"falling with style\".","fav_salty_score":"-1.218"},{"Hacker_News_User":"VladRussian","favorite_comments":"nice, correctly incentivising, performance management system - if you shown yourself a bad soldier then you don't get to go to dangerous mission(s). I bet you'd be a respected 4-star general ...","fav_salty_score":"-1.966"},{"Hacker_News_User":"pavel_lishin","favorite_comments":"Interesting that they referenced 22.7 falling out as similar to pi, since 22 7 is one of the simpler approximations of pi.","fav_salty_score":"0.991"},{"Hacker_News_User":"calinet6","favorite_comments":"It's very similar in holocracy: the people who are natural leaders will fill the management needs of the organization; it's just more chaotic, less predictable, and not as good. The lack of structure brings out the worst in human behavior. In my experience, it is a horrible system in which to exist. It's highly ignorant of psychology and behavior theory almost intentionally, and it creates far more drama and politics than any organizational system I've ever seen. It's not a good thing.","fav_salty_score":"-1.018"},{"Hacker_News_User":"Xylakant","favorite_comments":" Why must I be part of a team? Why can't I just be hacking randomly and syncing my history with my personal server as I feel like it. Sure, go, do. Just don't pretend that there are no teams and no other people that have different use cases.","fav_salty_score":"-3.899"},{"Hacker_News_User":"michael_dorfman","favorite_comments":"Too bad Matt didn't get some actual meditation instruction-- I think it would have been more interesting (and beneficial) for him had he done so.  Unfortunately, his description makes it clear that he didn't really know what he was doing:  First, it was difficult (impossible?) to turn my brain off. I’m accustomed to using my brain all the time, every day. I don’t like to turn my brain off. I definitely struggled with that all month. Meditation is  not about \"turning your brain off.\"  Someone recommended counting, for example counting leaves on a tree, as a way to help. That worked very well, but it also felt like counting was keeping my mind busy rather than clearing it out. Some meditation traditions use counting-- but not like that.  Counting the leaves on a tree might be a nice thing to do, but it's not meditation (at least according to any tradition I've ever heard of-- and I'm reasonably well schooled on the subject.)","fav_salty_score":"1.7000000000000002"},{"Hacker_News_User":"cmelbye","favorite_comments":"God... what? First off, which Pascal textbook would be both old enough to include a floppy disk, yet new enough to include a Twitter clone? I simply don't understand his main argument. App.net will be unsuccessful because it's just a clone of Twitter and people won't support a Twitter clone? App.net is certainly not and will not be a Twitter clone, and anyone who has spent more than five minutes looking at the platform, its roadmap, its API docs, etc., would know that.","fav_salty_score":"-2.536"},{"Hacker_News_User":"rosser","favorite_comments":"The relevance of your analogy of a storage locker filled with trade secrets hinges on a crucial question: Did Brown have  specific knowledge that the file dump contained credit card numbers, and if so, was his intent in posting the link to the chatroom to disseminate those credit card numbers for the purpose of furthering identity theft? Because if not, then given the crimes he's been charged with (aside from those related to the threatening the FBI agent, of course), he doesn't have the  mens rea to warrant a conviction, to my — IANAL — understanding. (There's, I think, a further question in terms of whether or not, and to what extent, posting the URL to a chatroom intended presumably for the internal communications and coordination of Project PM counts as  publishing them, but that's irrelevant to his  mens rea.)","fav_salty_score":"-2.885"},{"Hacker_News_User":"mseebach","favorite_comments":"  (It's not clear to me where the other €17,500 come from.) I would guess assets such as inventory, shares of other companies, real estate and IP.","fav_salty_score":"-1.9300000000000002"},{"Hacker_News_User":"agumonkey","favorite_comments":"The part about George's book reminds me of Sim City too.","fav_salty_score":"0.9570000000000001"},{"Hacker_News_User":"batista","favorite_comments":" But this update feels like it's creeping towards a heavily consumer facing product. Two questions: 1) you think you are different than a consumer how? 2) what exactly do you see this update taking away from you?","fav_salty_score":"0.976"},{"Hacker_News_User":"cromwellian","favorite_comments":"The report isn't claiming GMO is carcinogenic, it's claiming glyphosate is, that's a big difference. If the roundup crops had been created by breeding or grafting, would you say \"I can't wait until the pro-grafting crowd comes forward calling all this \"anti-science\" GMO is a technique for modifying plant genomes, Roundup Ready is an application of the technique to make crops resistant to an herbicide. It's overuse of the herbicide that's the problem here. Traditional plant breeding techniques have successfully been used to breed herbicide resistant crops without GMO now, meaning that you could have the same allegedly carcinogenic cocktail of chemicals sprayed on your non-GMO crops.","fav_salty_score":"-3.9779999999999998"},{"Hacker_News_User":"lostlogin","favorite_comments":"I suspect that Apple define success with their own metrics. There are a few measures by which Apple is already the best - which areas do you think a Cook Apple might target? From the short Post-Jobs era, I'd say that Apple was more secretive, and quicker to acknowledge fault.","fav_salty_score":"0.974"},{"Hacker_News_User":"elblanco","favorite_comments":" Neither of these assumptions appear to be true, at least to me. It's been my observation that if you ask most people who espouse a particular philosophy couched in \"morality\", that they claim that following their particular moral code will lead to well being. I've also found that the strong that belief is, the less likely that those followers have actually spent time thinking on the ramifications of their moral code towards that goal. They  think they have thought about it a lot, but typically they've just spent brain cycles thinking about the  code and how to follow it most closely -- not what following that code leads to. I'm not disagreeing, just throwing in an observation -- most moral codes claim to lead to well being, but in reality many of them do not actually go there. This phenomenon seems to create a particularly powerful barrier to rational thought that very few people seem to be able to overcome and can even seem to defeat some individuals. I've seen friends, family and colleagues fail repeatedly to come to terms with this, they think it's because they haven't applied themselves completely to some arbitrary code so the only solution is to double down again and again. After decades of doubling down this seems to drive people closer and closer to a kind of insanity...I've seen a few withdraw into fantasy worlds constructed of such powerful cognitive dissonance (arising from the inherent contradictions of their moral code and the observed outcome) that having a normal conversation about simple things, like the weather, become impossible -- they can barely complete a sentence without contradicting themselves or becoming lost and sidetracked about how such and such random topic has some particularly deep meaning in their hyper acute moralist world.","fav_salty_score":"-0.218"},{"Hacker_News_User":"fit2rule","favorite_comments":"Amphetamines were available over the counter until the 70's, no prescription required.  Did you read the article?","fav_salty_score":"1.8780000000000001"},{"Hacker_News_User":"rmc","favorite_comments":" The concept of \"positive rights\" really doesn't make any sense Eppur si muove (Italian for 'and yet it moves', fabled as what Galileo said when signing his confession that the sun goes around the sun). Some jurisiticions recognise positive rights. Ergo they exist.  outside the scope of the theory of rights - this is just policy Again, some jurisiticions recognise these as not a mere policy, but as rights of a person.","fav_salty_score":"0.136"},{"Hacker_News_User":"TheLoneWolfling","favorite_comments":"That bad? Yow.","fav_salty_score":"1.81"},{"Hacker_News_User":"snprbob86","favorite_comments":"Ive also tried the MVC framework. It is a huge improvement over WebForms as it neatly addresses complaint #1, but it completely fails to address complaint #2. It is also beta software under heavy development and rapid change. That said, Linq to Sql ROCKS MY WORLD. Maybe a more mature MVC framework and better Visual Studio support will join forces with Linq to swing me back to ASP.NET I'm confused about the \"crazy fast\" comment. I'm a big believer in C#'s great performance, but ASP.net is super slow for me on every machine I have ever tried. Hell, every Microsoft site I can think of feels slow on round trips. Something is very very wrong...","fav_salty_score":"3.553"},{"Hacker_News_User":"chc","favorite_comments":"I think what he means is that car companies are good at making cars, but they're not as good at making the kind of AI you need for a fully autonomous car.","fav_salty_score":"-0.993"},{"Hacker_News_User":"rbanffy","favorite_comments":"Be fair. It's rather easy to roll out a Debian-derived distro that's Commodore and Amiga-centric by changing defaults. There are themes, icon sets and emulators already packaged that makes this more or less a click-some-checkboxes job.","fav_salty_score":"2.998"},{"Hacker_News_User":"rdl","favorite_comments":"dropbox plus either passphrase brute force (or guessing), or one of (keylogger, compelled disclosure, shoulder surfing, ...) + dropbox. I consider the 1Password file sensitive enough that it shouldn't be online, especially not with dropbox.  I'd prefer if there were physical protection for it somehow, too (like a smartcard or FIPS module, which wouldn't allow bulk-export normally, and which might impose other rules on use like 5 passwords per hour when outside my home network, etc.)  Same way you handle high-security private keys. (Ultimately I'm not going to be happy until I have a trusted tablet of some kind, but building that either requires being Apple or waiting for WP8 hardware to come out and investing about $5mm in some serious security upgrades.  Maybe worthwhile, though, since it solves the general problem of trusting client devices.)","fav_salty_score":"-0.79"},{"Hacker_News_User":"kragen","favorite_comments":"I don't think that needing  thirty thousand hours of practice to learn something qualifies as learning it \"easily\", and that's how long children normally take to learn their first language.  Adults can often learn new languages to an expert or native level of competency in only ten or twenty thousand hours of practice.  What's exceptional is the adult who takes that amount of time to learn a language, challenging themselves and trying to improve the whole time. (Exceptional adults may be able to do it in less time, and far less time to achieve a lower level of competency.  Sidis supposedly could \"learn\" a new language in a day.)","fav_salty_score":"0.9430000000000001"},{"Hacker_News_User":"jacquesm","favorite_comments":"I had to think about it for a bit. I didn't rule it out up front so I figured it was within the rules I set so I allowed it, but there is condition regarding representation in the rules I set so I take it that person is fully aware of the responsibility. Api was another one like that but we really will roll and api and will use that ourselves so I overruled that one.","fav_salty_score":"1.152"},{"Hacker_News_User":"ForHackernews","favorite_comments":"  Of course, someone has to write the raw code, just as some farmer has to grow the wheat that winds up in the box of rigatoni at Safeway. But, as happened with farmers, far fewer coders will be needed as existing code gets repurposed. Theoretically, just one person on the planet will have to write the raw code that makes a computer perform a certain task. Just that one person. Sure.","fav_salty_score":"0.768"},{"Hacker_News_User":"amichail","favorite_comments":"Submissions could be made anonymous for a few hours.  I think you would get more interesting items on the front page.","fav_salty_score":"0.07100000000000001"},{"Hacker_News_User":"electromagnetic","favorite_comments":"Agreed, it's as non-HN news as a link to about:blank because I would put money on the fact that everyone using HN in a non-chrome browser has google set as their default homepage.","fav_salty_score":"-0.999"},{"Hacker_News_User":"wccrawford","favorite_comments":"I ended up paying $23k for a piece of paper that I'm pretty sure hasn't done me any good.  I learned a little, but not much, and I could have learned it on my own anyhow.  Most of it I already knew. Yet I'm still not willing to say I wasted that time and money.  There's still some chance that it'll turn out to be really valuable, and getting through the system helped with some of my issues with valuation of my own abilities. When I eventually got a job, they didn't care about my paperwork.  In fact, my resume was worse than the other candidate's, and they said so.  What got me the job was the BrainBench tests they put me through.  Without those, I would not have gotten that first job.  (Actually, it was the second, but the first was rather non-traditional and  before college.) Anyhow, I think the value of these anecdotes is to let people know that there are alternatives to traditional education.  It's not right for everyone, or even most people, but you shouldn't feel railroaded into it.  If you have the skills to do the job already, you should  consider just going and getting a job, instead.","fav_salty_score":"0.126"},{"Hacker_News_User":"yummyfajitas","favorite_comments":"What do you mean? Specifically, you use the word \"bad things to say\". Are you arguing that they are  incorrect? Or are you simply arguing that they are correct, but admitting their correctness somehow makes you a bad person? If VCs are obligated to make suboptimal investment decisions (e.g., investing in founders who are less dedicated to the company but have breasts), who else is? Is Joe 401k also a bad human being if he attempts to maximize his returns and doesn't throw his money after feel-good causes?","fav_salty_score":"-2.26"},{"Hacker_News_User":"betterunix","favorite_comments":"\"public opinion is against him and he is labelled as a \"traitor\" because people think it is perfectly fine for the government to spy on them\" I think it is more that the majority of people do not believe that the government  is spying on them.  Most people do not understand that it does not take a team of government agents to spy on a person.  The issue is not merely that people think they have nothing to hide, but that they do not even understand that they are being watched.","fav_salty_score":"2.374"},{"Hacker_News_User":"TheLoneWolfling","favorite_comments":"First off, that doesn't work without JS. I mean really: It's a couple of screenshots. Secondly, I prefer it. Far too many websites adjust things to the point where it's impossible to actually see. (Case in point: link styling. To the point where I have bookmarklets to remove styling from pages.) I understand having the option to do so. But at the same time, I wouldn't use said option. To me, readability  aesthetics. And far too many websites don't respect that. Please read JS;DR: Link.","fav_salty_score":"0.835"},{"Hacker_News_User":"jacquesm","favorite_comments":"Or vice versa, if you can't join them beat them.","fav_salty_score":"0.8280000000000001"},{"Hacker_News_User":"sliverstorm","favorite_comments":"Thanks, radar air traffic control is another good example. The world would not end without GPS, it would just make things harder :)","fav_salty_score":"1.8090000000000002"},{"Hacker_News_User":"yeukhon","favorite_comments":"The impact can be catastrophic.","fav_salty_score":"0.977"},{"Hacker_News_User":"vinceguidry","favorite_comments":"Oh believe me, I tried to use Sequel to get that data. After I realized just how many joins and how many layers of abstraction I'd need to debug the damn thing through, I knuckled down and built the query. Even so it runs behind a caching layer. Thankfully, I don't need up-to-the-minute product data.","fav_salty_score":"-1.596"},{"Hacker_News_User":"justincormack","favorite_comments":"It is being updated Link.","fav_salty_score":"0.999"},{"Hacker_News_User":"jacques_chester","favorite_comments":"It's our generation's text editor.","fav_salty_score":"-0.984"},{"Hacker_News_User":"ZoFreX","favorite_comments":"Because creating something in Maya doesn't equate to designing a product?","fav_salty_score":"-0.971"},{"Hacker_News_User":"rms","favorite_comments":"Typing is by far the most useful thing I learned in school.","fav_salty_score":"-0.961"},{"Hacker_News_User":"andybak","favorite_comments":"My only issue with 'isomorphism' it it forces me to use javascript on the server. As much as javascript isn't the worst language in the world, I'll never be happy with to live in a world where it's the only language.","fav_salty_score":"-0.133"},{"Hacker_News_User":"makecheck","favorite_comments":"I think it would help if a user's first few karma points could only be obtained through upvoted  comments, and not submissions.  Submissions should be disallowed until you reach a certain karma value, ensuring that you've contributed meaningfully to discussions for awhile before you can add your own.  (This would avoid the all-too-common 1-karma-user posts of spam or stuff from Reddit that isn't even related to us.) I don't think invite-only is a good thing.  It probably would have prevented me from ever being here.","fav_salty_score":"2.745"},{"Hacker_News_User":"tptacek","favorite_comments":"I agree. It's a classifieds site, not a search engine or a directory. It looks like a classifieds site and it works like a classifieds site.","fav_salty_score":"-0.79"},{"Hacker_News_User":"noodle","favorite_comments":"i think his intent for SEO via PR releases is that they provide a well-written release and people will scrape it for content to throw on their own sites, providing contextual backlinks. which is an ok plan, i suppose. /not a SEO expert but plays one on tv","fav_salty_score":"0.746"},{"Hacker_News_User":"debacle","favorite_comments":"By leveraging their name, you could potentially tarnish their image if the food you're giving out is tainted with anthrax or something. They're taking a small step to defend themselves. You should gracefully acquiesce.","fav_salty_score":"2.76"},{"Hacker_News_User":"jacquesm","favorite_comments":"And it is much easier to test a microservice than a monolith. (Going on the assumption that you do spec out the interface to your microservices with some care.)","fav_salty_score":"-1.762"},{"Hacker_News_User":"DanielBMarkham","favorite_comments":"Needs a menu bar.","fav_salty_score":"-0.998"},{"Hacker_News_User":"toomuchtodo","favorite_comments":"An Elon Musk ETF? YES.","fav_salty_score":"-1.584"},{"Hacker_News_User":"jasonlotito","favorite_comments":" maybe make sure your female engineer is on the hiring committee? Doing that for the reasons you are suggesting is hypocritical.  On one hand, you want the best person for the job, but then you are suggesting that the female engineer is apart of the decision making process, as if her gender is what qualifies her to hire engineers, or, more precisely, female engineers. That's not what you intended to say, I know, but that's how easy it is to slip up in this regard.  what is really needed is dedication and time. Dedication to what, specifically?  If the best people every time you hire is a white man, then you are losing the value that a diverse work force provides.","fav_salty_score":"2.552"},{"Hacker_News_User":"larrys","favorite_comments":"So then you are saying that if you start a business with a name (say a site selling something, even a pet rock) you can't sell that business with the name? (See where this is going?)","fav_salty_score":"-0.001"},{"Hacker_News_User":"delinka","favorite_comments":"\"When I played my own game, I had the technical knowledge of how the game functioned\" I have this same problem when I test my own software.","fav_salty_score":"-0.897"},{"Hacker_News_User":"gizmo686","favorite_comments":"What is the point of this thought experiment? If I know I am looking for a certain thing in a thought experiment, than I might be able to suspend disbelief on the other parts, but without knowing what I am looking for, all I see are the inherit inconsistencies in the universe you posit.","fav_salty_score":"-1.998"},{"Hacker_News_User":"talmand","favorite_comments":"Illegal drugs? Think a tad bit differently, think of states where marijuana is legal but is still illegal on the Federal level. If you go to surgery you really should tell them about drug usage to make sure they compensate in their drugs, but the Feds might be interested to know as well.","fav_salty_score":"-0.936"},{"Hacker_News_User":"edw519","favorite_comments":"Why do I have to register to use?","fav_salty_score":"0.556"},{"Hacker_News_User":"yummyfajitas","favorite_comments":"There is a variant of the secretary problem that assumes a different payoff structure - each secretary has a payoff which is uniformly distributed U(0,A) for unknown A. As I recall, the stopping time is O(sqrt(N)).","fav_salty_score":"0.257"},{"Hacker_News_User":"mercurial","favorite_comments":"I love the systemd principles, as they were outlined by Poettering in the initial announcement. Configuration files instead of boilerplate shell script (and worse, shell script with special comments), socket-based startup, massive parallelism, cgroups, the end of PID files... I just wish systemd itself had stayed there and that the additional functionalities it keeps developing lived in separate projects with well-defined interfaces.","fav_salty_score":"0.999"},{"Hacker_News_User":"higherpurpose","favorite_comments":"Microsoft tend to make a lot of bold claims, but they rarely follow through or in the same way they  promised. We'll see how that bold plan actually fleshes out in reality.","fav_salty_score":"1.974"},{"Hacker_News_User":"smtddr","favorite_comments":"Is there something wrong with MongoDB that I don't know about? Is it not suitable for Coinbase's business?","fav_salty_score":"-1.9500000000000002"},{"Hacker_News_User":"yummyfajitas","favorite_comments":"60 years ago (after WW2), there was no real competition to America  because the competition mostly got blown up during WW2. To go back to the postwar situation, we'll need another war. And it needs to be a real war with firebombs, tank columns and opposing armies, not a stupid \"suicide bomb some orphans for the cameras\" event like what we have now.","fav_salty_score":"-0.653"},{"Hacker_News_User":"rokhayakebe","favorite_comments":"\"So I start wondering how many times I do exactly the same thing.\" Not so many times. People who fall into your description do know they are BSing, what they don't know is some people actually know they are doing so. I have seen a few of these who actually know their words are total crap, know that everyone doubts them, put keep going with a straight face. They are also the kind that usually get promotions and pay raises.","fav_salty_score":"0.704"},{"Hacker_News_User":"axod","favorite_comments":"Isn't that all pretty much taken care of with forums, google groups? (Attaching files, giving everyone the same view, keeping people added, etc) Why would you use wave over a forum/google group etc?","fav_salty_score":"-1.8820000000000001"},{"Hacker_News_User":"wpietri","favorite_comments":"I have yet to see proof that tech is any different than medicine or law, where societal barriers were demonstrably the only things keeping women from equal participation. The centuries of discrimination, both blatant and subtle, were very substantial. Also, the pseudo-clever \"nuh-uh, you're the  real sexist\" stuff is the kind of bullshit that I only ever see from anonymous accounts. If you want to make (idiotic) personal accusations, own your words.","fav_salty_score":"0.051000000000000004"},{"Hacker_News_User":"corin_","favorite_comments":"The title made me think \"really, another one?\", turns out it was definitely well worth writing (and, indeed, reading). Interestingly, Jekyll does give you, at least if you are the right kind of person, a sense of satisfaction that seems to make a lot of people, myself included, want to write about the fact that they're using it (albeit not normally in as much detail). And that same sense of satisfaction comes whenever writing a post or editing the site - or even when reading a blog like this. I guess it's just one of those things that's really easy to fall in love with.","fav_salty_score":"1.701"},{"Hacker_News_User":"junto","favorite_comments":"As someone that has allergic rhinitis, dyshydrotic excema and allergic asthma, I would welcome a scanner that could tell me which allergens are present in my home and on my skin.","fav_salty_score":"1.0"},{"Hacker_News_User":"wpietri","favorite_comments":"I agree that nobody should focus solely on getting better at, say, Agile. I also agree we should work hard at getting better at programming. However, I don't think that focusing on programming alone is sufficient. A lot of projects fail for reasons other than bad coding, and almost no project exists where programming is the end purpose. You can do all kinds of great programming, but if you make the wrong thing, you're screwed. Ditto if you have a bunch of individuals doing great programming that doesn't add up to a functioning project. I also think you're creating a bit of a false dichotomy. When I first tried XP, it wasn't for the sake of doing XP. It was because I wanted to improve how we made things for our users. So exploring XP wasn't tangential to better programming; for me it was closely related, in that programming was a big part of making.","fav_salty_score":"3.5380000000000003"},{"Hacker_News_User":"InclinedPlane","favorite_comments":"Link.","fav_salty_score":"0.9570000000000001"},{"Hacker_News_User":"robomartin","favorite_comments":"Well, I am not a surveillance expert by any possible stretch of the imagination.  That said, I seriously doubt governments could access the kind of personal data (behavioral and otherwise) they can today back in the 70's and 80's. sure, if they targeted someone they could follow their life and gather lots of data.  That required devoting people to follow, watch, study and record a persons every action.  Today things are quite different.  A \"recording\" of everyone's actions is being made every minute of every day.  When someone becomes a government target they can virtually rewind the last n years and learn everything about them with nearly zero human cost in relative terms.","fav_salty_score":"1.8519999999999999"},{"Hacker_News_User":"kevingadd","favorite_comments":"Sorry to break it to you, but .NET has been devouring game programming for years. Unity uses it extensively, XNA was until recently a big choice for indie development, MonoGame is growing, etc...","fav_salty_score":"-1.6720000000000002"},{"Hacker_News_User":"rjurney","favorite_comments":"Yeah, why would you need to hire a publicist?  Use the tubes.","fav_salty_score":"-0.213"},{"Hacker_News_User":"ars","favorite_comments":" Assuming Tesla is not making their own materials, this deflates the required input energy substantially. And also inflates that amount of greenwashing involved...... Why crow over renewable energy when your use of energy is irrelevant relative to your suppliers?","fav_salty_score":"-2.878"},{"Hacker_News_User":"ams6110","favorite_comments":"I think that a candidate who was not afraid to make the \"security state\" a campaign issue, and the massive government encroachment in so many other aspects of our lives, and was able to explain the issues and his or her positions without sounding like he was regurgitating focus-group tested talking points, would do quite well in the current climate. Or it may be that the average person still doesn't care.  People who really don't care don't vote though, so all you really have to do is reach the people who are in any way paying attention.","fav_salty_score":"2.465"},{"Hacker_News_User":"Goladus","favorite_comments":"There are plenty of reasons to contact someone other than responding to an opinion on a blog. I've got a dozen emails in my inbox right now from friends, contacts, and organizations like the choir I sing in.","fav_salty_score":"1.931"},{"Hacker_News_User":"alttab","favorite_comments":"I'm betting on phones + tablets merging, so yes, its a good bet.","fav_salty_score":"-0.654"},{"Hacker_News_User":"prostoalex","favorite_comments":" There is also plenty of room to cut tax expenditures on homeowners, personal retirement accounts, capital gains exclusions at death, and exclusions on annuity investment returns. Let's use today's data and assume no changes in economic behavior.","fav_salty_score":"0.47500000000000003"},{"Hacker_News_User":"smsm42","favorite_comments":"Direct democracy is a very dangerous thing and unchecked can very quickly lead to oppression of minority contingents and minority opinions. And, of course, direct democracy is vulnerable to the base form of corruption in the form of \"vote for us and we'll take money from the other guys and give it to you\".","fav_salty_score":"-0.015"},{"Hacker_News_User":"latch","favorite_comments":"I imagine high. 911 calls.","fav_salty_score":"0.216"},{"Hacker_News_User":"SoftwareMaven","favorite_comments":"I talked with a guy who raised $220k. He saw about 8% of that \"disappear\" in failed charges (things like the card had expired). Of course, anybody can unpledge, but those numbers are reflected in the current total.","fav_salty_score":"2.453"},{"Hacker_News_User":"gizmo686","favorite_comments":"Big /= Good","fav_salty_score":"-0.962"},{"Hacker_News_User":"DanBC","favorite_comments":"I've found the people on Link. respond well to polite questions. I've learnt a lot - mostly when I'm planning something to not worry about the rules and to just ask the person involved.","fav_salty_score":"2.406"},{"Hacker_News_User":"joezydeco","favorite_comments":"YES.  I see all these comments above saying \"man I'm afraid of being totally dependent on gmail\".  Owning your own MX record is the way out of that situation.","fav_salty_score":"1.21"},{"Hacker_News_User":"rwmj","favorite_comments":"\"Money\" only exists because of the organization of government.  If we didn't have any, I could just come on to your land, shoot you, and take all your land and possessions.","fav_salty_score":"0.032"},{"Hacker_News_User":"graeme","favorite_comments":"Great idea! Just bought it. I previously did workarounds such as dragging an entire chrome tab out to move the picture. Got awkward sometimes. You might want to consider not having a free trial. I watched the video, was sold, went to click buy, then saw the trial button. Still went to buy, but  almost clicked the trial out of habit. Edit: Wow, 45 seconds later it's already installed and working seamlessly. Took me all of 1.5 seconds to figure out how to shake on a touchpad, and now it feels second nature. I'll repeat, great work and congrats on getting fireballed.","fav_salty_score":"2.447"},{"Hacker_News_User":"dotBen","favorite_comments":"I never really understood why Oracle forked RH into their own distro, but from this now I can see - it was to essentially demonstrate the cessation of their support of RedHat (given that LE was claiming in the FT piece that Oracle was supporting/helping RedHat at the time) by giving them a little kick in nuts. I think the customers that bought up Oracle Linux were the kind of dumb sheep customers who'll buy anything a vendor pushes them (yes, there are many of those out there). Informed customers not happy with RHEL licensing and support simply swap out to CentOS. It's an interesting examination of customer behavior in fact.","fav_salty_score":"2.055"},{"Hacker_News_User":"burgerbrain","favorite_comments":"Why should they have to?  Why would anyone expect them to do so?  The job market is pretty great for good developers right now.","fav_salty_score":"-1.311"},{"Hacker_News_User":"rdtsc","favorite_comments":"Interesting. Is it for mixed reviews as in total reviews worldwide and Turkey or just for Turkey. It seems it is just for Turkey. Maybe they are just more honest and say why they are giving 1 star reviews. Or maybe they are dishonest and really think the game is terrible but in the comment chose to say something else to seem nice? Is there somehow a disproportionate presence of Turkish Android app developers and since they are competing with you they are just messing with author's head. Looking at the game review in the app store (presumably the US version) most 1 or 2 star reviews seem valid (and don't see a particular trend with names, to mean they are certain ethnicity). A guess it would be good to browser other apps' reviews from Turkey. So I took a look at Cut The Rope. Very popular game, indeed. Looking at US reviews, looks good. Turkish: Link. Hmm, well I can't read Turkish. So I opened Google Translate and started translating a few top 1 star review. And yap, same pattern. === Mükemmel Çok güzel harika bir oyun gözüksün diye 1 --- Excellent Very nice people to see a great game as one === === Gerçekten cok guzel bir oyun hem zeka açıcı Gercekten cok güzel --- Really a very nice game're really nice and intelligence opener === Someone might want to help, but even with Google Translate it looks like they are giving it good reviews as text but 1 star as a score. The crude and seemingly insensitive way is to just prevent Turkish reviewers from commenting. Or even better hellban them and never account for their score. The would correct this pretty quickly I would imagine. Now I would really hope someone from Turkey to explain if there is a cultural or social reason for this. It just seems to strange and odd.","fav_salty_score":"4.869"},{"Hacker_News_User":"snowwrestler","favorite_comments":"Then Amazon will be a very different company under someone else's leadership.","fav_salty_score":"-0.795"},{"Hacker_News_User":"JoeAltmaier","favorite_comments":"I don't believe it. I can see many galaxies from where I stand. They would appear even brighter without a local galaxy to wash them out.  The sky would appear totally covered in fuzzy dots - galaxies.","fav_salty_score":"0.10400000000000001"},{"Hacker_News_User":"rimantas","favorite_comments":"It distracts, no matter if you count or not. And really, if you do a lot of public speaking and respect your audience—do a favor to your audience and try to improve.Sure, audience will bear with almost anything and more so if what you say is interesting—but why make them suffer?","fav_salty_score":"1.978"},{"Hacker_News_User":"david927","favorite_comments":"I agree -- and I think the amount of innovation that would happen would be unprecedented.  I'm deeply disappointed in HN, that it killed this discussion.  This is one of the most important ideas around.","fav_salty_score":"1.009"},{"Hacker_News_User":"kijin","favorite_comments":"If you're referring to the second comment, it seems that he used operators not permitted by OP.","fav_salty_score":"0.885"},{"Hacker_News_User":"MichaelGG","favorite_comments":"And an attack can also modify data. Even \"public\" data, like Wikipedia info, could be valuable to modify. You can attack a user that way by providing misleading information. Or carry out XSS-like attacks. Or just insert spammy links or redirections all over the page.","fav_salty_score":"1.326"},{"Hacker_News_User":"justincormack","favorite_comments":"What a hassle. Just pay more.","fav_salty_score":"1.553"},{"Hacker_News_User":"gaius","favorite_comments":"My flatmate's (at the time) girlfriend (at the time) worked there. But none of us were cybergoths, really ;-)","fav_salty_score":"-1.883"},{"Hacker_News_User":"lobster_johnson","favorite_comments":"Yes, Campfire likes that, too. I'm talking about automated messages, though. What I'd  like is to have a list of project names I am interested in, let the bots use the project names in their messages, and then have the client ping me when something interesting is mentioned. Propane has custom mention support where you can enter a bunch of strings, but it doesn't really work.","fav_salty_score":"1.7770000000000001"},{"Hacker_News_User":"JoshTriplett","favorite_comments":"My university actually requires that I publish my dissertation through a particular electronic publishing agency (UMI/ProQuest), who would like to put it behind a paywall.  I have to pay an additional $95 fee to make my dissertation \"Open Access\".  (Of course, I can and will put it up on my own site, but that doesn't stop the publishing organization from charging people for access to their copy.)","fav_salty_score":"0.59"},{"Hacker_News_User":"darkarmani","favorite_comments":"I'm not sure that understand that freedom of expression is about gov't censorship, and not about professional conduct.  You aren't going to be arrested for \"political incorrectness.\"","fav_salty_score":"1.709"},{"Hacker_News_User":"dfc","favorite_comments":" One thing that’s mysterious, and possibly telling, about Amazon’s job announcement for a “Systems Engineer—Government Cleared” is that the location of this job—Herndon, Virginia—may or may not coincide with the location of the CIA’s own cloud computing centers. This is not mysterious or surprising. Herndon, VA is full of entities doing TS SCI work. It would be mysterious and surprising if the job announcement was in Kohler, Wisconsin.","fav_salty_score":"0.324"},{"Hacker_News_User":"mahmud","favorite_comments":"Tech Shop, there is very little software industry there. It's an industrial town, and there are/were parts of it that are off limits to foreigners. Sure, you can source parts to every gadget and machine you would want to build in Hua Qiang Bey, but there is no tech \"scene\", for lack of a better word, not many locals using their own wares to make new stuff. It's an industrialist city geared toward exports.","fav_salty_score":"3.044"},{"Hacker_News_User":"lmm","favorite_comments":"even signed prints by moderately well known artists are cheap as they are very unfashionable. Sounds like it's a good time to buy them then?","fav_salty_score":"0.001"},{"Hacker_News_User":"icebraining","favorite_comments":"Same here; I do like to keep an archive for myself, but it's safely stored in a truecrypt volume and I don't think I'll ever share that password.","fav_salty_score":"0.779"},{"Hacker_News_User":"rorrr","favorite_comments":"Then how do you explain this? Link.","fav_salty_score":"1.941"},{"Hacker_News_User":"zandorg","favorite_comments":"Or just get a good manager.","fav_salty_score":"-0.92"},{"Hacker_News_User":"astrodust","favorite_comments":"That America does not have a \"Loser Pays\" legal system is completely terrifying. British law, which is followed in various forms by many countries, imposes severe penalties on those that lose cases. The risk for a plaintiff is significant and the damages done to a victim of wrongful prosecution while not negligible are at least off-set by the fees paid by the loser instead of the losing party being able to walk away without obligation.","fav_salty_score":"-0.963"},{"Hacker_News_User":"Someone","favorite_comments":"That would be a privacy invasion, as users, by polling, could figure out who is on each stall, and, from there, how long everybody spends there. It also allows everybody to recreate the detailed log that this system logs. I would be careful deploying even the original indicator because of concerns that it might break some employment privacy law. It is hard to prevent systems from leaking personally identifiable information, especially in cases where data is grouped over a relatively small number of persons, as appears to be the case here.","fav_salty_score":"0.5750000000000001"},{"Hacker_News_User":"mattmaroon","favorite_comments":"A website can grow a lot faster than Moore's law would account for.","fav_salty_score":"0.652"},{"Hacker_News_User":"icey","favorite_comments":"4) Sell _short_ audio ads that play when the timer goes off.","fav_salty_score":"-0.8280000000000001"},{"Hacker_News_User":"rimantas","favorite_comments":"There is much more to HTML5 (or to HTML4 for that matter) than three  elements (those are elements, not tags). You can have your XML with XHTML or HTML5 XML serialization.Oh, but that does not solve the \"flexible\" part, right?Well, you have to choose there — either flexibility or interoparatibility. HTML5 focuses a lot on the latter. What do you want? To have any arbitrary element in your markup? Ok, you get your &#60;foobarbarbaz&#60;/foobar. And then what? What should it mean to everyone else beside you?What do you gain by that?","fav_salty_score":"3.873"},{"Hacker_News_User":"drivebyacct2","favorite_comments":"The new corner restaurant you mention is not going to beat Applebees, but is not going to stick around for too long if nobody goes there to eat either. See: Since they're building on the Android base, their \"success\" or \"failure\" won't look like a conventional console. If the entire thing is a miserable failure, games will still be made for it, because there doesn't need to be Ouya-specific games. If the company ships hardware, then blows up, it'll probably still have games coming out for it, if for no other reason than the fact you can probably root it. Conventional consoles don't have that characteristic. It changes things a lot. I and others have already ordered this that have no intention of ever using it for gaming. But then again, there's also the raspberry PI, Cubox, ODROID-X. This is easily the most consumer friendly so far.","fav_salty_score":"2.521"},{"Hacker_News_User":"dinkumthinkum","favorite_comments":"All this hatred directed at Ron Conway, whom I don't really have any opinion, in a thread about an article Paul Graham wrote that has nothing to do with torture ... This smacks of the kind of inane, conversation drowning behavior of PETA. What is theoretically wrong with the \"ticking time bomb,\" since you wrote that specifically? What is the lapse in logic or the shaky philosophical flaw in the \"theory?\" And then you go and besmirch the whole \"SV wannabe culture\" because they don't have the same thoughtless moral certainty that you do. Reasonable people can disagree and it does not mean one side is evil or one is stupid, necessarily. I think it is a bit much to say Ron Conway is despicable or whatever because of this.","fav_salty_score":"-3.499"},{"Hacker_News_User":"vinceguidry","favorite_comments":"The first time I tried to do this, it forever changed the way I write Javascript.","fav_salty_score":"-0.9380000000000001"},{"Hacker_News_User":"BrandonM","favorite_comments":" You can burn more files to a CD but that takes more than 30 seconds, CDs are 700MB. You can get GB+ USB thumb drives for free.","fav_salty_score":"1.608"},{"Hacker_News_User":"zokier","favorite_comments":"Anyone who is using 12  px font in body text should be butchered imho. For reference 12 pt is approx 17 pixels in 100 PPI, and I think that even it is bit small for body text in web. Also, desktop display tech needs to advance. But meanwhile, yes, please test your font selections with different software and preferably hardware, and ensure that it stays readable. I think all these new tech allowing fancy typefaces has produced at least twice as many horribly unreadable sites than those it has improved.","fav_salty_score":"0.312"},{"Hacker_News_User":"mynameishere","favorite_comments":" She has built her cafe to $8,000 in revenue a week = 416,000/year revenue. Whole different world, I guess. It's completely possible to have an online business for a few $1000/year in costs. And yet this woman isn't turning a profit yet on nearly 1/2 a million in revenue.","fav_salty_score":"3.658"},{"Hacker_News_User":"dfranke","favorite_comments":"Seems like an odd conspiracy theory.  Robo-dialers are nothing new and I haven't noticed any increase in my receiving them.  Any evidence for this?","fav_salty_score":"0.96"},{"Hacker_News_User":"userbinator","favorite_comments":"At the moment it seems like letting the atmosphere burn up debris is the usual procedure, but I wonder how much longer that can be sustained without any significant effects on the atmosphere - it's a somewhat similar concern that stopped us from dumping waste into the ocean and limited the burning of things at ground level and letting the smoke dissipate into the atmosphere. Thus, even if we could somehow deorbit  all the current debris and let them burn in the atmosphere, it might not solve all the problems.","fav_salty_score":"1.698"},{"Hacker_News_User":"warfangle","favorite_comments":" It would more or less make every doctor, nurse, and technician an employee of the US government. Medicare paid out $583bn[0] in benefits in 2013. Total annual healthcare spending in the US $3.8tn[1]. Does that mean each healthcare professional is 15% employed by the government? Not in the least. Northrop Grumman has ~25bn in revenue as of 2012. A majority of its revenue comes from government spending. Does that mean Northrop Grumman employees are employed by the government? You spend $12 on a movie ticket. Is the projectionist employed by you? The box office personnel? The on-set supplier of craft services?  it would remove broad market price discovery from allocation of medical services. Like we have broad market price discovery now? For perfect price discovery, the purchaser of a product must have access to the same information as the provider of a product. Given the average citizen, can they make an informed decision about what the cost of an appendectomy should be? The outrage over the $82,000 hepatitis c cure informs us that no, they don't. And even if they did: is the average healthcare consumer going to refuse to purchase a life-saving drug or procedure because it's too expensive? The purchaser in this situation _has no bargaining power_. They cannot determine whether or not to purchase a life-saving service due to cost! It's buy it or _perish_. For-profit healthcare is a hostage situation. In a hostage situation, market forces are moot. 0. Link.1. Link.","fav_salty_score":"-0.848"},{"Hacker_News_User":"jerf","favorite_comments":"Yes. While I really hate the ignore/laugh/fight/win trope, this was Audi putting Tesla firmly in the fight slot, rather ahead of schedule.","fav_salty_score":"0.111"},{"Hacker_News_User":"redthrowaway","favorite_comments":"Also worse efficiency, more complexity, more expense, and more things to go wrong.","fav_salty_score":"-0.999"},{"Hacker_News_User":"joelrunyon","favorite_comments":"Excellerate was close to #3 or #4 incubator (depending on how you count) in the country before joining the TechStars crew.","fav_salty_score":"0.6940000000000001"},{"Hacker_News_User":"qq66","favorite_comments":"If these are the kinds of problems that interest you, we're hiring at LiveLoop (Link.). We put real-time collaboration inside Microsoft Office, which is used by over 100 million people every day.","fav_salty_score":"0.045"},{"Hacker_News_User":"hga","favorite_comments":"If you were following these sorts of things starting in the '70s like me you'd have noticed it's roots going back to then (the last Nike missiles were decommissioned in the late '70s) and that it was updated to the issues of the '80s, with only the smallest modern gloss like whitehouse.gov added later. Perl did start in 1987 according to Wikipedia but I wonder if it got really big prior to the publication of the Camel Book in 1991 (Link.).","fav_salty_score":"-0.223"},{"Hacker_News_User":"debacle","favorite_comments":"The MLS system is a disaster. Think Alien 2 levels of mucousy, dark and dank ventilation shafts. Zillow has never not worked really well for all of my uses (shopping, price checking, looking at neighborhoods, etc), and it's done so in a way that no other realty website ever has. The reality is that realtors have a huge vested interest in making it more difficult to shop for a house and generally rely on information asymmetry in a massive way. Zillow is a massive blow to that barrier and I hope they succeed. Disclaimer: I've worked for a handful of realtors and with several MLS systems in the past.","fav_salty_score":"2.047"},{"Hacker_News_User":"geuis","favorite_comments":"yet another site that doesn't correctly forward urls when surfing via iPhone","fav_salty_score":"0.67"},{"Hacker_News_User":"Keyframe","favorite_comments":" Also most of my friends with Amigas cared only about Assembly. Of course. I tried to be as brief as possible, not to bother people. Even C had a stigma of being slow back then. Assembly was the language for anything performant, but everybody was aware that in the following years computers will get fast enough (computers, not compilers hah) not to care.","fav_salty_score":"2.552"},{"Hacker_News_User":"swah","favorite_comments":"Agreed, but is it painful. (And yes, I swapped Control with Caps on day one)","fav_salty_score":"0.47100000000000003"},{"Hacker_News_User":"known","favorite_comments":"80 rich people now have as much as 50% of the rest of humanity combined. Link.","fav_salty_score":"-0.023"},{"Hacker_News_User":"x0x0","favorite_comments":"Yet you'll note that things like credit services are, at least in the united states because that's what I'm familiar with, regulated.  You have to be able to see the information and there is a process to contest inaccurate information, with government penalties if the companies don't comply.  And there is enforced forgetfulness: negative credit information is removed from your report generally after 7 years.  I rather doubt google wants to be so regulated; like many internet companies, they want to have their cake and eat it too.","fav_salty_score":"1.685"},{"Hacker_News_User":"lispm","favorite_comments":" A `seq` is anything that implements `first` and `next`, it's a higher level abstraction than `cons` because it frees up `()` and `nil` from `car` and `cdr` [or `first` and `rest`]. See SERIES in Common Lisp.  Link.  At a higher level the abstraction facilitates differentiating a breadth first search tree from a depth first search tree as types of data structures Typically used as CLOS libraries in Common Lisp.  getting rid of `cons` That's caused because Clojure is implemented in something else and doesn't go very deep. Common Lisp goes deeper because it is it's own implementation language. Much of the implementations are written in Common Lisp itself (compiler, parts of the runtime, ...). On something like the MIT Lisp Machine even the garbage collector was written in Lisp. Lisp is reflective building material + machineries + some pre-build stuff. Clojure is more like pre-built stuff on top of some other infrastructure.","fav_salty_score":"1.495"},{"Hacker_News_User":"icebraining","favorite_comments":"What about the Taiwanese businesses that benefit from this type of practice, by having less competition when selling their cheaper phones? I'm sure Acer, Asus and HTC aren't complaining that iPads aren't cheaper.","fav_salty_score":"0.091"},{"Hacker_News_User":"raldi","favorite_comments":"Regarding the messages that used to be in your inbox -- are they  gone gone, like you can't even search for them, even with the in:anywhere flag that makes GMail check Spam and Trash?","fav_salty_score":"-1.0"},{"Hacker_News_User":"ajross","favorite_comments":"I suppose it could be public domain.  Would that be better?  It seems like that opens an entirely different sort of abuse.  Without trademark protection, how do you prevent people from offering \"Olympic\" tickets to non-official events, for example?  No free lunch.  Trademark is the tool society has decided to use for this.  And the only difference between this and any other trademark dispute (like putting an \"i\" before a product name or calling a music distribution company \"Apple Computer\") is in the technicalities of how the mark was awarded. Sorry, I just don't find that interesting.  It's OK to whine about the USOC being jerks, because I agree that they are.  But trying to hold this up as an example of the evils of government is just silly.","fav_salty_score":"2.292"},{"Hacker_News_User":"TeMPOraL","favorite_comments":"SolarFlower.org - the open source solar collector - has a non-electronic sun tracking system that I think might be more efficient than PV-powered tracking. See Link..","fav_salty_score":"1.637"},{"Hacker_News_User":"anigbrowl","favorite_comments":" We didn’t become good at English by studying a chart: we developed an ear for the language and know how it should sound. Unless we grew up speaking a different language, or were born to people who didn't have English as their first language. My wife has been in the US since the age of 2 and speaks perfectly but she still has a few minor linguistic tics that a second-generation native speaker wouldn't, and is she shy if she comes across a word she's not sure how to pronounce or whose meaning is unclear. Having taught English as a second language to people from a wide variety of backgrounds, I don't expect anyone to memorize the royal order of adjectives, but it's incredibly useful for them to know that there  is an underlying system and to match patterns of adjectives from their reading material against it, or play games with it (like thinking deliberately wrong phrases such as 'old little lady' for comic value), or be able to refer to it if they're nervous about writing something. The same is true for people who miss out on a proper education  because of domestic or socioeconomic problems and maybe come to literacy as adults, but never develop the total confidence of someone surrounded by language since birth. Incidentally, those of you who live in California may have noticed the public information campaign encouraging parents to talk and sing to children, especially babies and toddlers. Research indicates that this has a massive influence on brain development and subsequent success or failure in life. See Link. for an overview. So yeah, of course the  best way to acquire language is to be in a linguistically rich environment, and just soak it up to develop an intuitive understanding that promotes linguistic creativity and wordplay, as opposed to studying it through formal methods and turning it into a philological exercise. But that does not mean that formalism is bad, or that we should conceal the existence of systematic structures from kids in case it will wreck their creativity or something - if for no other reason, than to spare them the waste of reinventing the wheel should they be inclined to adopt a formalist approach on their own initiative. It's very easy to handwave away such rigid-seeming pedagogical tools if you already enjoy the benefits of total fluency, but for those who do not enjoy the same advantages this is the equivalent of pulling up the ladder behind oneself and then critique the confused for poor listening skills. I don't have a comment on the math part - I agree with the author that we ought to be open to using multiple learning techniques so that each student can find the best one, but I think he seriously underestimates the utility of formality. When I was 5 I thought chanting multiplication tables every day at school was a bit silly, but 40 years later I greatly appreciate the fact that I can handle everyday trivial math problems reflexively rather than needing to reach for a calculator, pencil and paper, or a mental script of how to perform the calculation. Repetitive drills and formal methods are not the best way to  explain new concepts, but they are incredibly useful exercises to  retain them and make the basic knowledge feel instinctive in later years.","fav_salty_score":"7.38"},{"Hacker_News_User":"ericd","favorite_comments":"We should really stop using Compete as evidence for anything. Not only are they frequently an order of magnitude off, they're oftentimes not even directionally correct in their movements. Other than that, your points are valid, especially wrt affiliate based companies.","fav_salty_score":"-0.9470000000000001"},{"Hacker_News_User":"keithpeter","favorite_comments":"Link. Situation in UK not clear, most police action is around cautioning people doing strange things with laptops in parked cars. Responding to complaints. Given current security levels in UK coming up to Olympics, any use of communications kit like this in a moving vehicle would need to be really upfront, or you had better have a good story when stopped.","fav_salty_score":"0.28500000000000003"},{"Hacker_News_User":"notahacker","favorite_comments":"That's open to debate. Inequalities of income distribution are pretty visible anyway: whether discussion of the topic exacerbates people's unhappiness with the situation depends whether discussion of the topic helps them reconcile themselves to the normality of being unable to keep up with the Joneses, or whether it makes them feel angrier and more impotent than they actually are.","fav_salty_score":"-1.927"},{"Hacker_News_User":"FireBeyond","favorite_comments":"Well, technically, nothing was censored. So \"anything\" was asked. Now if it was \"Answer Me Everything\"...","fav_salty_score":"-0.852"},{"Hacker_News_User":"yuhong","favorite_comments":"IE6 did not ship a JS debugger at all, actually. You needed Microsoft Script Debugger or Visual Studio.","fav_salty_score":"-0.42"},{"Hacker_News_User":"Tycho","favorite_comments":"The reason stated for why trickle down economics isn't working is a non-sequitur, kind of undermines the credibility of the rest of the article. As to the main premise, I mean, open source is obviously a huge bonus to all the freelancers and startups and indie devs, not to mention the proliferation of Android smart phones. I think it clearly is 'trickling down', maybe just not as  totally as the author would like.","fav_salty_score":"-0.594"},{"Hacker_News_User":"nailer","favorite_comments":" I consider Erlang an obscure language but I'd bet that most people do not. Me too, but Elixir's going to be massive and may take Erlang with it. It feels like the first year of node coming out.","fav_salty_score":"1.002"},{"Hacker_News_User":"mattmaroon","favorite_comments":"This site has the exact same problem as AdultFriedFinder, which is that no woman needs it. If one really wants some NSA relations, all she has to do is go to a bar, rather than publicly post her picture on the net where anyone (including her husband) can find it. I suspect both of those sites are almost entirely men chasing fake accounts.","fav_salty_score":"0.912"},{"Hacker_News_User":"dpark","favorite_comments":"I don't see how this is valuable.  By definition a peering contract is not staying inside Comcast's network.  The bandwidth for this (if Comcast were selling it) would stay entirely within the network, where it's not significantly competing with peered traffic. Maybe I'm misunderstanding what you're suggesting.","fav_salty_score":"1.701"},{"Hacker_News_User":"pygy_","favorite_comments":"Yes, it's _why who coined the word.","fav_salty_score":"0.999"},{"Hacker_News_User":"tikhonj","favorite_comments":"Yeah, most of this is just drawing conclusions from what is essentially noise. Especially the consistency measure: that's bound to be heavily affected by how many people use a given language. The so-called \"tier 1\" are not popular because they're consistent--they're consistent because they're popular. The same goes for the tier 3 languages in reverse: they probably have so little activity that a high variance is inevitable. Also, number of lines per commit is not really a good measure of expressivity. I don't even see how it's a reasonable proxy: the number of lines I commit changes more depending on my project (is it simple or complex, for work or for fun?) than on my language. Also, it makes literally no sense at all to consider very domain-specific languages like puppet: you may as well talk about how expressive HTML or CSS are relative to normal programming languages! Basically, I think this article draws too many arbitrary conclusions on limited data.","fav_salty_score":"3.146"},{"Hacker_News_User":"shin_lao","favorite_comments":" Eating for enjoyment is one of the best pleasures in life. Please don't take this the wrong way, but I really think this is a sad statement and I truly hope one day you will understand why I think so.","fav_salty_score":"2.0"},{"Hacker_News_User":"peterwwillis","favorite_comments":"They already expanded into a DC in Chantilly, one more in Ashburn and I believe one in Manassas. But they lean on Ashburn for everything they do, and a small problem results in a daisy-chain failure (which because everyone uses Amazon for every service imaginable, means even the smallest problem takes down whole websites)","fav_salty_score":"0.09"},{"Hacker_News_User":"marcosdumay","favorite_comments":"IDEs aren't bad, but... Automatic code generation is bad (unless its completely automatic in \"you don't ever see it\"), because code always have to change, and changes aren't automatic. Heavyweight building setup is bad, because you can not replicate or automate it. Long names everywhere hinder legibility. (Although long names on confusing or ambiguous places are a good thing.) And, finally, people learning to program should learn how to program without one at some point, so they know what they are doing. None of that makes IDEs bad. It just neuter their biggest selling points, but there are lots of small gains you can get from one.","fav_salty_score":"4.079"},{"Hacker_News_User":"philwelch","favorite_comments":"It's a local thing. Australian McDonalds might actually be OK. But it's also a question of alternatives, and in most cities (not suburbs) at lunchtime near where people work, there are a plethora of better options than McDonalds.","fav_salty_score":"2.819"},{"Hacker_News_User":"yummyfajitas","favorite_comments":"Assuming you mean stop loss orders, HFT's don't use them. Idiot retail investors do. I have no idea what the rest of your comment is talking about.","fav_salty_score":"0.838"},{"Hacker_News_User":"nkassis","favorite_comments":"Check out wikipedia's page I just noticed they have the algorithm spelled out in pseudocode ;p Link. What baffles me is did they really have to rewrite that again somewhere else? Don't they have libraries in whatever language they are using with something to do the date calculations they need?","fav_salty_score":"0.24"},{"Hacker_News_User":"tptacek","favorite_comments":"You might be interested in receiving my newsletter; it's called \"the world needs a secure-by-default and easy-to-use crypto library\". :)","fav_salty_score":"0.099"},{"Hacker_News_User":"jellicle","favorite_comments":"And most of the the rest own an absurdly tiny amount, like a few hundred dollars in a 401k plan. A venture capitalist trying to get legal changes made by putting on a faux-populist claim of \"it's for the middle class\" is vomit-inducing.","fav_salty_score":"1.5510000000000002"},{"Hacker_News_User":"dmix","favorite_comments":"Excellent reply, reading through a couple of the links. Comments like these remind me of HN of the past.","fav_salty_score":"1.9689999999999999"},{"Hacker_News_User":"moe","favorite_comments":"Not true. FuzzyFinder  does search recursively. It can, in fact, search pretty much anywhere in vim (from the docs): <pre><code>        - buffers         - files         - directories         - most recently used files         - files around most recently used files         - most recently used command-lines         - bookmarked files         - bookmarked directories         - tags         - files which are included in current tagfiles         - jump list         - change list         - buffer lines         - quickfix         - help</code></pre>","fav_salty_score":"-0.736"},{"Hacker_News_User":"harryh","favorite_comments":"\"Uncooperative weather has farmers off to slow start getting nation's corn crop in the ground\" Link.","fav_salty_score":"-0.981"},{"Hacker_News_User":"threeseed","favorite_comments":"Be serious. Go through your chat history and see how many times you just replied OK or NO to a message. It's at most like 5%. The predictive algorithm is good at many replies but Apple still needs a solution for answers to quick texts like \"what do you want for dinner\". Drawing on the screen, letter by letter similar to what Palm originally use do would be a massive improvement.","fav_salty_score":"4.8469999999999995"},{"Hacker_News_User":"nodata","favorite_comments":"\"For obvious security reasons we cannot say what these measures are.\" Rubbish. Anyone know that the measures are?","fav_salty_score":"1.087"},{"Hacker_News_User":"joelrunyon","favorite_comments":"1. Is there any proof that it was a TSA agent? Seems like he assumed that. 2. Can the TSA actually even \"setup\" anyone like this? I thought they were stuck at the security lines. I didn't think they roamed the airport, unless they were with dogs (and especially didn't think they go \"undercover\"). 3. It doesn't seem like he ever got confirmation from them that they were actually TSA. 4. It seems to me that it's more likely he ran into someone who had more extreme, right-sided views than an actual \"set-up.\"","fav_salty_score":"-4.836"},{"Hacker_News_User":"freehunter","favorite_comments":"Think about services like OnLive (who even offers Windows in the cloud). We have these today, but if we had fiber everywhere, we likely wouldn't have the dvd drive in the Xbox 360. We certainly wouldn't need BluRay.","fav_salty_score":"-0.541"},{"Hacker_News_User":"dragonwriter","favorite_comments":" What scares me about government, both in the US and abroad, is not the polarization of parties, but how quickly the dominant ideologies cycle from left to right I think you may be conflating shifts in fairly narrow political majorities with shifts in \"dominant ideology\".","fav_salty_score":"1.0"},{"Hacker_News_User":"wpietri","favorite_comments":"If only there were some way we could compare large groups of people. Maybe we could have a federal agency that does that. It sounds pretty useful; maybe we should put that in the constitution. Snark aside, 26% of Miami has Bachelor's degrees. San Francisco county is 51%. Marin, 54%. San Mateo county, 46%. Source: US Census, by way of Link.","fav_salty_score":"1.706"},{"Hacker_News_User":"jacquesm","favorite_comments":"True, genetic algorithms are definitely a step in the right direction. There is the one famous example of the filter circuit where even the designers of the software couldn't figure out how the damn thing worked, but work it did. Parts connected in the weirdest ways and if you took them out the circuit stopped to function. Apparently the genetic algorithm had in its feeback loop discovered some none-trivial parasitic effects of some components. No sane designer would have done it that way, but that's beside the point because the filter had less parts than any designed by humans directly. I'm very strongly a believer in the material consciousness, The emperors new mind was an interesting read but I found it to be a tremendous buildup to an almost magical reliance on quantum mechanics to provide us with our consciousness. I don't have much with magic so I'll stick with regular physics and chemistry until it has been proven otherwise. There are too many brain-computer analogies to avoid the strong suggestion that the brain computes. It doesn't do it in a way that we can hook up a debugger to just yet but it does seem to have a lot in common. It's more of an architecture/interface problem. But strong AI probably won't come from being able to interface with the brain or from a sudden leap of insight in how it all works. I think strong AI will follow from a seed AI which in turn will follow from some relatively simple breakthrough or insight that we still haven't gotten around to. The simulation of the cortex of simple mammals is another such step in between, do you have a reference for that ?","fav_salty_score":"3.212"},{"Hacker_News_User":"slantyyz","favorite_comments":"I've worked with architecture astronauts before. We were a bootstrapped startup, and the need to use bleeding edge tech (our product was hardly rocket science) reinvent the wheel (hey, look at this - I spent a week and created my own grid control!) and a general need to overengineer seemed to blind the astronauts from the fact that if we didn't have anything to sell, we were going to run out of money in a matter of one or two months. We were \"using\" agile, and the lead engineer's approach to test cases was \"well, if the function failed the test, let's just change the test to make it pass\". Sheesh. Needless to say, the company struggled to meet payroll for an extended period time since we couldn't release anything to generate revenue.","fav_salty_score":"0.9490000000000001"},{"Hacker_News_User":"TallGuyShort","favorite_comments":"Yes but what's the correlation like for other common stores? I've lived in a lot of different towns in the US and every single on of them has had a Home Depot in town. They've also all had a Target. I'd be curious to know what that correlation looked like.","fav_salty_score":"2.03"},{"Hacker_News_User":"IgorPartola","favorite_comments":"Somewhat. Having been there and back, it's not so clear cut. There are really two jobs here that need to be done: Team manager a.k.a. office mom. Someone who is a lot like the band manager. He doesn't know C from HTML but knows that developers needs snacks, juice boxes, headphones, fast computers, and 4k monitors. He takes care of the \"crap political work\" and keeps developers busy with what they do best. Project product manager. This is someone who may or may not be the technical lead, but definitely needs to understand how software is put together, who on their team will be doing it, how long it will take, etc. The job of this person is to translate business requirements (\"We need feature X shipped by March, and bug Y fixed immediately.\") into technical tasks, timelines, and assignments. It's also possible that this is the person responsible for figuring out which features the product should have (no developers shouldn't always be the ones deciding this). This job is  hard. You are responsible for setting realistic goals and not letting anything drop, but you are also responsible for moving the project fast, and not getting stuck. The first job is more tactical. We know that developers constantly distracted by noise or going to be unproductive, etc. The second job is strategic. It requires a crystal ball to predict which bugs will come up and where the difficult bits of implementation will be. This isn't booking buses and switching out blown amps. Managers that can do this job alone, or even both at the same time are worth their weight in platinum.","fav_salty_score":"10.913"},{"Hacker_News_User":"digi_owl","favorite_comments":"I find myself thinking of a grassy field swaying in the wind. I wonder if they should try painting them deep green or something.","fav_salty_score":"0.036000000000000004"},{"Hacker_News_User":"vinceguidry","favorite_comments":"Leonardo existed in an age where the key players were few and everyone of import knew each other. He didn't have to recite past accomplishments, because all the people he was writing letters to already knew what they were. Had he been an unknown nobody, he'd have had to bring additional context to his appeal for employment just like everyone else.","fav_salty_score":"-1.255"},{"Hacker_News_User":"jdp23","favorite_comments":"Totally agree, and kudos to you for saying no.  When I was at Microsoft, I refused to work on things related to Digital Rights Management, which I find abhorrent.  Of course everybody has to make their own decisions about just where the line is (some people would say I had already crossed over just by working for Microsoft) but in the end you have to live with yourself so don't do things that compromise your integrity, however you see it.","fav_salty_score":"0.726"},{"Hacker_News_User":"joezydeco","favorite_comments":"How do we verify the internal microcode and switch fabric of the TI CC2531? IMO it seems like simply trusting the large block diagram that says \"USB PHY\" is a very weak point in the design.","fav_salty_score":"-1.988"},{"Hacker_News_User":"cpeterso","favorite_comments":"Why seize the  domain names when they could nab the  people behind the domain names selling counterfeit merchandise?","fav_salty_score":"-0.994"},{"Hacker_News_User":"petervandijck","favorite_comments":"Learn how to type with two hands. It won't take long. (Unless you actually only have one hand, of course.)","fav_salty_score":"1.002"},{"Hacker_News_User":"tocomment","favorite_comments":"Does anyone know why these kind of things always seem to need a scaffold?  When our original teeth grew there was no scaffold needed.  Why can't we trigger that kind of growth?","fav_salty_score":"0.855"},{"Hacker_News_User":"JoeAltmaier","favorite_comments":"\"What's so great about your new software?\" \"Its big, slow, late and expensive!\"","fav_salty_score":"0.364"},{"Hacker_News_User":"thaumasiotes","favorite_comments":"The hospitals do have to pay for medical school. If they didn't, nobody would go through it. Here's a cleaner example: suppose getting an M.D. required a filing fee of $800,000. You don't think that would show up in what hospitals paid doctors?","fav_salty_score":"0.162"},{"Hacker_News_User":"Mikeb85","favorite_comments":" A lot of good talent is wasted on Wall Street. Why do you say that?  Finance funds most of society's ventures, the 'system' would look much different without the capital and services that the banking sector provides...","fav_salty_score":"0.9430000000000001"},{"Hacker_News_User":"andrewcooke","favorite_comments":"Effective Java is the best book for general Java that I know - Link.  It's not a tutorial, but a collection of recommendations that could take you from just-learnt to competent. Very slim, and very good - Javascript: The Good Parts Link. For a C reference, Harbison &#38; Steele is excellent - Link.","fav_salty_score":"2.391"},{"Hacker_News_User":"untog","favorite_comments":" Moreover, I don't see what Firefox OS brings that Android cannot do... Well, it has a decent WebView, for a start. It's damn near impossible to make a responsive webapp on Android, the WebView is awful. iOS isn't perfect, but is order of magnitudes better. Why Apple and not Google are pushing this, I have no idea. Google are supposed to be all about the web.","fav_salty_score":"-1.794"},{"Hacker_News_User":"elwell","favorite_comments":"Exactly. Could use a PDF link at the beginning.","fav_salty_score":"0.254"},{"Hacker_News_User":"tzs","favorite_comments":" The USPTO can, and should, exclude software from patent eligibility on other legal grounds: because software consists only of mathematics, which is not patentable, and the combination of such software with a general-purpose computer is obvious. Software does not consist of only mathematics. One might use mathematics as part of understanding how a particular piece of software works, but that is not really different than the way one might use mathematics to understand how an electronic circuit works.","fav_salty_score":"2.606"},{"Hacker_News_User":"swah","favorite_comments":"Is LuaJIT bytecode a good target for toy languages?","fav_salty_score":"-1.0"},{"Hacker_News_User":"eru","favorite_comments":"Do I spot an Austrian?","fav_salty_score":"0.839"},{"Hacker_News_User":"sliverstorm","favorite_comments":"Naturally, but that doesn't change the fact that distant threats are less fearsome than immediate ones, and that abstract threats are also less fearsome. To be clear, when I say \"abstract threats\" I mean things we cannot properly think about. We know what it feels like to get punched, and we have some idea what it feels like to be stabbed, but we have no idea how to assign fear to something like chemotherapy until it happens to us. We know it is Bad(tm), but not the same way we know getting cut with a knife is bad.","fav_salty_score":"-3.3"},{"Hacker_News_User":"jacques_chester","favorite_comments":"Do you have hot and cold running nonsense where you live? Selling to Australians takes place in Australian dollars and the transactions are cleared by Australian banks. This makes them pretty easy to get a legal grip on. And you will also find that the large companies who are doing most of the price discrimination have local subsidiaries which can be dragged into court without too much fuss. If they try something like yanking funds to avoid court judgements, they're violating various laws and privileges and our government can and would be able to seek enforcement from courts in the USA. People think that trading across boundaries gives you magical immunity from national laws. It doesn't. Where you have a nexus with a country, you can be enforced against through that nexus. Where the laws are similar, brother courts will typically reciprocally enforce them.","fav_salty_score":"1.176"},{"Hacker_News_User":"scott_s","favorite_comments":"Circle 3 is saying that's how big the moon would look like if it was actually proportionally sized to the cloud, and actually \"in the sky\" as opposed to be 238,000 miles away. Basically, the argument here is that we judge the size of things in the sky under the assumption that they are  in the sky. But the moon is not; it does not follow the perspective rules of things that are actually close to us. The figure is saying that when we see situation 1, our brain  assumes situation 3 will hold.","fav_salty_score":"0.232"},{"Hacker_News_User":"davidw","favorite_comments":" That's Krugman's answer for everything. Increase spending. Just like articles from reason.org or cato or mises invariably decide the problem is too much government. Which is why articles like this are best left to other sites.","fav_salty_score":"-1.5"},{"Hacker_News_User":"lukifer","favorite_comments":"Funny that it's illegal to explicitly coerce your employees to vote a certain way, but perfectly legitimate to implicitly threaten your employees' livelihood based on election results. Also, he seems a little confused as to whether he's upset as a business owner over taxes and health care, or as a wealthy individual who fears class warfare (\"people that overspent their paychecks suddenly feel entitled...\", etc). The former  might have some legitimacy in terms of hiring costs (though I suspect the numbers are overblown); but the idea that the latter would affect hiring is laughable. Business owners hire people for exactly one reason: that they can make more money from an employee's labor than what they pay out. The idea that a move from a marginal rate of 36% to 39% would mean no longer wanting to make money  at all is simply absurd.","fav_salty_score":"-4.414"},{"Hacker_News_User":"hkmurakami","favorite_comments":"I'd hypothesize that Yahoo can (potentially) get hires who they wouldn't have been able to hire with just money by having a different value proposition subset through Tumblr.","fav_salty_score":"-1.0"},{"Hacker_News_User":"mjn","favorite_comments":"This is a good example for Paul Graham's \"middlebrow dismissal\" data set. Generic negative comment about the subject of the article that could be copy-pasted into any article matching a \"Wikipedia\" string search by a bot.","fav_salty_score":"-0.044"},{"Hacker_News_User":"nl","favorite_comments":"This is a problem Samsung has replicated with their SmartTVs. Turn on SmartHub, and 30% of the time it insists on an update. Then randomly sometimes it updates in the background with a popup notification when it is done. Useful platform, but really annoying in that regard.","fav_salty_score":"-0.052000000000000005"},{"Hacker_News_User":"cpeterso","favorite_comments":"It's convenient for them that their server-side opt-out code cannot be audited. It would have been easier for them to just set an anonymous, client-side opt-out cookie.","fav_salty_score":"-1.451"},{"Hacker_News_User":"pessimizer","favorite_comments":"My guess on why you're being downvoted is because this very long comment starts with the sentence: \"It seems to me that Greenwald is assuming his own conclusion here, that the chat logs provide evidence of Manning's innocence.\" I don't remember Greenwald ever claiming or even giving off a vibe that he didn't think that Manning was the leaker; this is a media critique, like most of his work. Doesn't bode well for the next 1400 words.","fav_salty_score":"0.849"},{"Hacker_News_User":"pg","favorite_comments":"IMO too.  Though a product that has hundreds of genuine (= highly active) users can't be that poor.","fav_salty_score":"-0.10200000000000001"},{"Hacker_News_User":"borism","favorite_comments":"\"Do you use the data?\" - what kind of ethical question is that? This is purely scientific question, has nothing to do with ethics. There are just some things that are not ethical, like testing on people, or killing civilians or, you know, torture. Doesn't matter if you got some positive data point out of that. Those things are simply not justifiable.","fav_salty_score":"1.576"},{"Hacker_News_User":"mistercow","favorite_comments":"This is really cool. It seems to me that what browsers really need in order to unlock huge amount of potential in high performance graphics is an API for hardware accelerated DSP operations like FFT.","fav_salty_score":"-0.05"},{"Hacker_News_User":"nextparadigms","favorite_comments":"Same here, couldn't fully download some files from Gmail.","fav_salty_score":"0.75"},{"Hacker_News_User":"gnosis","favorite_comments":"Previously: Link.","fav_salty_score":"0.872"},{"Hacker_News_User":"arethuza","favorite_comments":"I like Walk Highlands - but it's only for Scotland: Link. and Geograph: Link.","fav_salty_score":"-0.55"},{"Hacker_News_User":"dang","favorite_comments":"Thanks for expressing this better than I could.","fav_salty_score":"1.0"},{"Hacker_News_User":"nostrademons","favorite_comments":"The other interactions do, though, eg. the results changing as you drag the map.","fav_salty_score":"0.9"},{"Hacker_News_User":"rdl","favorite_comments":"What is \"significant\"?  $100?  $500?","fav_salty_score":"-0.28300000000000003"},{"Hacker_News_User":"pron","favorite_comments":" But how does it make sense to you that a platform written in C can produce results faster than C is capable of? It's actually quite easy. Now, of course for every Java program there exists a C++ program that performs at least as well – proof: the JVM – but that doesn't mean that that program could be written by humans at acceptable cost. The JVM does a lot of optimistic inlining that's simply not possible in C C++ (in those languages you'll need to write the same code lots of times).","fav_salty_score":"-1.919"},{"Hacker_News_User":"tptacek","favorite_comments":"Spent several years in San Francisco. Hated it. Moved back to the midwest (Ann Arbor, then back home to Chicago). What don't I like about SFBay? With the caveat that it's been almost 10 years since I lived there, let me make you a list: * It's expensive. What that means is, you have fewer options on where to live, and the options aren't as nice. * Apart from tacos, the casual food options are much worse. Concrete example: where do you go for late dinner after a show, besides a diner in the Castro and Mel's? * There are very few decent music venues. Among my many complaints about SF, this is one that appears to have gotten much worse since I left; read JWZ's blog on SF's \"war on fun\". * It is impossible to catch a cab. * It is very difficult (and dangerous) to park. My car was towed in San Francisco and lost by the city for over a month. * San Francisco is deceptively small. Deceptive, because SFBay is a major metro area that happens to sprawl from a small urban core. What this means is that many of your friends who ostensibly live in the same \"place\" as you are actually an hour's drive each way to get to. * Similarly, many (technically, most) of the jobs in the \"area\" are actually a 1+ hour commute  each way from your house. At the time, I didn't know  anybody who took the train from San Francisco to South Bay; maybe that's changed, but my perception is everyone just drives and puts up with the horrible commute. 280 sure is pretty sometimes, though. * It's filthy. I've been back recently and know this to still be true: San Francisco has a maintenance problem, and it's different and worse than Manhattan. Manhattan feels like you're always picking your way through someone's gigantic cluttered basement. This alters your expectations of the environment and makes bags of garbage on the street easier to take. San Francisco is flat and open and that makes the piles of human feces somehow harder to take. * Public transportation in San Francisco, is a joke compared to NYC or Chicago or even Seattle. It achieves Houstonian levels of walkability despite a miniscule footprint. * The Haight and the stretch of Golden Gate Park right off the Haight is disgusting. I'm in favor of legalization, but if we're going to do it with red light districts, we should at least cordon them off and make that clear. * Too much of San Francisco is a tourist trap. Every big city has tourist areas, but it's more painful in San Francisco because the city is so small. In NYC and Chicago there are  actual Italian restaurant neighborhoods and they aren't full of frat boys. * San Francisco doesn't have neighborhoods like other cities do. People tend to counter this by saying \"but the inner sunset is totally different from the outer sunset\". When's the last time they had a block party? How many of their neighbors have they entertained in their houses in the last year? * There are no seasons (ok, there's \"grey\" season and \"yellow\" season). It's about to be Autumn here in Chicago. Autumn in the midwest is amazing and I missed it, a lot. * Everyone's in tech. This makes the social scene boring and incestuous. Also, unless you build products that serve the echo chamber, it makes it harder to sell to companies, because the industries in San Francisco aren't diverse. I'm trying hard with this list not to ding San Francisco for things that other cities excel at. It's not reasonable to hate a city for not meeting the highest bars set by other cities. For instance, fine dining in San Francisco is, if you properly exclude Yountville from your definition of \"San Francisco\", simply not as good as NYC or even Chicago. San Francisco doesn't have world-class museums. It doesn't have a noteworthy theater scene, or (to my knowledge) excellence in any of the performing arts. But then, Chicago doesn't have redwood forests or beaches you can set bonfires on with no notice.","fav_salty_score":"8.597"},{"Hacker_News_User":"Retric","favorite_comments":"It's much simpler to track and predict the position of objects orbiting the earth than moving though the atmosphere.  Wind, temperature gradients, particulate matter, mist, etc add a lot of uncertainty to the predictions. PS: As you increase accuracy more things become important factors.  Large Ship guns actually started to track things like temperature at different altitudes to increase accuracy.","fav_salty_score":"0.08"},{"Hacker_News_User":"ZeroGravitas","favorite_comments":"That the UI is important and hard work a standard opinion for Gruber and Apple fans generally (myself included). This particular article is about how Open Source software cannot achieve this, mostly due to limits placed on it by Gruber's own stereotypes. Why can't it be commercial? Why can't it hire UI guys with training and insight. In fact it does both these things.","fav_salty_score":"0.209"},{"Hacker_News_User":"tptacek","favorite_comments":"I do indeed have the impression that anyone who would bring up Golang's name as a serious flaw would also believe that C's name has held it back as well.","fav_salty_score":"-0.996"},{"Hacker_News_User":"drcode","favorite_comments":"Maybe I'm just an outlier and it works well for other people.","fav_salty_score":"0.9400000000000001"},{"Hacker_News_User":"ErrantX","favorite_comments":"Oh... I see. It confused me for a second whya 22 hour old post was top of my home page with other randomly ordered stuff below it. I dont think they have their algorithms right to be perfeclty honest; currently top of my list is a popular status update (4 likes, 9 replies) from a person I barely know and with whom I have no (Facebook) friends in common. Hmmm. Anyone figured out a way to set it to Live Feed by default again?","fav_salty_score":"0.35000000000000003"},{"Hacker_News_User":"yummyfajitas","favorite_comments":"Mathematical identity: <pre><code>    price to own = price to rent + speculative ownership premium + transaction costs</code></pre>If you rent, you get to keep that speculative ownership premium and the transaction costs. An additional problem with owning is that your investments are bound to your living situation. Orthogonality is good. I can change my living situation without even thinking about my investments.","fav_salty_score":"-0.215"},{"Hacker_News_User":"kenjackson","favorite_comments":"Many of them can be done remotely, as has been done at Pwn20wn for several years on OSX. But to actually create a weaponized attack that can get on a lot of machines requires a fair bit of work.  If you're going to do that, it's probably worth going the extra mile and attacking a much larger installed user base. But, what's even easier is just doing malware that the user installs. You can write it in a fraction of the time, and you probably get similar infection rates.","fav_salty_score":"-0.515"},{"Hacker_News_User":"ahoyhere","favorite_comments":"There's lots and lots of research out there that meditation increases insight, memory, improves sleep, reduces stress, reduces the physical perception of pain, improves, well, just about everything. Useful refs: Link.  (the Audio CD set is even better, imo, with actual dialog) Link. Link. My favorite intros to secular meditation (that is, non-religious Buddhism): Link. Link. Link. Doing what I learned in from three, plus the Destructive Emotions audio book, absolutely transformed my life. Like night and day. Now I'm one of the best-adjusted people I know, despite having gone through (and, in a few cases, done) some horrendous things. What mindfulness meditation teaches you, above all physical side effects, is to accept things as they are. That doesn't mean you shouldn't try to change them, if they're truly bad, but most people deny what is reality. As if that helps. (I sure did.) But denying just hurts more, doesn't make it untrue, of course, and denial makes it impossible for you to improve things. I think most of the troubles in life are caused by denial. And, bonus, the level of mindfulness makes it easy for me to spot user interface/process (and therefor product) opportunities because I almost never just \"tune out\" and work on autopilot.","fav_salty_score":"10.698"},{"Hacker_News_User":"lisper","favorite_comments":"Interesting.  My question has been downvoted.  But it has not been answered.","fav_salty_score":"2.658"},{"Hacker_News_User":"tomjen3","favorite_comments":"Worst mobile experience I have had in a long time.","fav_salty_score":"-1.0"},{"Hacker_News_User":"TeMPOraL","favorite_comments":"Indeed that happens. But it's still not annihilation[1], it's just a conversion of relativistic mass (which comes from energy of nuclear bonds) into kinetic energy. [1] - Link.","fav_salty_score":"0.717"},{"Hacker_News_User":"pg","favorite_comments":"Interesting question.  Probably one reason there are a lot more hacker/musicians than hacker/painters is that there are a lot more musicians than painters.   Painting is not exactly a flourishing field at the moment.  But there are a significant number of hackers who are good at graphic design. The thing I was saying hackers and painters had in common was that they're both makers.  As opposed to the idea prevalent when I was in college, that programming was applied math.  I believe it was in protest against this idea that Knuth called his books  The Art of Computer Programming.","fav_salty_score":"4.908"},{"Hacker_News_User":"robryan","favorite_comments":"I did some analysis[1] on this for 2 merchants we send traffic to, admittedly it's not in exactly the same space the buying trends would probably be similar. The merchant with a longer history of data has 59% in the first 24 hours meaning you would be missing out on 41% of sales. This is a trend I have noticed with affiliate programs, the closer a company comes to market saturation in a space the worse the terms get. It makes sense has had the blog post not provided links there is a good chance people will head over to amazon anyway. [1]Link.","fav_salty_score":"1.673"},{"Hacker_News_User":"masklinn","favorite_comments":" It would be nice for code to \"know\" whether it's within a go block or not. Part of it obviously does since `&lt;!` can't be called outside of a go block. And cljs has somewhat less of an issue there as it does not have `&lt;!!` (since without extension the language has very little allowances for blocking)","fav_salty_score":"-0.9510000000000001"},{"Hacker_News_User":"warfangle","favorite_comments":"That doesn't avoid hoisting though ;)","fav_salty_score":"-0.84"},{"Hacker_News_User":"SixSigma","favorite_comments":"The beauty of Inferno is that one of the incarnations happens to be an operating system that runs on bare metal. But  the very same code can be run as a command line program in Windows   OpenBSD   OSX   Linux. Or as a multi-windowed program like an MDI or a single window, or a full screen window in kiosk mode, or as a network service on IBM's Blue Gene. Inferno is used by IBM, NASA, Alcatel-Lucent, the US DoD.","fav_salty_score":"1.979"},{"Hacker_News_User":"Retric","favorite_comments":"I get that and I liked the post. However, I have seen plenty of blog posts that used this to link to posts on other sites and it seems to work well.","fav_salty_score":"0.079"},{"Hacker_News_User":"tptacek","favorite_comments":"No, he didn't. That's an Internet meme, not a revealed truth. The USG may very well be abusing SIGINT to profile the whole US population, but it is not true that they're doing that openly.","fav_salty_score":"1.3"},{"Hacker_News_User":"GFischer","favorite_comments":"Well, you might have heard the story about how C creator Ken Thompson was asked to take a mandatory language test at Google before being able to check-in code :) Link.","fav_salty_score":"-0.664"},{"Hacker_News_User":"Zigurd","favorite_comments":"Excellent explanation. CDSs are insurance. So why can't you buy the equivalent product from an insurer, labelled and regulated as insurance? Because the capital requirements under insurance regulation would have been prohibitive. So why weren't the banks charged with illegally selling insurance products and or violating insurance regulations? Because fuck you, peon.","fav_salty_score":"-0.049"},{"Hacker_News_User":"pjmlp","favorite_comments":"Quite good results, given that Rust is still quite a young language.","fav_salty_score":"1.0"},{"Hacker_News_User":"tibbon","favorite_comments":"I've encountered more than one C-level person having absolutely terrible communication skills.","fav_salty_score":"0.79"},{"Hacker_News_User":"Karunamon","favorite_comments":"So it's a business. So it's policy. Those are not defenses. A CA profiting from a vulnerability is a fairly perverse incentive, too.","fav_salty_score":"1.195"},{"Hacker_News_User":"pbreit","favorite_comments":"I hate the way LinkedIn handles criticism. Most of the discussion I've seen has centered on the concept, not the implementation. Instead of trying to allay concerns about the concept, LinkedIn spends the whole, defensive post chiding commentators for \"inaccuracies and misperceptions\" and proceeds to humblebrag about how thorough its security precautions were.","fav_salty_score":"0.993"},{"Hacker_News_User":"falcolas","favorite_comments":"As does nagios' http check with the -c option. Basic monitoring helps solve so many problems.","fav_salty_score":"2.0"},{"Hacker_News_User":"mindslight","favorite_comments":"You were able to use marijuana as an example because legalization of it is considered a reasonable opinion. This is only possible due to its existing prevalence, which is only due to the brave/stupid people risking their lives to distribute it  in spite of the fiat against it. Reality drives the model, not vice-versa.","fav_salty_score":"-1.275"},{"Hacker_News_User":"lotsofmangos","favorite_comments":"Maybe if you have no dependents and never get ill. If you have a family to support or have a period of illness, credit is very hard to avoid.","fav_salty_score":"-1.971"},{"Hacker_News_User":"tikhonj","favorite_comments":"In practice, a sufficiently low probability is indistinguishable from 0.","fav_salty_score":"-0.998"},{"Hacker_News_User":"scotty79","favorite_comments":"I get that calories leave body in various forms but they get inside just in one. And if you eat less calories than you loose then you are bound to loose weight. No matter what crap you eat. It might not be pleasent. It might not be healthy but I think that it's almost surely more healthy than gut surgery and by transitivity than staying obese.","fav_salty_score":"-0.807"},{"Hacker_News_User":"unimpressive","favorite_comments":" Gosh I feel snarky today :)! No, your post is pretty on point. I think everyone here feels this way to an extent. Don't be sated by your dreams; reality feels better.","fav_salty_score":"1.48"},{"Hacker_News_User":"tptacek","favorite_comments":"Aroo? OpenSSL is usually a terrible place to pull crypto primitives from; the string \"OpenSSL\" in a Python or Ruby file is a decent predictor of crypto bugs. Also, OpenSSL has a relatively poor track record of algorithm-level bugs. I'd like your sentence more if it read \"STOP USING CRYPTOGRAPHIC PRIMITIVES\" and then ended with a period.","fav_salty_score":"-1.6"},{"Hacker_News_User":"__david__","favorite_comments":"No, that's still not really a good way of looking at it--you are assuming those things are mutually exclusive when they aren't. I would call myself an agnostic atheist. I don't believe in gods, but I have to admit there's no way to prove they don't exist. I've met people who consider themselves agnostic theists--they think a god probably exists but they admit they cannot prove it.","fav_salty_score":"-1.7149999999999999"},{"Hacker_News_User":"dasil003","favorite_comments":"I mean concise compared to Java.  The reason is because I want to primarily use vim and not need an IDE.","fav_salty_score":"-0.012"},{"Hacker_News_User":"tlrobinson","favorite_comments":"I also received some shares for my birthday in 2002. Split adjusted the price was $7.22. I'd say my rabid Apple fanboy phase as a teenager actually paid off...","fav_salty_score":"-2.757"},{"Hacker_News_User":"gaius","favorite_comments":"Men, tho'. So no one cares.","fav_salty_score":"1.716"},{"Hacker_News_User":"rhizome","favorite_comments":"Just add internet and everything's different!","fav_salty_score":"-1.0"},{"Hacker_News_User":"fnordfnordfnord","favorite_comments":"Your ideal is a Unicorn, and if it existed, it probably wouldn't be able to find employment as a journalist. Instead of evenly distributed journalists who are a perfect match for whatever yours or anyone's ideal happens to be, what we get is a group of media organizations with a range of social and political goals, who tend to be staffed with journalists whose ideals are approximately aligned, and also a bunch of schmucks.","fav_salty_score":"1.263"},{"Hacker_News_User":"stcredzero","favorite_comments":"What does that say about programming languages?","fav_salty_score":"-0.994"},{"Hacker_News_User":"gfodor","favorite_comments":"I clicked on that expecting some kind of study to refute my random theory, which I'd find interesting, but it's a high level vague theory from Neil DeGrasse Tyson about the evidence of bias in society. (Something we should give approximately the same weight as any theory based on anecdotes and personal experience.) He'd be the last person to tell you his observations and this anecdote should be seriously used as a citation to lend yourself weight in an argument about the source of gender bias in tech.","fav_salty_score":"0.609"},{"Hacker_News_User":"HeyLaughingBoy","favorite_comments":"You're thinking too much. Far easier to just break into an expensive house, grab jewelry, and fence it. In and out in minutes, none of this potentially traceable internet crap.","fav_salty_score":"-0.5710000000000001"},{"Hacker_News_User":"pessimizer","favorite_comments":"Putting someone's picture (that happens to be on the web, publicly available) in a post on a site, where you happen to have ads does not count as \"using your image\" for commercial purposes. To me it does. I don't understand the operational difference between putting someone's image within whatever div has been designated the \"ad\" div or outside of it, other than location. If I don't understand it, surely teams of lawyers in opposition can create complicated rationales that justify any parties' usage of any other parties' work based on how much money the first party has to spend on lawyers.","fav_salty_score":"-1.804"},{"Hacker_News_User":"benatkin","favorite_comments":"I don't buy this. I'm not sure I'll do a good job at explaining why not, but it's more of a hunch than anything. The reason I don't buy it is because two average people can get married and have a happy family life simply by cooperating. Cooperating is not enough to succeed with a startup, they must also have a good enough idea, good execution of the idea, and some luck. Often nothing short of  brilliant execution of the idea will make a startup work. And they probably need exceptional people, not average people. Another thing is that a happy startup life, most of the time, is unsustainable. People at the startup can be happy and get along with each other right until they run out of funding. I've watched it happen. They often still get along after they've stopped working on it, but the startup has failed.","fav_salty_score":"1.771"},{"Hacker_News_User":"wisty","favorite_comments":"When terrorism in the big concern, droid strikes are used against real threats. General espionage is used to figure out what the real threats are. I guess they'd still be hoovering up everything they could, just in case, if it weren't for the threat of terrorism. Public opinion is strategically important (if a foreign power starts a war, how will their people react?), but it wouldn't be so important.","fav_salty_score":"-1.7269999999999999"},{"Hacker_News_User":"gcb0","favorite_comments":"not really. everyone involved in the NSA scandal is not elected. from the people that authorizes budget, to the contractors in hawaii reading your info, to the agents in CIA FBI building evidence against you, to the cops arresting you... not a single one is your representative. Your only representatives are all in the same dark as you are.","fav_salty_score":"1.811"},{"Hacker_News_User":"falcolas","favorite_comments":"Pessimistically, I believe they achieve such speed by strictly limiting the amount time they put into polish and bugfixes for the products they've already created. After all, it works for their platform, what more could someone want?","fav_salty_score":"0.056"},{"Hacker_News_User":"Argorak","favorite_comments":"You have to add some context :D. Yes, ConTeXt is so old that \"Google\" (or any kind of search engine) wasn't a thing back then, leading to that unfortunate situation. The Wiki is really good and links to a lot of resources, the TeX stackoverflow also provides lots of help.","fav_salty_score":"0.965"},{"Hacker_News_User":"cbsmith","favorite_comments":" I agree that Bitcoin is more or less irrelevant to the controversy It's relevant insofar that tip4commit likely couldn't get away with what it was doing without it.","fav_salty_score":"-0.978"},{"Hacker_News_User":"petercooper","favorite_comments":"That's interesting. MacRumors.com is the only blog I manually visit every few days too. Almost everything else is in my RSS reader but for some reason I still visit MacRumors \"by hand.\"","fav_salty_score":"2.541"},{"Hacker_News_User":"a3n","favorite_comments":"Edit: or shoot big satellites up there, containing the little satellite server swarms. Spit some more out when necessary.","fav_salty_score":"1.923"},{"Hacker_News_User":"sp332","favorite_comments":"Knight has different programs running. It was handling 10% of all NYSE, so it must have been running a lot of servers. When the berserk algorithm wanted to buy or sell a stock where Knight was the only \"market-maker\", another Knight server would usually intercept the order after it had been posted on the exchange. Here's one way it might have happened: Link.","fav_salty_score":"3.295"},{"Hacker_News_User":"anigbrowl","favorite_comments":"As someone with experience of working in remote environments like deserts for weeks at a time, and is thus aware of both the benefits and limitations of technology, can I suggest that you give your smug muscle a rest? I find that people who are at pains to point out how much smarter they are than everyone else get in the way when there's actual work to be done.","fav_salty_score":"-0.036000000000000004"},{"Hacker_News_User":"superuser2","favorite_comments":"Link.","fav_salty_score":"0.9570000000000001"},{"Hacker_News_User":"tripzilch","favorite_comments":" They only got a bit more clever when connecting different sims running on different conditions. Part of the reason why a lot of these nets are trained with added noise, as well as drop-out (randomly disabling 50% of the hidden neurons, every training step). Especially the drop-out tactic is particularly effective at preventing \"exploits\" of the neural net type, which otherwise appear in the form of large correlated weights (really big weights depending on other really big opposite weights to cancel out--it works, but it doesn't help learning). Either way, adding noisy hurdles helps because exploits are usually edge cases, and noise makes them less dependable, as the region of fitness space very close to an exploitable spot, is usually not very high-ranking at all (which is why you don't want your classifiers ending up there).","fav_salty_score":"-2.062"},{"Hacker_News_User":"bambax","favorite_comments":"  Like a lot of things, I think porn is fine if you're adult about it. We've got quite a lot of porn in our Chicago office...   Like a lot of things, I think guns are fine if you're adult about it. We've got quite a lot of guns in our Chicago office... (I'm sorry, did I misquote you?) Just because some things are fine if you're adult about it, doesn't make them appropriate at the office. Why would you have alcohol in an office?   But nobody drinks while they work (...) so many of us are parents So they're at the office, not working, and drinking beer. If their work is done (it has to be since you can't work  after beer) why don't they go home to their family and kids?","fav_salty_score":"-4.809"},{"Hacker_News_User":"davidw","favorite_comments":"Also, as an aside, if anyone happens through the area this summer, as always, I'm happy to go out for a drink/pizza/whatever with fellow hackers, and, time permitting, show you around Padova a bit.","fav_salty_score":"0.993"},{"Hacker_News_User":"dangrossman","favorite_comments":"The very first time I tried Linux, after spending an entire day downloading Slackware, copying it to a set of install diskettes, partitioning a hard drive and installing it, I set my root password to \"12345\". I was around 10 at the time, 1995 plus or minus a year or two. After booting for the first time, I dialed up AOL and logged on to a Linux-topic IRC channel. I talked to the strangers there about how excited I was to try Linux for the first time. I quit my IRC client and typed \"ls\". Command not found. I tried \"uptime\". Command not find. \"cd\". Command not found. While I was on IRC, someone had telnet'd in, guessed my stupidly simple password, and rm -rf'd the whole hard disk. I cried over breaking the computer and had to be consoled by my parents. I never used a common password again. I now miss the days when hackers and viruses alike just wanted to delete your files or print messages on your screen. Secretly taking over your still-functioning system is much nastier.","fav_salty_score":"2.498"},{"Hacker_News_User":"eru","favorite_comments":"All comprehensions get their own scope in Python 3.","fav_salty_score":"0.772"},{"Hacker_News_User":"tlrobinson","favorite_comments":"Someone needs to make a physical Thunderbolt port lock, like there are for Ethernet, USB, etc...","fav_salty_score":"-0.78"},{"Hacker_News_User":"steveklabnik","favorite_comments":"Yes, victims are often traumatized after an event like this, and it causes them to make poor decisions later. That doesn't invalidate the assault. Consent is consent.","fav_salty_score":"-2.34"},{"Hacker_News_User":"raldi","favorite_comments":"Supposedly they'll all be gone within seven years: Link.","fav_salty_score":"-0.999"},{"Hacker_News_User":"jamesbritt","favorite_comments":"And in New York.","fav_salty_score":"0.776"},{"Hacker_News_User":"praptak","favorite_comments":"\"The way to turn it off is a very small textual link in the footer of the page that says turn off buzz.\" Important quote from Link. \"But all this does is remove active links, leaving your profile still publicly available, along with any public buzzes you might have made while trying Buzz out. In fact, you're still technically following people, and they're following you. Not OK.\"","fav_salty_score":"1.271"},{"Hacker_News_User":"nkassis","favorite_comments":"Is everyone forgetting how many people are complaining about iPhone dropped calls? Might be AT&#38;T or something else, I'm not seeing as many complaints with their other phones. I have an HTC magic, never had issues with the dialer. Rogers in canada is pretty good, no dropped calls after 4 months of use. Only app that seems to hang my phone is twidgit. Great app, horrible performance.","fav_salty_score":"0.009000000000000001"},{"Hacker_News_User":"Someone1234","favorite_comments":" That assumes they don't improve the battery life in software over the next year, which they probably will. Honestly, they might. But I'd urge caution. If you drop down $350 on the \"basic\" version of this thing, then you're paying for what is on offer right now today. You cannot then complain if Apple didn't substantially improve the experience over the next year (rather than just releasing 2.0 and leaving 1.0 people $350 poorer with a device which they can barely even resell). All I am saying is, if you're happy with the Apple Watch as it exists on the day you buy it then you have nothing to lose. If you know you're going to be unhappy with it and will sit around waiting for Apple to fix it, then maybe instead just wait and buy it when it is actually good (or 2.0, whichever comes first).","fav_salty_score":"-4.769"},{"Hacker_News_User":"huhtenberg","favorite_comments":" AND you allow user input to be used in those system calls This is not required for exploiting the vulnerability at hand.","fav_salty_score":"-0.987"},{"Hacker_News_User":"joe_the_user","favorite_comments":"\"Most programmers only know how to program in obsolete ways\" -- This actually illustrates for me the problem of \"progress\" in programming approaches. Any \"new and better way\" that can't be grasped quickly and easily by a good fraction of programmer isn't really \"better\". The path to new systems flows along the line of least resistance. A better programming system is one which  can flow close enough to the lines of resistance that most programmers can adopt it.","fav_salty_score":"0.107"},{"Hacker_News_User":"latch","favorite_comments":"That's what I was thinking too... Then someone pointed out that Pulse doesn't come bundled with the NYTimes RSS feed - rather it lets people add whatever feed they want. Pulse isn't making money selling NYTimes content, its making money selling a way to consume content.","fav_salty_score":"-1.2610000000000001"},{"Hacker_News_User":"haberman","favorite_comments":"Hi there, upb author here, thanks for the shout-out! The stock protobuf implementation is pretty close to optimal given what it does.  Where upb is faster, it is faster by doing less. For example, I can beat protobuf if you don't write the parsed data into a tree structure (or only write a few fields).  I can beat it if your input has unknown fields and you don't care about preserving them.  But if what you need is a tree structure that contains 100% of the input data, protobuf is hard to beat speed-wise (though there are still a few tricks, like arena allocation, that can beat it given some usage patterns).","fav_salty_score":"-1.73"},{"Hacker_News_User":"crazygringo","favorite_comments":"In your experience, is OSX or Linux graphical software any better? Genuinely curious. I feel like interface freezes happen on all major platforms, and always assumed it had more to do with the applications than with the platforms. I mean, writing interfaces that never block is a lot more work. But I don't have a lot of cross-platform experience to know if some platforms make it easier than others.","fav_salty_score":"2.651"},{"Hacker_News_User":"rdouble","favorite_comments":"In the rest of the country being homeless is usually a crime.","fav_salty_score":"0.998"},{"Hacker_News_User":"vidarh","favorite_comments":"  In fact, for all the studying of the human form we humans do every day, we’re terrible at replicating and identifying the correct walking or running posture. There may very well be unique difficulties with running too, but I'd argue that what we are terrible at is replicating and identifying 3D scenes from 2D in general (and vice versa), to the point where it takes a  great deal of attention to detail to create 2D representation of 3D that most people can easily relate to. My goto example is Lego. Lego gets usually gets it right in their build instructions. Most of their competitors don't. Find some build instructions from any of the second-tier brand of building blocks, and it's often _far_ harder to relate the depictions in the instruction booklets to the in-progress models even if the sets are simple. Part of this is probably that most people are  really bad at actually watching mundane stuff with sufficient focus, even when drawing it right then and there, and instead tends to draw (usually inaccurate-but-good-enough) abstractions, and it's not surprising people get this wrong. Another example of what people often get wrong which is trivial to get \"right\" if you actually look: Draw a sunset over water, with the sun still above the horizon, with the suns reflections. This is a thing we've almost all seen lots of times - at least in pictures. Yet people often gets the reflections entirely wrong (compare a google image search for sunset photos vs. sunset drawings; on the other hand the  paintings mostly get it right) even though this is down to recognising and remembering a trivial geometric layout.","fav_salty_score":"6.007"},{"Hacker_News_User":"Confusion","favorite_comments":" <pre><code>  You can't battle your Java AI against your C# or Python AI</code></pre>In things like realtimebattle and the recent Google AI competition, you most certainly could. This is usually accomplished by routing all commands and their results via the command line.","fav_salty_score":"1.955"},{"Hacker_News_User":"notahacker","favorite_comments":"Which American invention did Nokia \"get a free ride off\"? The telephone? (invented by a Scot) Radio? (an Italian) The battery? (also Italian) Or do you mean the next generation stuff, like the computer, specifically ARM chips these days? (both British ideas), touchscreens (also British), GSM (pan-European project pioneered in Finland). Or is it the hundreds of millions of dollars worth of patents Apple licensed from Nokia last year? To put it bluntly, American exceptionalists would have a lot less room for triumphalism if they hadn't got a free ride off European investment in R&#38;D. Or we could decide that claiming part of the process of invention on behalf of a nation and claiming everyone else was just copying is a bit silly?","fav_salty_score":"2.843"},{"Hacker_News_User":"rdtsc","favorite_comments":"Is the issue interference or they want to stop people taking pictures and sending them or offering free hot spots?","fav_salty_score":"-0.996"},{"Hacker_News_User":"tomjen3","favorite_comments":"Go read up on Comparative advantage, it will make you feel less of a shit.","fav_salty_score":"0.525"},{"Hacker_News_User":"tlrobinson","favorite_comments":"My recommendations: Videos: * YUI Theater talks by Douglas Crockford: Link.\tespecially: * The JavaScript Programming Language * Advanced JavaScript Websites: * \"A Re-introduction to JavaScript\": Link. * Advanced tutorial from John Resig: Link. * MDC Reference: Link. Books (you can borrow my copies of these if you want): * \"JavaScript: The Good Parts\" * \"JavaScript: The Definitive Guide\" is a good reference for both the language and browser/DOM APIs","fav_salty_score":"2.753"},{"Hacker_News_User":"barrkel","favorite_comments":"Is it a local? I think the int declaration is for showing the type of x. It's just a code fragment as is.","fav_salty_score":"0.864"},{"Hacker_News_User":"mathattack","favorite_comments":"On 1-2% - it's the steadiness that is the issue.  Madoff didn't outperform all other hedge funds on overall performance, it's that he never lost money. I'm terms of gearing - if that is the source of returns, why invest in it to begin with when you can lever up on your own without a middleman?  Leverage has costs too. If the story is psychological bias, there are many better examples.","fav_salty_score":"1.308"},{"Hacker_News_User":"Steko","favorite_comments":"\"Both of them thought that independence was a bad idea, but could not provide much reason for this. \" The reasoning is generally that the plan is to keep the pound or join the Euro but sharing a currency but not a government is dangerous. The past decade of Germany's \"fuck you got mine\" agenda dominating EU monetary policy to the detriment of the periphery is normally used as exhibit A here.","fav_salty_score":"0.721"},{"Hacker_News_User":"byrneseyeview","favorite_comments":"Passed away? What a relief! I heard a rumor he died. Whatever happened to him instead sure sounds ambiguously pleasanter!","fav_salty_score":"-2.046"},{"Hacker_News_User":"greenyoda","favorite_comments":"\"But then Google came along and exploited the fact that the Internet was growing too fast for Yahoo! to keep up.\" That's an interesting re-write of history. There were general-purpose search engines like AltaVista (1995) years before Google came along (1998).","fav_salty_score":"-0.051000000000000004"},{"Hacker_News_User":"comex","favorite_comments":"Note that the EFF is trying to prosecute a case over this clause [1].  IANAL, but it seems to be hard to hold someone responsible for a bad DMCA notice unless they specifically knew that it was bad (rather than merely being sloppy and sending notices without adequately considering fair use).  Whether that is the case for this notice could theoretically be found out through discovery. [1] Link.","fav_salty_score":"-1.953"},{"Hacker_News_User":"pg","favorite_comments":"Oops, all I know is that this founder is from Sudan.","fav_salty_score":"-0.7030000000000001"},{"Hacker_News_User":"ars","favorite_comments":"It's time to bring back the town crier: Link. :)","fav_salty_score":"1.9609999999999999"},{"Hacker_News_User":"twoodfin","favorite_comments":"I'm glad this was posted here, otherwise I never would have known. Something all hackers should be paying attention to, certainly. Many implications for how we write our software, the future of networked communication and more.","fav_salty_score":"1.1280000000000001"},{"Hacker_News_User":"bunderbunder","favorite_comments":"Perhaps CPA is not the right metric. But a bunch of hype that glosses over the fact that Facebook doesn't really actually make very much money is not the right metric, either.","fav_salty_score":"-1.9500000000000002"},{"Hacker_News_User":"scott_s","favorite_comments":"In this case, I think the important question is, \"What if a reader comes to our blog having never heard of us and our product(s) before?\" This use case is, I think, more common that some assume, particularly when interesting blog posts get posted on forums like HN.","fav_salty_score":"-0.088"},{"Hacker_News_User":"arethuza","favorite_comments":"I've found that recruiters often invent the \"24 hours to decide\" bit so that they can force your hand and \"close\" the transaction. I would never dream of forcing someone to make such an important decision in such a short period of time.","fav_salty_score":"1.859"},{"Hacker_News_User":"hcarvalhoalves","favorite_comments":"Makes sense. Hershey's chocolate here (Brazil) taste like crap too - while although more expensive, I'm yet to find a bad product from Nestlé. I believe in the US they mainly ride on brand recognition. The bad taste is due to less cocoa content and more filler, like palm oil, or even paraffin (yeah, candle wax).","fav_salty_score":"0.076"},{"Hacker_News_User":"alttab","favorite_comments":"Ah I getcha now. I think my point is still valid though - and in fact full stack engineers are more likely to write a spaghetti code mess from the back to the front because they control the entire feature and may see the code in its entirety as one \"feature\" and thus one code base.","fav_salty_score":"0.108"},{"Hacker_News_User":"icefox","favorite_comments":"There was a great bbc or nova episode that followed a number of children as they passed into adolescence.  One of things they noted was how for a child there is no moral ambiguity. \"Your wife is very sick, but you have no money.  Your at a store and have the opportunity to steal some medicine, do you?\" The children always said it was wrong and there was no justification for stealing.  The 13 year old was very hesitant and unsure what to say. So for a 5th grader (11?) there is no emotion about it, the guy is cheating and will be reported on.","fav_salty_score":"2.289"},{"Hacker_News_User":"hugh3","favorite_comments":"Question: isn't \"uses the same programming language\" a pretty weak value of \"like-minded\"?","fav_salty_score":"-1.0"},{"Hacker_News_User":"eru","favorite_comments":"You want to see all your spam trophies?","fav_salty_score":"0.799"},{"Hacker_News_User":"smoyer","favorite_comments":"What really pisses me off about this application is the apparent lack of anger on HN.  Isn't anyone mad anymore? (but perhaps I'll see a spike now?)","fav_salty_score":"0.928"},{"Hacker_News_User":"fnordfnordfnord","favorite_comments":"Right, but good plumbers don't usually get the respect of a bad philosopher. And as far as that goes, education in the trades often fails to prepare the plumbers adequately for say, running their own plumbing business.","fav_salty_score":"0.314"},{"Hacker_News_User":"CamperBob2","favorite_comments":" I really do think Gandalf has a lot to offer the business community as an astute and personable negotiator. \"Wait, no, I have a better idea, how about this.  You sell me the gray Prius for 2.5% under factory invoice with the 2% APR financing we talked about earlier, or I summon the great worm Catyrpelius from his resting place in the Abyss to digest your entrails over a thousand years.  What?  Sure, I'll wait here while you run it by the sales manager.\"","fav_salty_score":"0.659"},{"Hacker_News_User":"StavrosK","favorite_comments":"On the contrary, I think that \"aggregate number of hours spent on HN this week\" would be a very good metric for \"interestingness of work this week\". Reversely correlated, of course. I would definitely draw that graph.","fav_salty_score":"1.12"},{"Hacker_News_User":"brudgers","favorite_comments":"I'm using Friedl's classification scheme for regex engines from  Mastering Regular Expressions. I don't know of a more standard survey regarding regex's as implemented in various programming languages. Anyway, from a practical standpoint an NFA has to be implemented as a push down automata in the Von Neumann machines we currently have to allow backtracking to simulate simultaneous exploration of the arbitrary number of DFA states that a single NFA state may represent. That doesn't make Friedl's classification useless.","fav_salty_score":"1.83"},{"Hacker_News_User":"chimeracoder","favorite_comments":"I don't think it's clear at all. There are a number of users on the IRC channel who seem to think that Atom will be open-source,  including some Github employees! (Tom Preston Warner has already stated that Atom's core will  not be open source)","fav_salty_score":"0.84"},{"Hacker_News_User":"ams6110","favorite_comments":"It's not massively cheaper to solve the problem of the building itself requiring some multiple of its current electrical service supply once all the tenants want to start charging their cars there.","fav_salty_score":"-0.93"},{"Hacker_News_User":"joelrunyon","favorite_comments":"Not sure about the legal differentiation, but a good practical explanation is here - Link.","fav_salty_score":"0.9590000000000001"},{"Hacker_News_User":"jerf","favorite_comments":"For comparison, a great deal of us in the US, if not most of us, were taught this: Link. And I hear this is fast on its way out, with cursive English script simply dying, with no replacement.","fav_salty_score":"0.0"},{"Hacker_News_User":"petervandijck","favorite_comments":"No incessant Techcrunch posts. (Although, hang on, actually...)","fav_salty_score":"1.9540000000000002"},{"Hacker_News_User":"dllthomas","favorite_comments":"I second the \"maintenance is cheaper than repair\".  If you neglect your health now, and buy into health insurance later, you're asking  future me to bear higher premiums and everyone is worse off - you  and others.  As one of your fellow countrymen presently footing the bill (in that I'm paying taxes  and I have good health insurance with no subsidy), I assure you that helping get you covered is no skin off my back.  \"But I just can't stomach the idea of taking money away from other people to pay for my own personal problems.\" If you're found unconscious somewhere because of an untreated ailment, the \"cost to other people for paying to for your own personal problems\" will be dramatically higher.  If you're conscious, you could maybe refuse emergency assistance, though I'd encourage you not to. If you really need to make it up to your fellow citizens, meet your civic responsibilities: put thought and research into voting, serve - honestly and intelligently - on juries when called, etc.  We ask some of you, it's fair for you to take what you're given without being exploitative.","fav_salty_score":"-0.106"},{"Hacker_News_User":"dang","favorite_comments":"This post was killed by user flags.","fav_salty_score":"0.981"},{"Hacker_News_User":"roc","favorite_comments":"I feel the same way.  But what in Mountain Lion sounds anything like that? All I see is popular out-of-the-box iOS apps/features being brought to the out-of-the-box OS X experience. What power users don't already have growl, dropbox, a dedicated notes app, a dedicated reminders app, an integrated chat client, etc? These Mountain Lion features are only iOS-like inasmuch as iOS had them out-of-the_box, while OS X users looked to third parties to provide them.  If you ask me, Mountain Lion sounds like a more reasoned approach to \"bring what works about iOS to OS X\" than misfires like \"Mission Control\".","fav_salty_score":"0.229"},{"Hacker_News_User":"e12e","favorite_comments":"Could you share some thoughts (or links) on the differences between LXC and linux-vserver? I played a little bit with that, and it seemed to promise \"true jails\" for Linux -- and LXC seems to be a natural successor -- any comment of what we've gained lost from the \"transition\"? I'd also love to hear what people think about the relationship between freebsd+jails, solaris+zones and Linux+LXC docker and or if it would make sense to modularize the back-end so that \"docker\" (as in the daemon management tools) would work for maintaining jails and or zones as well? It'd be fun to be able to run docker+LXC under GNU Debian Linux, and docker+jails under GNU Debian kFreebsd (and ditto for the Debian-like Ubunut-based solaris distros)... Maybe not  useful, but interesting...","fav_salty_score":"-0.847"},{"Hacker_News_User":"cbd1984","favorite_comments":"It's interesting, but it opens up a rather unsettling counter-countermeasure: If I'm Mallet, I don't want people using passwords I can't quickly force out of them. Therefore, I pretend I don't know about this, or don't believe it, and  keep using the rubber hose on people who are implementing this protocol. Therefore, those people get worked over longer and end up in a worse spot than people who  are able to give up a password quickly. Net result is that people are terrified of using this stuff because they know that if they don't give up a working password quickly they'll be tortured longer. Moral: This is probably a really good way to remember secure (that is, high-entropy) passwords. Don't pretend it's good for a use-case at which it is very obviously a horrible fit.","fav_salty_score":"-1.7570000000000001"},{"Hacker_News_User":"dragonwriter","favorite_comments":" The supposition is that a more expressive language lets you do more with a single line of code on average than a less expressive language. The second supposition is that commits tend to be done to gather code expressing a single chunk of functionality in a program, so that on the average commits have the same utility in terms of what they contribute to the source project. There's no really good reason to suspect that the second of these suppositions holds  to the same degree across different languages (which basically is equivalent to the assumption that development practices are independent of language.)  To be clear -- the reason that it is obvious that I and the author disagree with you on the first case is because your objection was a) an elementary one and a consideration important to all such investigations, therefore it would be considered by anyone doing such an investigation or analyzing one and b) we were disagreeing with you anyway. It would clearly be considered by anyone  competent doing such investigation, but since your first post on this thread didn't acknowledge the basis and challenge the correctness of the common criticism in the thread based on concerns of this type but explicitly and emphatically stated a lack of understanding of what the complaints were about, it appeared quite clearly that you didn't get it. The assumption of basic competence may be warranted, if only out of politeness, when someone doesn't explicitly state something inconsistent with that assumption, but when they do, that assumption becomes unwarranted.","fav_salty_score":"-1.616"},{"Hacker_News_User":"dasil003","favorite_comments":"Of course a threat that actually contains the word threat is probably more comedic than threatening.","fav_salty_score":"-0.972"},{"Hacker_News_User":"edw519","favorite_comments":"YOUR TEXT: \"We provide QA outsourcing services especially focused towards startups.\" MY QA: Replace \"QA\" with \"Quality Assurance\". Add a comma after \"services\". Replace \"towards\" with \"toward\". YOUR TEXT: \"With our good value services in the area of QA , you get to have excellent value for money while you focus on your core business.\" MY QA: Replace \"good value services in the area of QA\" with \"high quality QA services\". Eliminate \"to have\". Add \"your\" before \"money\". Replace \"while\" with \"so that you can\". YOUR TEXT: \"Some of the services are, 1- Functional Testing 2- Automation Testing 3- Usability Testing 4- Performance Testing 5- Security Testing\" MY QA: Replace \"the services are\" with \"our testing services include\". Remove all 5 instances of \"Testing\". Put commas after each phrase. Add a period at the end of the sentence. YOUR TEXT: Oh! and what else you would want us to have in our services especially for your needs? Any ideas? MY QA: Delete this sentence when you get done laughing. YOUR TEXT: \"Check out our website for more detail and we would be more than happy to have your ideas developed as our capabilities too.\" MY QA: Add a period after \"detail\". Delete \"and\" and capitalize \"we\" to begin a new sentence. Delete \"more than\". Delete \"to have your ideas developed as our capabilities too.\" YOUR TEXT: \"Cheers! Khurram Mir www.kraysis.com khurram@kraysis.com\" Replace \"Cheers!\" with \"Thank you.\" unless you are drinking (which I am about to do).","fav_salty_score":"-4.719"},{"Hacker_News_User":"coldtea","favorite_comments":" The reason taxi drivers have to pay for the right to work is that they need access to a taxi medallion to do their job. A medallion is a permit issued by the government that is required to drive a cab in most cities in America. If you don’t use the medallion yourself, you can rent it out to other drivers on your own or, more commonly, through a taxi company. Taxi companies that rent out access to the medallions have immense economic power over the drivers. If you’re not willing to basically become an indentured servant to get medallion access, well, you’re out of luck. I don't see how the medallion itself (a permit issued by the government) is the problem here. The problem is that the taxi drivers are not allowed to get it directly for themselves, but have to rent it. And another problem is that this \"indentured servant\" renting is allowed to take place. Fix that, not the requirement to have a permit to drive a cab (which is useful, as it acts as a filter for all kinds of scum drivers if enforced properly).","fav_salty_score":"2.917"},{"Hacker_News_User":"mseebach","favorite_comments":" d) The only thing that should (ideally) be stored on any RFID chip is a unique number I disagree. This is basically where RFID has its benefits. Transport for London has the Oyster card, which I'm pretty sure is \"electronic cash\", i.e. your balance is stored on the card. This allows the system to work without the  huge point of failure that is a central database  and the connections to it. They have millions of people passing though thousands of checkpoints, many of them on moving busses. The infrastructure needed to make sure that every single one of these checkpoints can at any given time instantly run a transaction on the central database vs. having autonomous readers that just needs to upload their log every once in a while is  huge. It's basically the difference between mainframes/dumb terminals and P2P. The problem is that RFID implementers have been cheap with the security on those chips. It's pretty simple to make a secure setup (famous last words....) tried and true ideas from cryptography (public key infrastructure etc..) but these call for more expensive chips, and when the choice is between expensive crypto that works and cheap security-through-obscurity that works until a grad-student is bored for the summer, you're going to go with the latter, of course.","fav_salty_score":"0.167"},{"Hacker_News_User":"daleharvey","favorite_comments":"Its a shame to have something so ill informed so highly voted, but ignoring the whole fact that there is no 'webkit' and people will still need to deal with these nightmares (hello safari) This comment I felt gave a good practical example of the more handwavey 'competition is good' argument \"Doing this would mean being forever stuck in single-threaded land for rendering (e.g. nothing like Mozilla's Servo project could ever happen). People have tried to parallelize WebKit and failed: too entangled, too much code making too many assumptions... Parallelism is one of those things that's just incredibly hard to bolt on after the fact. So if you want browsers to never really scale well to large number of cores, by all means try to get them to all switch to WebKit.\" Link.","fav_salty_score":"2.432"},{"Hacker_News_User":"falcolas","favorite_comments":"Galera is magic, I'll agree, but there are just too many shortcomings for me to recommend it for most people. Heartbeat is very problematic, I agree, but it's hardly the only solution out there (and far from the best solution). That said, I have learned that it's remarkably configurable, so many of the problems you encountered could probably be addressed, if you're willing to learn about Pacemaker and really dig into its configuration.","fav_salty_score":"-0.541"},{"Hacker_News_User":"josephlord","favorite_comments":"As far as I can see this doesn't answer the question.","fav_salty_score":"0.881"},{"Hacker_News_User":"michael_dorfman","favorite_comments":"I think xkcd has enough built-in \"barriers to entry\" to keep it a cult phenomenon-- I doubt that anyone reading the Times article who wasn't seriously tech savvy would be tempted to start following the strip.  I don't think we're going to see Jay Leno start cracking \"sudo\" jokes any time soon.","fav_salty_score":"1.7269999999999999"},{"Hacker_News_User":"krapp","favorite_comments":"Wow. I'm honestly kind of happy right now that none of my projects are very popular....","fav_salty_score":"1.442"},{"Hacker_News_User":"dang","favorite_comments":"Not sure what you mean by \"related to Hacker News\", but the guidelines are clear: anything that gratifies intellectual curiosity is on topic. I don't think it's hard to see how an article about a master of the pizza craft might gratify intellectual curiosity.","fav_salty_score":"0.193"},{"Hacker_News_User":"hristov","favorite_comments":"So you noticed the supposedly wrong typeface, but did not notice that the sign was in the incorrect language.","fav_salty_score":"-0.978"},{"Hacker_News_User":"rdl","favorite_comments":"That's the Akamai block page, but that doesn't mean it's an Akamai problem (could be something behind it).  However, it does absolutely mean some engineers are having a very bad Friday evening.","fav_salty_score":"-1.966"},{"Hacker_News_User":"iwwr","favorite_comments":"Other than the US, are there any other places in the world where \"tethering\" even exists as a concept?","fav_salty_score":"0.515"},{"Hacker_News_User":"rms","favorite_comments":"He should be ok, the editors are relatively benevolent.","fav_salty_score":"-0.998"},{"Hacker_News_User":"JoeAltmaier","favorite_comments":"Trouble is, sometimes coincidences occur. Humans are born to fasten onto faulty cause-and-effect relationships; its what kept us from being eaten by tigers a million years ago - \"Og saw a stripey cat; today we found him dead. Stripey cats are bad news\". And today its responsible for witchcraft, voodoo, the lottery, you name it.","fav_salty_score":"-0.137"},{"Hacker_News_User":"agumonkey","favorite_comments":"Is it the talk where they infer programs that will return 6 ?","fav_salty_score":"-0.803"},{"Hacker_News_User":"mjn","favorite_comments":"That's an interesting approach that I do think can improve some things, but I think the underlying problem is that incentives need to be changed. It's not only metrics, but just giving honest opinions: what use-cases do you  really think your algorithm is suited for, not looking at it in the most optimistic possible light? If academia weren't as ultra-competitive as it's become in the past two decades or so, I think there would be more chances of getting honest and useful answers to such questions in papers. One still finds them sometimes in papers of people who don't have to play \"the game\" anymore: papers by senior full-professor types are often quite interesting because of how they can say what they really think.","fav_salty_score":"3.699"},{"Hacker_News_User":"wmf","favorite_comments":"I think RMS is now pro-Java since OpenJDK came out. Harmony is a tool of capitalist oppression anyway.","fav_salty_score":"0.418"},{"Hacker_News_User":"mindcrime","favorite_comments":" Anecdotally my impression is that the diversity of stories has increased; we seem to have a wider cross-section of interests than a year ago. Yes, but that's not necessarily a Good Thing.  What we're getting are more and more stories on the front-page that are things that you could read about on CNN, MSNBC, or see on ABC Nightly News.   This is \"Hacker News\" not \"World News Tonight\".","fav_salty_score":"0.303"},{"Hacker_News_User":"wpietri","favorite_comments":" Big organizations are needed for big problems. Obviously false. You write via the Internet, which from the beginning has been created collaboratively, not hierarchically. (The big organization of the time, AT&#38;T, refused to participate. See \"When Wizards Stay Up Late\" for the history.) I read your comment via a Linux box. My OS was started by one guy and has been built up by a lot of individual voluntary contributors. The pyramids are a great example of what's wrong with bosses. For each pyramid, hundreds of thousands of people worked for years so a rich tyrant could impress people and feel better about dying.","fav_salty_score":"4.518"},{"Hacker_News_User":"lifeisstillgood","favorite_comments":" $19 billion in cash and stock (slightly less than the inflation adjusted cost of the Manhattan Project) Holy Crap !!!That cannot be right - surely not.... Edit: According to Wikipedia : \"The Manhattan Project began modestly in 1939, but grew to employ more than 130,000 people and cost nearly US$2 billion (about $26 billion in 2014 dollars).\" So, if you allow 7bn to be slightly less, then yes.  It is right. And there is worse to come - also according to wikipedia and the BBC, the US spends around 50bn pa, (the UK an embarrassing 4.6bn a year) on science funding -  but really, half of US science spending on a mobile IM app. How utterly depressing.","fav_salty_score":"0.314"},{"Hacker_News_User":"toomuchtodo","favorite_comments":"\"less safe\".","fav_salty_score":"-0.736"},{"Hacker_News_User":"dang","favorite_comments":" Does Airbnb pay you well? Accusing a fellow user of being a paid shill is not ok here. Please don't do that.","fav_salty_score":"-2.489"},{"Hacker_News_User":"scotty79","favorite_comments":"  There were two different perspectives (in journal articles) and you'd be assigned one to defend in the next class. I always thought of these kinds of assignments as somewhat strange. You have to defend something you might not care about, not believe in or even be strongly opposed to. I think that teaches you how to be politician. How to find arguments for the cause that is not yours for gains completely unrelated to the real validity or value of the cause. I felt we are being thought how to be dishonest and that it pays.","fav_salty_score":"-0.129"},{"Hacker_News_User":"nitrogen","favorite_comments":"This is the first time I've ever read the words \"Shut up\" on HN.  I am disappointed.","fav_salty_score":"1.991"},{"Hacker_News_User":"josefresco","favorite_comments":"Bought a Dell for just under $2K in 1999 (remember prices were much different then) with some serious gaming power for an off the shelf PC.  30 FPS was generally a minimum for this rig when playing games like Q3, UT and HL.  If that's costly to you, the TNT2 and other cards were cheaper than my voodoo3 3000 AGP and still delivered good results.","fav_salty_score":"-2.76"},{"Hacker_News_User":"DenisM","favorite_comments":"Ahem. May I ask you if it's possible that you atribute to \"hm?\" much more negaitve (and different) meaning than I put into it? Hm?","fav_salty_score":"2.144"},{"Hacker_News_User":"dragonwriter","favorite_comments":" For me, no exceptions is a show-stopper.  For me, no exceptions is a show-stopper. Go has exceptions, but it differs from, e.g., Java in that: 1. It handles raising and recovering from them, and specifying actions that must happen whether or not an exception occurs, through two built-in functions (panic recover) and a simple statement (defer) rather than a multi-armed structured syntax (try catch finally). 2. The built-in functions and standard library use panics (Go's exceptions) with more restraint than is idiomatic in Java.  In a typical scenario, I might be working on an utility that does some IO. In case of error, I just want to do some cleanup then exit. With exceptions, the control flow will jump right up to the places were cleanup has to be performed. And this works fine with Go's panics. You'll be more likely to need to decide that something is panic-worthy and explicitly panic in your lowest level call in Go than in Java (just as, conversely, you'll be more likely to need to explicitly catch and handle an exception thrown in Java for something that's not really exceptional in your use case.) But aside from that, there's not a lot of difference.  With return values, I need to check return values at each step of the call stack, which is tedious and ugly. Or check them at the lowest level of user code and, if there is a problem that is truly exception panic worthy at that level, call panic(). If you are checking errors at each level of the call stack just because the lowest level function uses (as is typical in Go) a secondary return values to report conditions outside the scope of the main return value, you aren't dividing functionality up properly between functions. Generally, I would think, the lowest level of user code that is specific enough to make an intelligent decision should either be collapsing out the unusual-condition secondary return value  or initiating a panic, depending on how the condition involved relates to the purpose of the code.","fav_salty_score":"-1.306"},{"Hacker_News_User":"tsotha","favorite_comments":"I'm pretty sure this kind of thing doesn't make governments nervous.  For one thing, they can always place a virus or a bug on your phone.  Or they can do it the old fashioned way and bug your car/office/bedroom. This will only going defeat the \"dragnet\" type stuff that combs through millions of conversations looking for keywords.  I guess that's something, but if you've managed to attract the all-seeing eye you shouldn't be lulled into a false sense of security because the link between your mobile and someone else's is secure.","fav_salty_score":"-2.463"},{"Hacker_News_User":"iuguy","favorite_comments":"What's the difference between the iPad 3 (retina) and this 4th generation they're talking about? Are they referring to an iPad Mini as 4th gen or are they saying the retina iPad (3rd gen) is 4th gen now?","fav_salty_score":"-0.435"},{"Hacker_News_User":"elwell","favorite_comments":"What exists in our biology but chemicals?","fav_salty_score":"0.538"},{"Hacker_News_User":"yummyfajitas","favorite_comments":"$1500 is roughly what you would pay in Journal Square or the heights. The really nice areas you mentioned cost a bit more, of course. Link.","fav_salty_score":"0.986"},{"Hacker_News_User":"DrJokepu","favorite_comments":"Old joke, but still funny. There was a similar \"job\" posted on the same site a couple of years ago, only that that one asked for solving the halting problem: Link.","fav_salty_score":"0.067"},{"Hacker_News_User":"larrys","favorite_comments":"\"University police essentially exist to cover up rapes on campus.\" Oh come on what kind of statement is that to make?","fav_salty_score":"-0.166"},{"Hacker_News_User":"tzs","favorite_comments":" Imagine if the resources being used to develop drones and bombs and other killing robots were instead being used to develop tools that would improve the lives of your average Afghani child The improvements would very likely violate Taliban law and the improved children and their parents would be targeted for accepting the improvements. Humans do not work the way you think they do.","fav_salty_score":"1.428"},{"Hacker_News_User":"rtpg","favorite_comments":"well that first example in the article would be <pre><code>    foldl (+) 0 (map (+2) [1..10])</code></pre>or <pre><code>    sum $ map (+2) [1..10]</code></pre>So... make up your own mind. As someone who has written only small chunks of lisp but at many different points in life, I do find the whole parens game to be a bit disorienting, but usually I can counter it by using newlines. I would write something like <pre><code>    (reduce + (map (comp inc inc) (range 10)))</code></pre>as <pre><code>    (reduce +            (map (comp inc inc)                 (range 10)))</code></pre>","fav_salty_score":"-0.039"},{"Hacker_News_User":"rdtsc","favorite_comments":"I am flocking to Dart. Just because there are handful of \"developers\" yelling and spitting at everyone here doesn't mean others don't like Dart or are not learning it.  They just don't yell and spit in everyone's face about so it makes it seems like \"OMG nobody uses Dart, please shut it down\". Dart is a great language, I like it. It has consistent typing rules, very fast, has a good IDE. I for one, would like to thank Google for working on it and open sourcing it.","fav_salty_score":"0.021"},{"Hacker_News_User":"gadders","favorite_comments":"3-4 drinks several times a week is a pretty low alcohol consumption.","fav_salty_score":"-1.0"},{"Hacker_News_User":"tlrobinson","favorite_comments":"He's not the brightest tool in the shed.","fav_salty_score":"-0.797"},{"Hacker_News_User":"Someone1234","favorite_comments":" Watching letters float and twist across a page, flipping and jumbling with gymnastic abandon, can be a daily frustration for readers with dyslexia. It can? I supposedly have severe dyslexia but if I ever witnessed words \"flipping, jumping, with gymnastic abandon across the page\" I'd go to the ER immediately, either I was having a stroke or had got very late term schizophrenia. Where do people get this stuff..? This \"Dyslexie\" font gets rolled out every few months, and has no credible scientific research backup up its effectiveness, and the little research that has been done more or less says it is a wash (improvement in some places, regression in other)[0]. It should be noted that this font is for sale. It is $89-99. So people have a motivation to advertise it beyond just the betterment of the world (and the author has an ulterior motivation for claiming it works). Ultimately until there is legitimate third party research into it that shows it works, then I'll regard it the same way I do alternative medicine. [0] Link.","fav_salty_score":"3.277"},{"Hacker_News_User":"wisty","favorite_comments":"Here's a twist - write them all down, but have a common prefix, suffix or replacement that you use. So every password on the paper is followed by \"pi43?\".","fav_salty_score":"-1.504"},{"Hacker_News_User":"Argorak","favorite_comments":"Because it's often of no interest for the customer. At all. It's like a star at the Oscars saying thanks to all the fans that supported them, except that there is no film, no Oscar and no fans. From a customers perspective, it's probably for the worst, even.","fav_salty_score":"0.376"},{"Hacker_News_User":"joubert","favorite_comments":"the actual lecture content: Link.","fav_salty_score":"0.898"},{"Hacker_News_User":"mhb","favorite_comments":" Doesn't look too much like your ordinary fluffy-self-help from my initial glances. I agree. And you might be interested in the author's c.v. (Link.): ABOUT MEI'm Gretchen Rubin. I started out as a lawyer. At Yale Law School, I was editor-in-chief of the Yale Law Journal and won a writing prize. I went on to clerk for Justice Sandra Day O’Connor on the U.S. Supreme Court. I had a great experience in law, but I realized that what I really wanted to do was to write. Since making the switch, I’ve published four books. I’m currently working on The Happiness Project. It will hit the shelves in January 2010 (Harper).","fav_salty_score":"5.889"},{"Hacker_News_User":"mattmaroon","favorite_comments":"What UI changes aren't in Vista? The stuff he highlights is a lot of why I prefer it to XP. And the thought of Vista's UI with XP's responsiveness makes me pretty excited for 7.","fav_salty_score":"1.29"},{"Hacker_News_User":"guard-of-terra","favorite_comments":"You can't compare that. You can't compare a person spending on themself versus a person donating to a cause. Or else you'll make a suggestion that we all move to slums because it's not fair that we get to live in an actual house when not everyone can afford that.","fav_salty_score":"1.873"},{"Hacker_News_User":"bradleyland","favorite_comments":"I agree with the first part of your statement, depending on your definition of \"company beliefs\". Corporate culture is pretty far from most consumer's minds at the time of purchase. You have to ask questions regarding the second half of your statement though: 1) Why are there 10 Android phones and 1 Windows phone? 2) Why do salesmen steer consumers way from Windows Phone? In my view, the first has to do with Microsoft's approach to Windows phone. Like Apple, and in contrast to Google, want tight control over the end-user experience. This combined with the fact that they were late to the market is creating a negative incentive for carrier's to put WP7 on handsets. I still maintain that the second has to do with the enormous momentum of consumer sentiment at this point. Phone salesmen spend a lot of time around phones. Many of them are \"in to phones\", so they're more acutely aware, albeit often misinformed, of the tech-punditry's view of these devices and the types of consumers that buy them. WP7 also lacked a strong device at launch, so a lackluster start resulted in negative feedback. The salesman is going to push what he likes, and gadget people like Android devices.","fav_salty_score":"5.906"},{"Hacker_News_User":"CWuestefeld","favorite_comments":" The spray, which is harmless to the environment, The first thing I think when I read something like that is \"how many years until they regret saying that?\"","fav_salty_score":"-0.8280000000000001"},{"Hacker_News_User":"tptacek","favorite_comments":"This particular argument is just not interesting to me. I disagree with you: I think lawyers dress like pretty much all the rest of the accountants, salespeople, marketing managers, and project managers that make up the modern workforce. I think that if there's any profession that  does have an informally enforced and idiosyncratic dress code, it's the programmers, with their surreptitious warnings to preferred job candidates not to wear a suit to the interview. I respect that you've had a different set of experiences and drawn different conclusions, but respectfully: I think I'm just going to be hard to convince otherwise on these points, and having a message board slapfight over which jobs wear more ties --- I can visualize myself trying to Google my way to a survey answer to this question now ---  shudder --- just seems like a terrible use of our time.","fav_salty_score":"-1.883"},{"Hacker_News_User":"amichail","favorite_comments":"Here's the Hacker News discussion: Link.","fav_salty_score":"0.731"}]